{"created":"2024-04-22 17:24:40","title":"Temporal Entanglement Profiles in Dual-Unitary Clifford Circuits with Measurements","abstract":"We study temporal entanglement in dual-unitary Clifford circuits with probabilistic measurements preserving spatial unitarity. We exactly characterize the temporal entanglement barrier in the measurement-free regime, exhibiting ballistic growth and decay and a volume-law peak. In the presence of measurements, we show that the initial ballistic growth of temporal entanglement with bath size is modified to diffusive, which can be understood through a mapping to a persistent random walk model. The peak value of the temporal entanglement barrier exhibits volume-law scaling for all measurement rates. Additionally, measurements modify the ballistic decay to the ``perfect dephaser limit\" with vanishing temporal entanglement to an exponential decay, which we describe through a spatial transfer matrix method. The spatial dynamics is shown to be described by a non-Hermitian hopping model, exhibiting a PT-breaking transition at a critical measurement rate $p=1/2$.","sentences":["We study temporal entanglement in dual-unitary Clifford circuits with probabilistic measurements preserving spatial unitarity.","We exactly characterize the temporal entanglement barrier in the measurement-free regime, exhibiting ballistic growth and decay and a volume-law peak.","In the presence of measurements, we show that the initial ballistic growth of temporal entanglement with bath size is modified to diffusive, which can be understood through a mapping to a persistent random walk model.","The peak value of the temporal entanglement barrier exhibits volume-law scaling for all measurement rates.","Additionally, measurements modify the ballistic decay to the ``perfect dephaser limit\" with vanishing temporal entanglement to an exponential decay, which we describe through a spatial transfer matrix method.","The spatial dynamics is shown to be described by a non-Hermitian hopping model, exhibiting a PT-breaking transition at a critical measurement rate $p=1/2$."],"url":"http://arxiv.org/abs/2404.14374v1","category":"quant-ph"}
{"created":"2024-04-22 17:01:45","title":"Highest-weight vectors and three-point functions in GKO coset decomposition","abstract":"We revisit the classical Goddard-Kent-Olive coset construction. We find the formulas for the highest weight vectors in coset decomposition and calculate their norms. We also derive formulas for matrix elements of natural vertex operators between these vectors. This leads to relations on conformal blocks. Due to the AGT relation, these relations are equivalent to blowup relations on Nekrasov partition functions with the presence of the surface defect. These relations can be used to prove Kyiv formulas for the Painlev\\'e tau-functions (following Nekrasov's method).","sentences":["We revisit the classical Goddard-Kent-Olive coset construction.","We find the formulas for the highest weight vectors in coset decomposition and calculate their norms.","We also derive formulas for matrix elements of natural vertex operators between these vectors.","This leads to relations on conformal blocks.","Due to the AGT relation, these relations are equivalent to blowup relations on Nekrasov partition functions with the presence of the surface defect.","These relations can be used to prove Kyiv formulas for the Painlev\\'e tau-functions (following Nekrasov's method)."],"url":"http://arxiv.org/abs/2404.14350v1","category":"math.QA"}
{"created":"2024-04-22 16:51:37","title":"New point of view about optical activity in helically-coiled fiber","abstract":"The optical activity in a helically-coiled optical fiber is reexamined. It is proven that not only is there no circular birefringence in the fiber but the polarization relative to the laboratory reference frame is not rotated along the fiber. The reason for this is that in contrast with the polarization vector, the Jones vector does not give a complete description of the polarization. As a mathematical entity in some local reference frame that depends on the instantaneous propagation direction, it can only describe the state of polarization relative to that reference frame. With the new implication of the Jones vector, the results of the experiment reported by Papp and Harms in 1977 are explained satisfactorily. In particular, it is shown that the state of polarization relative to the Tang frame remains unchanged along the fiber. The optical activity appears only relative to the Serret-Frenet frame.","sentences":["The optical activity in a helically-coiled optical fiber is reexamined.","It is proven that not only is there no circular birefringence in the fiber but the polarization relative to the laboratory reference frame is not rotated along the fiber.","The reason for this is that in contrast with the polarization vector, the Jones vector does not give a complete description of the polarization.","As a mathematical entity in some local reference frame that depends on the instantaneous propagation direction, it can only describe the state of polarization relative to that reference frame.","With the new implication of the Jones vector, the results of the experiment reported by Papp and Harms in 1977 are explained satisfactorily.","In particular, it is shown that the state of polarization relative to the Tang frame remains unchanged along the fiber.","The optical activity appears only relative to the Serret-Frenet frame."],"url":"http://arxiv.org/abs/2404.14334v1","category":"physics.optics"}
{"created":"2024-04-22 16:49:34","title":"DE-LIoT: The Data-Energy Networking Paradigm for Sustainable Light-Based Internet of Things","abstract":"The growing demand for Internet of Things (IoT) networks has sparked interest in sustainable, zero-energy designs through Energy Harvesting (EH) to extend the lifespans of IoT sensors. Visible Light Communication (VLC) is particularly promising, integrating signal transmission with optical power harvesting to enable both data exchange and energy transfer in indoor network nodes. VLC indoor channels, however, can be unstable due to their line-of-sight nature and indoor movements. In conventional EH-based IoT networks, maximum Energy Storage (ES) capacity might halt further harvesting or waste excess energy, leading to resource inefficiency. Addressing these issues, this paper proposes a novel VLC-based WPANs concept that enhances both data and energy harvesting efficiency. The architecture employs densely distributed nodes and a central controller for simultaneous data and energy network operation, ensuring efficient energy exchange and resource optimisation. This approach, with centralised control and energy-state-aware nodes, aims for long-term energy autonomy. The feasibility of the Data-Energy Networking-enabled Light-based Internet of Things (DE-LIoT) concept is validated through real hardware implementation, demonstrating its sustainability and practical applicability. Results show significant improvements in the lifetime of resource-limited nodes, confirming the effectiveness of this new data and energy networking model in enhancing sustainability and resource optimisation in VLC-based WPANs.","sentences":["The growing demand for Internet of Things (IoT) networks has sparked interest in sustainable, zero-energy designs through Energy Harvesting (EH) to extend the lifespans of IoT sensors.","Visible Light Communication (VLC) is particularly promising, integrating signal transmission with optical power harvesting to enable both data exchange and energy transfer in indoor network nodes.","VLC indoor channels, however, can be unstable due to their line-of-sight nature and indoor movements.","In conventional EH-based IoT networks, maximum Energy Storage (ES) capacity might halt further harvesting or waste excess energy, leading to resource inefficiency.","Addressing these issues, this paper proposes a novel VLC-based WPANs concept that enhances both data and energy harvesting efficiency.","The architecture employs densely distributed nodes and a central controller for simultaneous data and energy network operation, ensuring efficient energy exchange and resource optimisation.","This approach, with centralised control and energy-state-aware nodes, aims for long-term energy autonomy.","The feasibility of the Data-Energy Networking-enabled Light-based Internet of Things (DE-LIoT) concept is validated through real hardware implementation, demonstrating its sustainability and practical applicability.","Results show significant improvements in the lifetime of resource-limited nodes, confirming the effectiveness of this new data and energy networking model in enhancing sustainability and resource optimisation in VLC-based WPANs."],"url":"http://arxiv.org/abs/2404.14333v1","category":"cs.NI"}
{"created":"2024-04-22 16:03:44","title":"\"I Upload...All Types of Different Things to Say, the World of Blindness Is More Than What They Think It Is\": A Study of Blind TikTokers' Identity Work from a Flourishing Perspective","abstract":"Identity work in Human-Computer Interaction (HCI) has focused on the marginalized group to explore designs to support their asset (what they have). However, little has been explored specifically on the identity work of people with disabilities, specifically, visual impairments. In this study, we interviewed 45 BlindTokers (blind users on TikTok) from various backgrounds to understand their identity work from a positive design perspective. We found that BlindTokers leverage the affordance of the platform to create positive content, share their identities, and build the community with the desire to flourish. We proposed flourishing labor to present the work conducted by BlindTokers for their community's flourishing with implications to support the flourishing labor. This work contributes to understanding blind users' experience in short video platforms and highlights that flourishing is not just an activity for any single Blind user but also a job that needs all stakeholders, including all user groups and the TikTok platform, serious and committed contribution.","sentences":["Identity work in Human-Computer Interaction (HCI) has focused on the marginalized group to explore designs to support their asset (what they have).","However, little has been explored specifically on the identity work of people with disabilities, specifically, visual impairments.","In this study, we interviewed 45 BlindTokers (blind users on TikTok) from various backgrounds to understand their identity work from a positive design perspective.","We found that BlindTokers leverage the affordance of the platform to create positive content, share their identities, and build the community with the desire to flourish.","We proposed flourishing labor to present the work conducted by BlindTokers for their community's flourishing with implications to support the flourishing labor.","This work contributes to understanding blind users' experience in short video platforms and highlights that flourishing is not just an activity for any single Blind user but also a job that needs all stakeholders, including all user groups and the TikTok platform, serious and committed contribution."],"url":"http://arxiv.org/abs/2404.14305v1","category":"cs.HC"}
{"created":"2024-04-22 15:55:07","title":"Ultrafast low-energy photoelectron diffraction for the study of surface-adsorbate interactions with 100 femtosecond temporal resolution","abstract":"An ultrafast photoemission-based low-energy electron diffraction experiment with monolayer surface sensitivity is presented. In a first experiment on tin-phthalocyanine adsorbed on graphite, we demonstrate a time resolution of approx. 100 fs. Analysis of the transient photoelectron diffraction signal indicates a heating of the adsorbate layer on a time scale of a few ps, suggesting coupling to phononic degrees of freedom of the substrate as the primary energy transfer channel for the vibrational excitation of the adsorbate layer. Remarkably, the transient photoelectron diffraction signal not only provides direct information about the structural dynamics of the adsorbate, but also about the charge carrier dynamics of the substrate. The presented concept combined with momentum microscopy could become a versatile tool for the comprehensive investigation of the coupled charge and vibrational dynamics of relevance for ultrafast surface processes.","sentences":["An ultrafast photoemission-based low-energy electron diffraction experiment with monolayer surface sensitivity is presented.","In a first experiment on tin-phthalocyanine adsorbed on graphite, we demonstrate a time resolution of approx.","100 fs.","Analysis of the transient photoelectron diffraction signal indicates a heating of the adsorbate layer on a time scale of a few ps, suggesting coupling to phononic degrees of freedom of the substrate as the primary energy transfer channel for the vibrational excitation of the adsorbate layer.","Remarkably, the transient photoelectron diffraction signal not only provides direct information about the structural dynamics of the adsorbate, but also about the charge carrier dynamics of the substrate.","The presented concept combined with momentum microscopy could become a versatile tool for the comprehensive investigation of the coupled charge and vibrational dynamics of relevance for ultrafast surface processes."],"url":"http://arxiv.org/abs/2404.14297v1","category":"cond-mat.mes-hall"}
{"created":"2024-04-22 15:14:14","title":"A Joint Microwave and Hard X-Ray Study Towards Understanding the Transport of Accelerated Electrons during an Eruptive Solar Flare","abstract":"The standard flare model, despite its success, is limited in comprehensively explaining the various processes involving nonthermal particles. One such missing ingredient is a detailed understanding of the various processes involved during the transport of accelerated electrons from their site of acceleration to different parts of the flare region. Here we use simultaneous radio and X-ray observations from the Expanded Owens Valley Solar Array (EOVSA) and Spectrometer/Telescope for Imaging X-rays (STIX) onboard the Solar Orbiter (SolO), respectively, from two distinct viewing perspectives to study the electron transport processes. Through detailed spectral modeling of the coronal source using radio data and footpoint sources using X-ray spectra, we compare the nonthermal electron distribution at the coronal and footpoint sources. We find that the flux of nonthermal electrons precipitated at the footpoint is an order of magnitude greater than that trapped in the looptop, consistent with earlier works which primarily used X-ray for their studies. In addition, we find that the electron spectral indices obtained from X-ray footpoints is significantly softer than the spectral hardness of the nonthermal electron distribution in the corona. We interpret these differences based on transport effects and the difference in sensitivity of microwave and X-ray observations to different regimes of electron energies. Such an understanding is crucial for leveraging different diagnostic methods of nonthermal electrons simultaneously to achieve a more comprehensive understanding of the electron acceleration and transport processes of solar flares.","sentences":["The standard flare model, despite its success, is limited in comprehensively explaining the various processes involving nonthermal particles.","One such missing ingredient is a detailed understanding of the various processes involved during the transport of accelerated electrons from their site of acceleration to different parts of the flare region.","Here we use simultaneous radio and X-ray observations from the Expanded Owens Valley Solar Array (EOVSA) and Spectrometer/Telescope for Imaging X-rays (STIX) onboard the Solar Orbiter (SolO), respectively, from two distinct viewing perspectives to study the electron transport processes.","Through detailed spectral modeling of the coronal source using radio data and footpoint sources using X-ray spectra, we compare the nonthermal electron distribution at the coronal and footpoint sources.","We find that the flux of nonthermal electrons precipitated at the footpoint is an order of magnitude greater than that trapped in the looptop, consistent with earlier works which primarily used X-ray for their studies.","In addition, we find that the electron spectral indices obtained from X-ray footpoints is significantly softer than the spectral hardness of the nonthermal electron distribution in the corona.","We interpret these differences based on transport effects and the difference in sensitivity of microwave and X-ray observations to different regimes of electron energies.","Such an understanding is crucial for leveraging different diagnostic methods of nonthermal electrons simultaneously to achieve a more comprehensive understanding of the electron acceleration and transport processes of solar flares."],"url":"http://arxiv.org/abs/2404.14268v1","category":"astro-ph.SR"}
{"created":"2024-04-22 15:13:00","title":"Study of exclusive nonleptonic decay of $B_s^0\\to J/ψK_s$","abstract":"We study the exclusive two-body nonleptonic $B_s^0\\to J/\\psi K_s$ decay by considering the tree-level diagram within the framework of relativistic independent quark (RIQ) model based on a flavor-independent interaction potential in scalar-vector harmonic form. Using the factorization approximation, we calculate the weak form factors from the overlapping integrals of meson wave functions obtained in the RIQ model and predict the BF for $B_s^0\\to J/\\psi K_s$ decays in reasonable agreement with existing experimental result. Branching fraction of this decay is found to be within the detection ability of the LHCb Collaboration and can also be compared with the future theoretical predictions. We predict the ratio: ${\\cal R}\\big(\\frac{{\\cal B}(B_s^0\\to J/\\psi K_s)}{{\\cal B}(B_d^0\\to J/\\psi K_s)}\\big)$ which is in broad agreement with the data from LHCb Collaborations. This results indicate that the present approach works well in the description of exclusive nonleptonic $B_s^0\\to J/\\psi K_s$ decays within the framework of the RIQ model.","sentences":["We study the exclusive two-body nonleptonic $B_s^0\\to J/\\psi K_s$ decay by considering the tree-level diagram within the framework of relativistic independent quark (RIQ) model based on a flavor-independent interaction potential in scalar-vector harmonic form.","Using the factorization approximation, we calculate the weak form factors from the overlapping integrals of meson wave functions obtained in the RIQ model and predict the BF for $B_s^0\\to J/\\psi K_s$ decays in reasonable agreement with existing experimental result.","Branching fraction of this decay is found to be within the detection ability of the LHCb Collaboration and can also be compared with the future theoretical predictions.","We predict the ratio: ${\\cal R}\\big(\\frac{{\\cal B}(B_s^0\\to J/\\psi K_s)}{{\\cal B}(B_d^0\\to","J/\\psi K_s)}\\big)$ which is in broad agreement with the data from LHCb Collaborations.","This results indicate that the present approach works well in the description of exclusive nonleptonic $B_s^0\\to J/\\psi K_s$ decays within the framework of the RIQ model."],"url":"http://arxiv.org/abs/2404.14267v1","category":"hep-ph"}
{"created":"2024-04-22 15:12:27","title":"Two New $μ-τ$ Deviated Neutrino Mass Matrix Textures","abstract":"We propose two new neutrino mass matrix textures deviating from $\\mu-\\tau$ symmetry and explore their phenomenological implications. Both textures predict $\\theta_{23}$ and $\\delta$ within sharp bounds while considering both normal and inverted ordering of neutrino masses. We try to realize these proposed textures within the framework of the seesaw mechanism, in association with the $SU(2)_L \\times A_4 \\times Z_3$ symmetry group.","sentences":["We propose two new neutrino mass matrix textures deviating from $\\mu-\\tau$ symmetry and explore their phenomenological implications.","Both textures predict $\\theta_{23}$ and $\\delta$ within sharp bounds while considering both normal and inverted ordering of neutrino masses.","We try to realize these proposed textures within the framework of the seesaw mechanism, in association with the $SU(2)_L \\times A_4 \\times Z_3$ symmetry group."],"url":"http://arxiv.org/abs/2404.14264v1","category":"hep-ph"}
{"created":"2024-04-22 14:10:02","title":"Investigating the Properties of the Relativistic Jet and Hot Corona in AGN with X-ray Polarimetry","abstract":"X-ray polarimetry has been suggested as a prominent tool for investigating the geometrical and physical properties of the emissions from active galactic nuclei (AGN). The successful launch of the Imaging X-ray Polarimetry Explorer (IXPE) on 9 December 2021 has expanded the previously restricted scope of polarimetry into the X-ray domain, enabling X-ray polarimetric studies of AGN. Over a span of two years, IXPE has observed various AGN populations, including blazars and radio-quiet AGN. In this paper, we summarize the remarkable discoveries achieved thanks to the opening of the new window of X-ray polarimetry of AGN through IXPE observations. We will delve into two primary areas of interest: first, the magnetic field geometry and particle acceleration mechanisms in the jets of radio-loud AGN, such as blazars, where the relativistic acceleration process dominates the spectral energy distribution; and second, the geometry of the hot corona in radio-quiet AGN. Thus far, the IXPE results from blazars favor the energy-stratified shock acceleration model, and they provide evidence of helical magnetic fields inside the jet. Concerning the corona geometry, the IXPE results are consistent with a disk-originated slab-like or wedge-like shape, as could result from Comptonization around the accretion disk.","sentences":["X-ray polarimetry has been suggested as a prominent tool for investigating the geometrical and physical properties of the emissions from active galactic nuclei (AGN).","The successful launch of the Imaging X-ray Polarimetry Explorer (IXPE) on 9 December 2021 has expanded the previously restricted scope of polarimetry into the X-ray domain, enabling X-ray polarimetric studies of AGN.","Over a span of two years, IXPE has observed various AGN populations, including blazars and radio-quiet AGN.","In this paper, we summarize the remarkable discoveries achieved thanks to the opening of the new window of X-ray polarimetry of AGN through IXPE observations.","We will delve into two primary areas of interest: first, the magnetic field geometry and particle acceleration mechanisms in the jets of radio-loud AGN, such as blazars, where the relativistic acceleration process dominates the spectral energy distribution; and second, the geometry of the hot corona in radio-quiet AGN.","Thus far, the IXPE results from blazars favor the energy-stratified shock acceleration model, and they provide evidence of helical magnetic fields inside the jet.","Concerning the corona geometry, the IXPE results are consistent with a disk-originated slab-like or wedge-like shape, as could result from Comptonization around the accretion disk."],"url":"http://arxiv.org/abs/2404.14200v1","category":"astro-ph.HE"}
{"created":"2024-04-22 13:44:41","title":"Wakefield regeneration in a plasma accelerator","abstract":"Plasma wakefields offer high acceleration gradients, orders of magnitude larger than conventional RF accelerators. However, the achievable luminosity remains relatively low, typically limited by the plasma recovery time and the charge which can be accelerated per shot. In this work, we show that a train of drive bunches can be harnessed to accelerate multiple witness bunches in a single shot. We demonstrate that periodically loading the wakefields removes the limit on the energy transfer from the drive beam to the plasma, which allows the luminosity to be increased. Proof-of-concept simulations for the AWAKE scheme are carried out to demonstrate the technique, achieving a doubling of the accelerated charge while exploiting only a fraction of the drive train.","sentences":["Plasma wakefields offer high acceleration gradients, orders of magnitude larger than conventional RF accelerators.","However, the achievable luminosity remains relatively low, typically limited by the plasma recovery time and the charge which can be accelerated per shot.","In this work, we show that a train of drive bunches can be harnessed to accelerate multiple witness bunches in a single shot.","We demonstrate that periodically loading the wakefields removes the limit on the energy transfer from the drive beam to the plasma, which allows the luminosity to be increased.","Proof-of-concept simulations for the AWAKE scheme are carried out to demonstrate the technique, achieving a doubling of the accelerated charge while exploiting only a fraction of the drive train."],"url":"http://arxiv.org/abs/2404.14175v1","category":"physics.acc-ph"}
{"created":"2024-04-22 13:24:07","title":"Dynamical Spectra of Spin Supersolid States in Triangular Antiferromagnets","abstract":"We employ tensor network renormalization to explore the dynamical spectra of the easy-axis triangular-lattice antiferromagnet (TLAF) in a magnetic field. Our analysis identifies two distinct low-energy magnon excitations: a gapless Goldstone mode and a gapped mode. At zero field, the spectra display two nearly degenerate roton modes near the M point. With the increase of the magnetic field within the Y-shape superfluid phase, these modes diverge, with the roton excitation vanishing from the Goldstone mode branch, suggesting that the roton dip in this mode may just result from the energy-level repulsion imposed by the roton excitation in the gapped mode. Moreover, the in-plane spectral function shows substantial weight in high energies in the same spin excitation channel where the low-energy roton excitation appears. However, these roton excitations are absent in the V-shape supersolid phase.","sentences":["We employ tensor network renormalization to explore the dynamical spectra of the easy-axis triangular-lattice antiferromagnet (TLAF) in a magnetic field.","Our analysis identifies two distinct low-energy magnon excitations: a gapless Goldstone mode and a gapped mode.","At zero field, the spectra display two nearly degenerate roton modes near the M point.","With the increase of the magnetic field within the Y-shape superfluid phase, these modes diverge, with the roton excitation vanishing from the Goldstone mode branch, suggesting that the roton dip in this mode may just result from the energy-level repulsion imposed by the roton excitation in the gapped mode.","Moreover, the in-plane spectral function shows substantial weight in high energies in the same spin excitation channel where the low-energy roton excitation appears.","However, these roton excitations are absent in the V-shape supersolid phase."],"url":"http://arxiv.org/abs/2404.14163v1","category":"cond-mat.str-el"}
{"created":"2024-04-22 13:19:15","title":"Topological susceptibility and axion potential in two-flavor superconductive quark matter","abstract":"We study the potential of the axion, $a$, of Quantum Chromodynamics, in the two-flavor color superconducting phase of cold and dense quark matter. We adopt a Nambu-Jona-Lasinio-like model. Our interaction contains two terms, one preserving and one breaking the $U(1)_A$ symmetry: the latter is responsible of the coupling of axions to quarks. We introduce two quark condensates, $h_L$ and $h_R$, describing condensation for left-handed and right-handed quarks respectively; we then study the loci of the minima of the thermodynamic potential, $\\Omega$, in the $(h_L,h_R)$ plane, noticing how the instanton-induced interaction favors condensation in the scalar channel when the $\\theta-$angle, $\\theta=a/f_a$, vanishes. Increasing $\\theta$ we find a phase transition where the scalar condensate rotates into a pseudo-scalar one. We present an analytical result for the topological susceptibility, $\\chi$, in the superconductive phase, which stands both at zero and at finite temperature. Finally, we compute the axion mass and its self-coupling. In particular, the axion mass $m_a$ is related to the full topological susceptibility via $\\chi=m_a^2 f_a^2$, hence our result for $\\chi$ gives an analytical result for $m_a$ in the superconductive phase of high-density Quantum Chromodynamics.","sentences":["We study the potential of the axion, $a$, of Quantum Chromodynamics, in the two-flavor color superconducting phase of cold and dense quark matter.","We adopt a Nambu-Jona-Lasinio-like model.","Our interaction contains two terms, one preserving and one breaking the $U(1)_A$ symmetry: the latter is responsible of the coupling of axions to quarks.","We introduce two quark condensates, $h_L$ and $h_R$, describing condensation for left-handed and right-handed quarks respectively; we then study the loci of the minima of the thermodynamic potential, $\\Omega$, in the $(h_L,h_R)$ plane, noticing how the instanton-induced interaction favors condensation in the scalar channel when the $\\theta-$angle, $\\theta=a/f_a$, vanishes.","Increasing $\\theta$ we find a phase transition where the scalar condensate rotates into a pseudo-scalar one.","We present an analytical result for the topological susceptibility, $\\chi$, in the superconductive phase, which stands both at zero and at finite temperature.","Finally, we compute the axion mass and its self-coupling.","In particular, the axion mass $m_a$ is related to the full topological susceptibility via $\\chi=m_a^2 f_a^2$, hence our result for $\\chi$ gives an analytical result for $m_a$ in the superconductive phase of high-density Quantum Chromodynamics."],"url":"http://arxiv.org/abs/2404.14160v1","category":"hep-ph"}
{"created":"2024-04-22 12:57:41","title":"Full QCD with milder topological freezing","abstract":"We simulate $N_f=2+1$ QCD at the physical point combining open and periodic boundary conditions in a parallel tempering framework, following the original proposal by M. Hasenbusch for $2d$ $\\mathrm{CP}^{N-1}$ models, which has been recently implemented and widely employed in $4d$ $\\mathrm{SU}(N)$ pure Yang-Mills theories too. We show that using this algorithm it is possible to achieve an impressive reduction of the auto-correlation time of the topological charge in dynamical fermions simulations both at zero and finite temperature up to two orders of magnitude, allowing to avoid topology freezing down to lattice spacings as fine as $a \\sim 0.02$ fm. Therefore, this implementation of the Parallel Tempering on Boundary Conditions algorithm has the potential to substantially push forward the investigation of the QCD vacuum properties by means of lattice simulations.","sentences":["We simulate $N_f=2+1$ QCD at the physical point combining open and periodic boundary conditions in a parallel tempering framework, following the original proposal by M. Hasenbusch for $2d$ $\\mathrm{CP}^{N-1}$ models, which has been recently implemented and widely employed in $4d$ $\\mathrm{SU}(N)$ pure Yang-Mills theories too.","We show that using this algorithm it is possible to achieve an impressive reduction of the auto-correlation time of the topological charge in dynamical fermions simulations both at zero and finite temperature up to two orders of magnitude, allowing to avoid topology freezing down to lattice spacings as fine as $a \\sim 0.02$ fm.","Therefore, this implementation of the Parallel Tempering on Boundary Conditions algorithm has the potential to substantially push forward the investigation of the QCD vacuum properties by means of lattice simulations."],"url":"http://arxiv.org/abs/2404.14151v1","category":"hep-lat"}
{"created":"2024-04-22 12:48:10","title":"Two dimensional arrays of Bose-Einstein condensates: interference and stochastic collapse dynamics","abstract":"We demonstrate two-dimensional arrays of Bose-Einstein condensates (BECs) as a new experimental platform with parallel quantum simulation capability. A defect-free array of up to 49 BECs is formed by loading a single BEC with 50,000 atoms into 7*7 optical wells. Each BEC is prepared with independent phases, confirmed by matterwave interference. Based on BEC arrays, we realize fast determination of the phase boundary of BECs with attractive interactions. We also observe the stochastic collapse dynamics from the distribution of atom numbers in the array. We show that the collapse of a BEC can occur much faster than the averaged decay of an ensemble. The BEC arrays enable new forms of experiments to drastically increase the measurement throughput and to quantum simulate, say, large 2D Josephson-junction arrays.","sentences":["We demonstrate two-dimensional arrays of Bose-Einstein condensates (BECs) as a new experimental platform with parallel quantum simulation capability.","A defect-free array of up to 49 BECs is formed by loading a single BEC with 50,000 atoms into 7*7 optical wells.","Each BEC is prepared with independent phases, confirmed by matterwave interference.","Based on BEC arrays, we realize fast determination of the phase boundary of BECs with attractive interactions.","We also observe the stochastic collapse dynamics from the distribution of atom numbers in the array.","We show that the collapse of a BEC can occur much faster than the averaged decay of an ensemble.","The BEC arrays enable new forms of experiments to drastically increase the measurement throughput and to quantum simulate, say, large 2D Josephson-junction arrays."],"url":"http://arxiv.org/abs/2404.14142v1","category":"cond-mat.quant-gas"}
{"created":"2024-04-22 12:28:34","title":"Discovery of a long thermonuclear X-ray burst from the ultra-compact binary 4U 1850$-$087","abstract":"We report the detection of a long X-ray burst triggered on MJD 60171.65 from the ultra-compact binary 4U 1850$-$087 by the Monitor of All-sky X-ray Image and Neutron Star Interior Composition Explorer (NICER). We analyse the NICER data observed in between MJD 60095.19$-$60177.43, including one observation covered part of the long X-ray burst tail, i.e., $0.15-3.8$ hr after the trigger. The persistent spectra are quite similar and well described by a combination of multi-color disk blackbody, with the inner temperature of 0.5 keV, and a thermally comptonized continuum with the asymptotic power-law photon index of $\\Gamma\\sim2.2$, and electron temperature of $kT_{\\rm e}\\sim20-30$ keV. The persistent fluxes were around $3.8\\times10^{-10}~{\\rm erg~cm^{-2}~s^{-1}}$, corresponding to a local accretion rate of $1\\%~\\dot{m}_{\\rm Edd}$. Part of time-resolved burst spectra show a clear deviation from the blackbody model, which can be improved by considering the enhanced persistent emission due to the Poynting-Robertson drag, or the reflected disk emission illuminated by the burst. From the burst flux during the cooling tail, we estimate the burst duration, $\\tau \\approx 0.78$ hr, the burst fluence, $E_\\mathrm{b} \\approx 4.1 \\times 10^{41}$ ergs, and the ignition column depth, $y_{\\rm ign}\\approx 3.5\\times10^{10}~{\\rm g~cm^{-2}}$. We propose that the long X-ray burst is powered by unstable burning of pure helium in deep layer. Moreover, we identify significant 1 keV emission lines in the burst spectra, which may originate from the surrounding disk.","sentences":["We report the detection of a long X-ray burst triggered on MJD 60171.65 from the ultra-compact binary 4U 1850$-$087 by the Monitor of All-sky X-ray Image and Neutron Star Interior Composition Explorer (NICER).","We analyse the NICER data observed in between MJD 60095.19$-$60177.43, including one observation covered part of the long X-ray burst tail, i.e., $0.15-3.8$ hr after the trigger.","The persistent spectra are quite similar and well described by a combination of multi-color disk blackbody, with the inner temperature of 0.5 keV, and a thermally comptonized continuum with the asymptotic power-law photon index of $\\Gamma\\sim2.2$, and electron temperature of $kT_{\\rm e}\\sim20-30$ keV.","The persistent fluxes were around $3.8\\times10^{-10}~{\\rm erg~cm^{-2}~s^{-1}}$, corresponding to a local accretion rate of $1\\%~\\dot{m}_{\\rm Edd}$. Part of time-resolved burst spectra show a clear deviation from the blackbody model, which can be improved by considering the enhanced persistent emission due to the Poynting-Robertson drag, or the reflected disk emission illuminated by the burst.","From the burst flux during the cooling tail, we estimate the burst duration, $\\tau \\approx 0.78$ hr, the burst fluence, $E_\\mathrm{b} \\approx 4.1 \\times 10^{41}$ ergs, and the ignition column depth, $y_{\\rm ign}\\approx 3.5\\times10^{10}~{\\rm g~cm^{-2}}$. We propose that the long X-ray burst is powered by unstable burning of pure helium in deep layer.","Moreover, we identify significant 1 keV emission lines in the burst spectra, which may originate from the surrounding disk."],"url":"http://arxiv.org/abs/2404.14129v1","category":"astro-ph.HE"}
{"created":"2024-04-22 12:16:37","title":"Exploring accelerated expansion in the universe: A study of $f(Q,T)$ gravity with parameterized EoS and cosmological constraints","abstract":"The study conducted in this research paper utilizes the $f(Q,T)$ gravity, where $Q$ represents non-metricity and $T$ represents the trace of the energy-momentum tensor, to investigate the accelerated expansion of the universe. To complete the study, an effective EoS with one parameter $\\alpha$, is parameterized as $\\omega _{eff}=-\\frac{3}{\\alpha (1+z)^{3}+3}$. The linear version of $f(Q,T)=-Q+\\sigma T$ is also considered, where $\\sigma$ is a constant. By constraining the model with six BAO points, 57 Hubble points, and 1048 Pantheon sample datasets, the parameters $\\alpha$ and $\\sigma$ are determined to best match the data. The cosmological parameters and energy conditions for the model are derived and examined. The results show that the model is in good agreement with observations, and can serve as a valuable starting point for analyzing FLRW models in the $f(Q,T)$ theory of gravity.","sentences":["The study conducted in this research paper utilizes the $f(Q,T)$ gravity, where $Q$ represents non-metricity and $T$ represents the trace of the energy-momentum tensor, to investigate the accelerated expansion of the universe.","To complete the study, an effective EoS with one parameter $\\alpha$, is parameterized as $\\omega _{eff}=-\\frac{3}{\\alpha (1+z)^{3}+3}$. The linear version of $f(Q,T)=-Q+\\sigma T$ is also considered, where $\\sigma$ is a constant.","By constraining the model with six BAO points, 57 Hubble points, and 1048 Pantheon sample datasets, the parameters $\\alpha$ and $\\sigma$ are determined to best match the data.","The cosmological parameters and energy conditions for the model are derived and examined.","The results show that the model is in good agreement with observations, and can serve as a valuable starting point for analyzing FLRW models in the $f(Q,T)$ theory of gravity."],"url":"http://arxiv.org/abs/2404.14120v1","category":"astro-ph.CO"}
{"created":"2024-04-22 10:21:44","title":"Two-Loop Contributions to the Anomalous Chromomagnetic Dipole Moment of the Top Quark in Two-Higgs-Doublet Models","abstract":"We present the analytical results for the anomalous chromomagnetic moment of a quark at the one-loop and two-loop levels through model-independent parameterizations, considering the external gluon to be off-shell. Then, we consider different types of two-Higgs doublet models with the momentum transfer of the external gluon, $q^2 = \\pm M_Z^2$, and $0$, for the numerical evaluations thereof for the top quark. We find that the contributions in the two-Higgs-doublet models are on the order of $\\mathcal{O}(10^{-3})$ at the one-loop level and $\\mathcal{O}(10^{-4})$ at the two-loop level, where the one-loop and two-loop contributions interfere destructively, resulting in the overall contributions being on the order of $\\mathcal{O}(10^{-3})$ with a positive sign.","sentences":["We present the analytical results for the anomalous chromomagnetic moment of a quark at the one-loop and two-loop levels through model-independent parameterizations, considering the external gluon to be off-shell.","Then, we consider different types of two-Higgs doublet models with the momentum transfer of the external gluon, $q^2 = \\pm M_Z^2$, and $0$, for the numerical evaluations thereof for the top quark.","We find that the contributions in the two-Higgs-doublet models are on the order of $\\mathcal{O}(10^{-3})$ at the one-loop level and $\\mathcal{O}(10^{-4})$ at the two-loop level, where the one-loop and two-loop contributions interfere destructively, resulting in the overall contributions being on the order of $\\mathcal{O}(10^{-3})$ with a positive sign."],"url":"http://arxiv.org/abs/2404.14065v1","category":"hep-ph"}
{"created":"2024-04-22 09:27:35","title":"Fission barriers with Weizsäcker-Skyrme mass model","abstract":"Based on Weizs\\\"acker-Skyrme (WS4) mass model, the fission barriers of nuclei are systematically studied. Considering the shell corrections and the macroscopic deformation energy, the fission barrier heights for nuclei with $Z\\geqslant 82$ can be well described, with an rms deviation of 0.481 MeV with respect to 71 empirical barrier heights. In addition to the shell correction at the ground state, the shell correction at the saddle point and its relative value are also important for both deformed nuclei and spherical nuclei. The fission barriers for nuclei far from the $\\beta$-stability line and super-heavy nuclei are also predicted with the proposed approach.","sentences":["Based on Weizs\\\"acker-Skyrme (WS4) mass model, the fission barriers of nuclei are systematically studied.","Considering the shell corrections and the macroscopic deformation energy, the fission barrier heights for nuclei with $Z\\geqslant 82$ can be well described, with an rms deviation of 0.481 MeV with respect to 71 empirical barrier heights.","In addition to the shell correction at the ground state, the shell correction at the saddle point and its relative value are also important for both deformed nuclei and spherical nuclei.","The fission barriers for nuclei far from the $\\beta$-stability line and super-heavy nuclei are also predicted with the proposed approach."],"url":"http://arxiv.org/abs/2404.14014v1","category":"nucl-th"}
{"created":"2024-04-22 09:23:24","title":"Internal sites of actuation and activation in thin elastic films and membranes of finite thickness","abstract":"Functionalized thin elastic films and membranes frequently feature internal sites of net forces or stresses. These are, for instance, active sites of actuation, or rigid inclusions in a strained membrane that induce counterstress upon externally imposed deformations. We theoretically analyze the geometry of isotropic, flat, thin, linearly elastic films or membranes of finite thickness, laterally extended to infinity. At the mathematical core of such characterizations are the fundamental solutions for localized force and stress singularities associated with corresponding Green's functions. We derive such solutions in three dimensions and place them into the context of previous two-dimensional calculations. To this end, we consider both no-slip and stress-free conditions at the top and/or bottom surfaces. We provide an understanding for why the fully free-standing thin elastic membrane leads to diverging solutions in most geometries and compare these situations to the truly two-dimensional case. A no-slip support of at least one of the surfaces stabilizes the solution, which illustrates that the divergences in the fully free-standing case are connected to global deformations. Within the mentioned framework, our results are important for associated theoretical characterizations of thin elastic films, whether supported or free-standing, and of membranes subject to internal or external forces or stresses.","sentences":["Functionalized thin elastic films and membranes frequently feature internal sites of net forces or stresses.","These are, for instance, active sites of actuation, or rigid inclusions in a strained membrane that induce counterstress upon externally imposed deformations.","We theoretically analyze the geometry of isotropic, flat, thin, linearly elastic films or membranes of finite thickness, laterally extended to infinity.","At the mathematical core of such characterizations are the fundamental solutions for localized force and stress singularities associated with corresponding Green's functions.","We derive such solutions in three dimensions and place them into the context of previous two-dimensional calculations.","To this end, we consider both no-slip and stress-free conditions at the top and/or bottom surfaces.","We provide an understanding for why the fully free-standing thin elastic membrane leads to diverging solutions in most geometries and compare these situations to the truly two-dimensional case.","A no-slip support of at least one of the surfaces stabilizes the solution, which illustrates that the divergences in the fully free-standing case are connected to global deformations.","Within the mentioned framework, our results are important for associated theoretical characterizations of thin elastic films, whether supported or free-standing, and of membranes subject to internal or external forces or stresses."],"url":"http://arxiv.org/abs/2404.14011v1","category":"cond-mat.soft"}
{"created":"2024-04-22 09:13:49","title":"Translational hulls of semigroups of endomorphisms of an algebra","abstract":"We consider the translational hull $\\Omega(I)$ of an arbitrary subsemigroup $I$ of an endomorphism monoid $\\mathrm{End}(A)$ where $A$ is a universal algebra. We give conditions for every bi-translation of $I$ to be realised by transformations, or by endomorphisms, of $A$. We demonstrate that certain of these conditions are also sufficient to provide natural isomorphisms between the translational hull of $I$ and the idealiser of $I$ within $\\mathrm{End}(A)$, which in the case where $I$ is an ideal is simply $\\mathrm{End}(A)$. We describe the connection between these conditions and work of Petrich and Gluskin in the context of densely embedded ideals. Where the conditions fail, we develop a methodology to extract information concerning $\\Omega(I)$ from the translational hull $\\Omega(I/{\\approx})$ of a quotient $I/{\\approx}$ of $I$. We illustrate these concepts in detail in the cases where $A$ is: a free algebra; an independence algebra; a finite symmetric group.","sentences":["We consider the translational hull $\\Omega(I)$ of an arbitrary subsemigroup $I$ of an endomorphism monoid $\\mathrm{End}(A)$ where $A$ is a universal algebra.","We give conditions for every bi-translation of $I$ to be realised by transformations, or by endomorphisms, of $A$.","We demonstrate that certain of these conditions are also sufficient to provide natural isomorphisms between the translational hull of $I$ and the idealiser of $I$ within $\\mathrm{End}(A)$, which in the case where $I$ is an ideal is simply $\\mathrm{End}(A)$. We describe the connection between these conditions and work of Petrich and Gluskin in the context of densely embedded ideals.","Where the conditions fail, we develop a methodology to extract information concerning $\\Omega(I)$ from the translational hull $\\Omega(I/{\\approx})$ of a quotient $I/{\\approx}$ of $I$. We illustrate these concepts in detail in the cases where $A$ is: a free algebra; an independence algebra; a finite symmetric group."],"url":"http://arxiv.org/abs/2404.14005v1","category":"math.RA"}
{"created":"2024-04-22 08:09:37","title":"Dynamic critical exponent in quantum long-range models","abstract":"Quantum long-range models at zero temperature can be described by fractional Lifshitz field theories, that is, anisotropic models whose actions are short-range in time and long-range in space. In this paper we study the renormalization of fractional Lifshitz field theories with weakly relevant cubic or quartic self-interactions. Their nontrivial infrared fixed points exhibit Lifshitz scale invariance, and we compute the lowest-order corrections to the dynamic critical exponent.","sentences":["Quantum long-range models at zero temperature can be described by fractional Lifshitz field theories, that is, anisotropic models whose actions are short-range in time and long-range in space.","In this paper we study the renormalization of fractional Lifshitz field theories with weakly relevant cubic or quartic self-interactions.","Their nontrivial infrared fixed points exhibit Lifshitz scale invariance, and we compute the lowest-order corrections to the dynamic critical exponent."],"url":"http://arxiv.org/abs/2404.13963v1","category":"hep-th"}
{"created":"2024-04-22 08:05:21","title":"Low-energy modeling of three-dimensional topological insulator nanostructures","abstract":"We develop an accurate nanoelectronic modeling approach for realistic three-dimensional topological insulator nanostructures and investigate their low-energy surface-state spectrum. Starting from the commonly considered four-band $\\boldsymbol{\\mathrm{k\\cdot p}}$ bulk model Hamiltonian for the Bi$_2$Se$_3$ family of topological insulators, we derive new parameter sets for Bi$_2$Se$_3$, Bi$_2$Te$_3$ and Sb$_2$Te$_3$. We consider a fitting strategy applied to \\emph{ab initio} band structures around the $\\Gamma$ point that ensures a quantitatively accurate description of the low-energy bulk and surface states, while avoiding the appearance of unphysical low-energy states at higher momenta, something that is not guaranteed by the commonly considered perturbative approach. We analyze the effects that arise in the low-energy spectrum of topological surface states due to band anisotropy and electron-hole asymmetry, yielding Dirac surface states that naturally localize on different side facets. In the thin-film limit, when surface states hybridize through the bulk, we resort to a thin-film model and derive thickness-dependent model parameters from \\emph{ab initio} calculations that show good agreement with experimentally resolved band structures, unlike the bulk model that neglects relevant many-body effects in this regime. Our versatile modeling approach offers a reliable starting point for accurate simulations of realistic topological material-based nanoelectronic devices.","sentences":["We develop an accurate nanoelectronic modeling approach for realistic three-dimensional topological insulator nanostructures and investigate their low-energy surface-state spectrum.","Starting from the commonly considered four-band $\\boldsymbol{\\mathrm{k\\cdot p}}$ bulk model Hamiltonian for the Bi$_2$Se$_3$ family of topological insulators, we derive new parameter sets for Bi$_2$Se$_3$, Bi$_2$Te$_3$ and Sb$_2$Te$_3$. We consider a fitting strategy applied to \\emph{ab initio} band structures around the $\\Gamma$ point that ensures a quantitatively accurate description of the low-energy bulk and surface states, while avoiding the appearance of unphysical low-energy states at higher momenta, something that is not guaranteed by the commonly considered perturbative approach.","We analyze the effects that arise in the low-energy spectrum of topological surface states due to band anisotropy and electron-hole asymmetry, yielding Dirac surface states that naturally localize on different side facets.","In the thin-film limit, when surface states hybridize through the bulk, we resort to a thin-film model and derive thickness-dependent model parameters from \\emph{ab initio} calculations that show good agreement with experimentally resolved band structures, unlike the bulk model that neglects relevant many-body effects in this regime.","Our versatile modeling approach offers a reliable starting point for accurate simulations of realistic topological material-based nanoelectronic devices."],"url":"http://arxiv.org/abs/2404.13959v1","category":"cond-mat.mes-hall"}
{"created":"2024-04-22 07:24:49","title":"Extraction of YSO Cores and Active Regions near Star-forming Site AFGL 5157","abstract":"We have carried out a quantitative analysis of the $1^{\\circ} \\times 1^{\\circ}$ region near star-forming site AFGL 5157 using 'Minimal Spanning Tree' (MST). The analysis reveals that this region consists of five major clusters. The cluster radii of the cores and active regions were found to be varying between 0.75-2.62 pc and 2.77-4.58 pc, respectively, for these regions, while the aspect ratio varies between 0.71 to 7.17. This hints towards the clumpy as well as elongated clusters in the region. We calculated structure parameter Q for each region which varies between 0.41-0.62 and 0.23-0.81 for the cores and ARs, respectively. This shows the existence of fractal distribution in all the cores and ARs except the core of the [HKS2019] E70 bubble.","sentences":["We have carried out a quantitative analysis of the $1^{\\circ} \\times 1^{\\circ}$ region near star-forming site AFGL 5157 using 'Minimal Spanning Tree' (MST).","The analysis reveals that this region consists of five major clusters.","The cluster radii of the cores and active regions were found to be varying between 0.75-2.62 pc and 2.77-4.58 pc, respectively, for these regions, while the aspect ratio varies between 0.71 to 7.17.","This hints towards the clumpy as well as elongated clusters in the region.","We calculated structure parameter Q for each region which varies between 0.41-0.62 and 0.23-0.81 for the cores and ARs, respectively.","This shows the existence of fractal distribution in all the cores and ARs except the core of the [HKS2019] E70 bubble."],"url":"http://arxiv.org/abs/2404.13935v1","category":"astro-ph.GA"}
{"created":"2024-04-22 06:57:25","title":"Decay of Kaluza-Klein Vacuum via Singular Instanton","abstract":"In the decay process of metastable vacua in quantum field theories, the bounce solution, a classical solution in Euclideanized theories, is helpful in calculating the decay rate. Recently, the bounce solution with a conical singularity has attracted wide attention and revealed physical importance. In this paper, we discuss the bubble of nothing solution, which describes the decay process of a five-dimensional Kaluza-Klein vacuum, and study the consequence of including conical singularity. We found that the bounce solution with singularities has a higher decay rate than those without. This effect suggests that a singular solution can play a dominant role in vacuum decay of theories with compact internal space. We also discuss the enhanced decay rate from a thermodynamic perspective.","sentences":["In the decay process of metastable vacua in quantum field theories, the bounce solution, a classical solution in Euclideanized theories, is helpful in calculating the decay rate.","Recently, the bounce solution with a conical singularity has attracted wide attention and revealed physical importance.","In this paper, we discuss the bubble of nothing solution, which describes the decay process of a five-dimensional Kaluza-Klein vacuum, and study the consequence of including conical singularity.","We found that the bounce solution with singularities has a higher decay rate than those without.","This effect suggests that a singular solution can play a dominant role in vacuum decay of theories with compact internal space.","We also discuss the enhanced decay rate from a thermodynamic perspective."],"url":"http://arxiv.org/abs/2404.13917v1","category":"hep-th"}
{"created":"2024-04-22 06:43:18","title":"Global OpenBuildingMap -- Unveiling the Mystery of Global Buildings","abstract":"Understanding how buildings are distributed globally is crucial to revealing the human footprint on our home planet. This built environment affects local climate, land surface albedo, resource distribution, and many other key factors that influence well-being and human health. Despite this, quantitative and comprehensive data on the distribution and properties of buildings worldwide is lacking. To this end, by using a big data analytics approach and nearly 800,000 satellite images, we generated the highest resolution and highest accuracy building map ever created: the Global OpenBuildingMap (Global OBM). A joint analysis of building maps and solar potentials indicates that rooftop solar energy can supply the global energy consumption need at a reasonable cost. Specifically, if solar panels were placed on the roofs of all buildings, they could supply 1.1-3.3 times -- depending on the efficiency of the solar device -- the global energy consumption in 2020, which is the year with the highest consumption on record. We also identified a clear geospatial correlation between building areas and key socioeconomic variables, which indicates our global building map can serve as an important input to modeling global socioeconomic needs and drivers.","sentences":["Understanding how buildings are distributed globally is crucial to revealing the human footprint on our home planet.","This built environment affects local climate, land surface albedo, resource distribution, and many other key factors that influence well-being and human health.","Despite this, quantitative and comprehensive data on the distribution and properties of buildings worldwide is lacking.","To this end, by using a big data analytics approach and nearly 800,000 satellite images, we generated the highest resolution and highest accuracy building map ever created: the Global OpenBuildingMap (Global OBM).","A joint analysis of building maps and solar potentials indicates that rooftop solar energy can supply the global energy consumption need at a reasonable cost.","Specifically, if solar panels were placed on the roofs of all buildings, they could supply 1.1-3.3 times -- depending on the efficiency of the solar device -- the global energy consumption in 2020, which is the year with the highest consumption on record.","We also identified a clear geospatial correlation between building areas and key socioeconomic variables, which indicates our global building map can serve as an important input to modeling global socioeconomic needs and drivers."],"url":"http://arxiv.org/abs/2404.13911v1","category":"cs.CV"}
{"created":"2024-04-22 04:11:45","title":"A short review on the pulsar magnetic inclination angles","abstract":"The inclination angle $\\chi$ between magnetic and rotation axes of pulsars is an important parameter in pulsar physics. The changes in the inclination angle of a pulsar would lead to observable effects, such as changes in the pulse beam width and braking index of the star. In this paper, we perform a short review on the evolution of pulsar's magnetic inclination angle, as well as the latest research progress. Using an alignment rotator model in vacuum, we investigate the magnetic inclination angle change rates for 12 high-braking index pulsars without glitch, whose timing observations are obtained using the Nanshan 25-m Radio Telescope at Xinjiang Astronomical Observatory. For our purpose, three representative pulsars J0157+6212, J1743-3150 and J1857+0526 are chosen and their rotation and inclination angle evolutions are further investigated. In the future, radio and X-ray polarimetric observations will provide more information about the inclination angles of pulsars, which could help us understand the origin of the variations in $\\chi$ of pulsars and shed light on the range of possibilities of pulsar magnetic field configuration. A continuous study of the pulsar inclination angle will provide an important window into additional physical processes at work in the young and highly magnetized pulsars.","sentences":["The inclination angle $\\chi$ between magnetic and rotation axes of pulsars is an important parameter in pulsar physics.","The changes in the inclination angle of a pulsar would lead to observable effects, such as changes in the pulse beam width and braking index of the star.","In this paper, we perform a short review on the evolution of pulsar's magnetic inclination angle, as well as the latest research progress.","Using an alignment rotator model in vacuum, we investigate the magnetic inclination angle change rates for 12 high-braking index pulsars without glitch, whose timing observations are obtained using the Nanshan 25-m Radio Telescope at Xinjiang Astronomical Observatory.","For our purpose, three representative pulsars J0157+6212, J1743-3150 and J1857+0526 are chosen and their rotation and inclination angle evolutions are further investigated.","In the future, radio and X-ray polarimetric observations will provide more information about the inclination angles of pulsars, which could help us understand the origin of the variations in $\\chi$ of pulsars and shed light on the range of possibilities of pulsar magnetic field configuration.","A continuous study of the pulsar inclination angle will provide an important window into additional physical processes at work in the young and highly magnetized pulsars."],"url":"http://arxiv.org/abs/2404.13857v1","category":"astro-ph.HE"}
{"created":"2024-04-22 03:25:03","title":"Theta oscillons in behaving rats","abstract":"Recently discovered constituents of the brain waves -- the oscillons -- provide high-resolution representation of the extracellular field dynamics. Here we study the most robust, highest-amplitude oscillons that manifest in actively behaving rats and generally correspond to the traditional theta-waves. We show that the resemblances between theta-oscillons and the conventional theta-waves apply to the ballpark characteristics -- mean frequencies, amplitudes, and bandwidths. In addition, both hippocampal and cortical oscillons exhibit a number of intricate, behavior-attuned, transient properties that suggest a new vantage point for understanding the theta-rhythms' structure, origins and functions. We demonstrate that oscillons are frequency-modulated waves, with speed-controlled parameters, embedded into a noise background. We also use a basic model of neuronal synchronization to contextualize and to interpret the observed phenomena. In particular, we argue that the synchronicity level in physiological networks is fairly weak and modulated by the animal's locomotion.","sentences":["Recently discovered constituents of the brain waves -- the oscillons -- provide high-resolution representation of the extracellular field dynamics.","Here we study the most robust, highest-amplitude oscillons that manifest in actively behaving rats and generally correspond to the traditional theta-waves.","We show that the resemblances between theta-oscillons and the conventional theta-waves apply to the ballpark characteristics -- mean frequencies, amplitudes, and bandwidths.","In addition, both hippocampal and cortical oscillons exhibit a number of intricate, behavior-attuned, transient properties that suggest a new vantage point for understanding the theta-rhythms' structure, origins and functions.","We demonstrate that oscillons are frequency-modulated waves, with speed-controlled parameters, embedded into a noise background.","We also use a basic model of neuronal synchronization to contextualize and to interpret the observed phenomena.","In particular, we argue that the synchronicity level in physiological networks is fairly weak and modulated by the animal's locomotion."],"url":"http://arxiv.org/abs/2404.13851v1","category":"q-bio.NC"}
{"created":"2024-04-22 02:34:32","title":"The effect of local photoionization on the galaxy properties and the circumgalactic medium in simulations of Milky Way-sized galaxies","abstract":"In this study, we investigate the impact of local stellar radiation in cosmological zoom simulations of the formation of Milky Way-sized galaxies. We include the radiation field as an additional feedback component that is computed alongside gravity with a tree code in an optically thin approximation. We resimulate the initial conditions of five Milk Way-like systems taken from the Auriga project with and without stellar radiation, and study the effects of local stellar radiation on several properties of the galaxies and the circumgalactic medium (CGM). Similar to previous findings, we observe that local stellar radiation can modify gas cooling in the circumgalactic medium and thus suppress star formation and the surface densities of young stars and HI gas, while having little impact on the total gas content. Even though the magnitude of the effect we find is smaller than reported in earlier work, the radiation field is thus clearly an important component in simulations of late time galaxies. In particular, it also suppresses the peak of the rotation curve and reduces the mass of the stellar bulge. In the CGM region, the young stellar radiation exceeds the external UVB and dominates the radiation field within the virial halo at all redshifts. Nevertheless, we find that the local stellar radiation has overall little impact on the radial density and temperature profile of the CGM gas. The metallicity profile is slightly reduced, however, as well as the HI and MgII column densities within $\\sim 0.3\\,R_{\\rm vir}$. In contrast, we find that the OVI column density is hardly impacted by the radiation field. Additional effects can be expected from the radiation of the central AGN during phases of quasar activity, which has not yet been included in the simulations of the present study.","sentences":["In this study, we investigate the impact of local stellar radiation in cosmological zoom simulations of the formation of Milky Way-sized galaxies.","We include the radiation field as an additional feedback component that is computed alongside gravity with a tree code in an optically thin approximation.","We resimulate the initial conditions of five Milk Way-like systems taken from the Auriga project with and without stellar radiation, and study the effects of local stellar radiation on several properties of the galaxies and the circumgalactic medium (CGM).","Similar to previous findings, we observe that local stellar radiation can modify gas cooling in the circumgalactic medium and thus suppress star formation and the surface densities of young stars and HI gas, while having little impact on the total gas content.","Even though the magnitude of the effect we find is smaller than reported in earlier work, the radiation field is thus clearly an important component in simulations of late time galaxies.","In particular, it also suppresses the peak of the rotation curve and reduces the mass of the stellar bulge.","In the CGM region, the young stellar radiation exceeds the external UVB and dominates the radiation field within the virial halo at all redshifts.","Nevertheless, we find that the local stellar radiation has overall little impact on the radial density and temperature profile of the CGM gas.","The metallicity profile is slightly reduced, however, as well as the HI and MgII column densities within $\\sim 0.3\\,R_{\\rm vir}$. In contrast, we find that the OVI column density is hardly impacted by the radiation field.","Additional effects can be expected from the radiation of the central AGN during phases of quasar activity, which has not yet been included in the simulations of the present study."],"url":"http://arxiv.org/abs/2404.13837v1","category":"astro-ph.GA"}
{"created":"2024-04-22 02:21:26","title":"Inference for multiple change-points in generalized integer-valued autoregressive model","abstract":"In this paper, we propose a computationally valid and theoretically justified methods, the likelihood ratio scan method (LRSM), for estimating multiple change-points in a piecewise stationary generalized conditional integer-valued autoregressive process. LRSM with the usual window parameter $h$ is more satisfied to be used in long-time series with few and even change-points vs. LRSM with the multiple window parameter $h_{mix}$ performs well in short-time series with large and dense change-points. The computational complexity of LRSM can be efficiently performed with order $O((\\log n)^3 n)$. Moreover, two bootstrap procedures, namely parametric and block bootstrap, are developed for constructing confidence intervals (CIs) for each of the change-points. Simulation experiments and real data analysis show that the LRSM and bootstrap procedures have excellent performance and are consistent with the theoretical analysis.","sentences":["In this paper, we propose a computationally valid and theoretically justified methods, the likelihood ratio scan method (LRSM), for estimating multiple change-points in a piecewise stationary generalized conditional integer-valued autoregressive process.","LRSM with the usual window parameter $h$ is more satisfied to be used in long-time series with few and even change-points vs. LRSM with the multiple window parameter $h_{mix}$ performs well in short-time series with large and dense change-points.","The computational complexity of LRSM can be efficiently performed with order $O((\\log n)^3 n)$.","Moreover, two bootstrap procedures, namely parametric and block bootstrap, are developed for constructing confidence intervals (CIs) for each of the change-points.","Simulation experiments and real data analysis show that the LRSM and bootstrap procedures have excellent performance and are consistent with the theoretical analysis."],"url":"http://arxiv.org/abs/2404.13834v1","category":"stat.ME"}
{"created":"2024-04-22 01:58:19","title":"Change-point analysis for binomial autoregressive model with application to price stability counts","abstract":"The first-order binomial autoregressive (BAR(1)) model is the most frequently used tool to analyze the bounded count time series. The BAR(1) model is stationary and assumes process parameters to remain constant throughout the time period, which may be incompatible with the non-stationary real data, which indicates piecewise stationary characteristic. To better analyze the non-stationary bounded count time series, this article introduces the BAR(1) process with multiple change-points, which contains the BAR(1) model as a special case. Our primary goals are not only to detect the change-points, but also to give a solution to estimate the number and locations of the change-points. For this, the cumulative sum (CUSUM) test and minimum description length (MDL) principle are employed to deal with the testing and estimation problems. The proposed approaches are also applied to analysis of the Harmonised Index of Consumer Prices of the European Union.","sentences":["The first-order binomial autoregressive (BAR(1)) model is the most frequently used tool to analyze the bounded count time series.","The BAR(1) model is stationary and assumes process parameters to remain constant throughout the time period, which may be incompatible with the non-stationary real data, which indicates piecewise stationary characteristic.","To better analyze the non-stationary bounded count time series, this article introduces the BAR(1) process with multiple change-points, which contains the BAR(1) model as a special case.","Our primary goals are not only to detect the change-points, but also to give a solution to estimate the number and locations of the change-points.","For this, the cumulative sum (CUSUM) test and minimum description length (MDL) principle are employed to deal with the testing and estimation problems.","The proposed approaches are also applied to analysis of the Harmonised Index of Consumer Prices of the European Union."],"url":"http://arxiv.org/abs/2404.13825v1","category":"stat.ME"}
{"created":"2024-04-21 21:11:56","title":"Hopf algebras, Steinberg modules, and the unstable cohomology of $SL_n(\\mathbb Z)$ and $GL_n(\\mathbb Z)$","abstract":"We prove that the direct sum of all homology groups of the integral general linear groups with Steinberg module coefficients form a commutative Hopf algebra, in particular a free graded commutative algebra. We use this to construct new infinite families of unstable cohomology classes of $SL_n(\\mathbb Z)$.","sentences":["We prove that the direct sum of all homology groups of the integral general linear groups with Steinberg module coefficients form a commutative Hopf algebra, in particular a free graded commutative algebra.","We use this to construct new infinite families of unstable cohomology classes of $SL_n(\\mathbb Z)$."],"url":"http://arxiv.org/abs/2404.13776v1","category":"math.AT"}
{"created":"2024-04-21 20:58:14","title":"A route to quantum computing through the theory of quantum graphs","abstract":"Based on our previous works, and in order to relate them with the theory of quantum graphs and the quantum computing principles, we once again try to introduce some newly developed technical structures just by relying on our toy example, i.e. the coordinate ring of $n\\times n$ quantum matrix algebra $M_q(n)$, and the associated directed locally finite graphs $\\mathcal{G}(\\Pi_n)$, and the Cuntz-Krieger $C^*$-graph algebras. Meaningly, we introduce a $(4i-6)$-quantum entangled system by using the Cuntz-Krieger $\\mathcal{G}(\\Pi_i)$-families associated to the $4i-6$ distinct Hamiltonian paths of $\\mathcal{G}(\\Pi_i)$, for $i\\in\\{2,\\cdots,n\\}$.","sentences":["Based on our previous works, and in order to relate them with the theory of quantum graphs and the quantum computing principles, we once again try to introduce some newly developed technical structures just by relying on our toy example, i.e. the coordinate ring of $n\\times n$ quantum matrix algebra $M_q(n)$, and the associated directed locally finite graphs $\\mathcal{G}(\\Pi_n)$, and the Cuntz-Krieger $C^*$-graph algebras.","Meaningly, we introduce a $(4i-6)$-quantum entangled system by using the Cuntz-Krieger $\\mathcal{G}(\\Pi_i)$-families associated to the $4i-6$ distinct Hamiltonian paths of $\\mathcal{G}(\\Pi_i)$, for $i\\in\\{2,\\cdots,n\\}$."],"url":"http://arxiv.org/abs/2404.13773v1","category":"math.OA"}
