{"created":"2024-03-29 17:59:58","title":"Self Gravitating Spinning String Condensates","abstract":"In the context of the black hole/string transition, it is useful to produce Euclidean string backgrounds representing hot and self-gravitating strings. We utilise analytical and numerical methods to find a smooth, stationary rotating solution in the heterotic string theory at high temperatures. The solution describes a spinning winding-momentum condensate living in three non-compact dimensions, and its backreaction on the thermal cycle. At low temperatures, we expect a transition between our solution to an analytical continuation of an axionic Kerr black hole.","sentences":["In the context of the black hole/string transition, it is useful to produce Euclidean string backgrounds representing hot and self-gravitating strings.","We utilise analytical and numerical methods to find a smooth, stationary rotating solution in the heterotic string theory at high temperatures.","The solution describes a spinning winding-momentum condensate living in three non-compact dimensions, and its backreaction on the thermal cycle.","At low temperatures, we expect a transition between our solution to an analytical continuation of an axionic Kerr black hole."],"url":"http://arxiv.org/abs/2403.20332v1","category":"hep-th"}
{"created":"2024-03-29 17:59:34","title":"Are We on the Right Way for Evaluating Large Vision-Language Models?","abstract":"Large vision-language models (LVLMs) have recently achieved rapid progress, sparking numerous studies to evaluate their multi-modal capabilities. However, we dig into current evaluation works and identify two primary issues: 1) Visual content is unnecessary for many samples. The answers can be directly inferred from the questions and options, or the world knowledge embedded in LLMs. This phenomenon is prevalent across current benchmarks. For instance, GeminiPro achieves 42.9% on the MMMU benchmark without any visual input, and outperforms the random choice baseline across six benchmarks over 20% on average. 2) Unintentional data leakage exists in LLM and LVLM training. LLM and LVLM could still answer some visual-necessary questions without visual content, indicating the memorizing of these samples within large-scale training data. For example, Sphinx-X-MoE gets 43.6% on MMMU without accessing images, surpassing its LLM backbone with 17.9%. Both problems lead to misjudgments of actual multi-modal gains and potentially misguide the study of LVLM. To this end, we present MMStar, an elite vision-indispensable multi-modal benchmark comprising 1,500 samples meticulously selected by humans. MMStar benchmarks 6 core capabilities and 18 detailed axes, aiming to evaluate LVLMs' multi-modal capacities with carefully balanced and purified samples. These samples are first roughly selected from current benchmarks with an automated pipeline, human review is then involved to ensure each curated sample exhibits visual dependency, minimal data leakage, and requires advanced multi-modal capabilities. Moreover, two metrics are developed to measure data leakage and actual performance gain in multi-modal training. We evaluate 16 leading LVLMs on MMStar to assess their multi-modal capabilities, and on 7 benchmarks with the proposed metrics to investigate their data leakage and actual multi-modal gain.","sentences":["Large vision-language models (LVLMs) have recently achieved rapid progress, sparking numerous studies to evaluate their multi-modal capabilities.","However, we dig into current evaluation works and identify two primary issues: 1) Visual content is unnecessary for many samples.","The answers can be directly inferred from the questions and options, or the world knowledge embedded in LLMs.","This phenomenon is prevalent across current benchmarks.","For instance, GeminiPro achieves 42.9% on the MMMU benchmark without any visual input, and outperforms the random choice baseline across six benchmarks over 20% on average.","2) Unintentional data leakage exists in LLM and LVLM training.","LLM and LVLM could still answer some visual-necessary questions without visual content, indicating the memorizing of these samples within large-scale training data.","For example, Sphinx-X-MoE gets 43.6% on MMMU without accessing images, surpassing its LLM backbone with 17.9%.","Both problems lead to misjudgments of actual multi-modal gains and potentially misguide the study of LVLM.","To this end, we present MMStar, an elite vision-indispensable multi-modal benchmark comprising 1,500 samples meticulously selected by humans.","MMStar benchmarks 6 core capabilities and 18 detailed axes, aiming to evaluate LVLMs' multi-modal capacities with carefully balanced and purified samples.","These samples are first roughly selected from current benchmarks with an automated pipeline, human review is then involved to ensure each curated sample exhibits visual dependency, minimal data leakage, and requires advanced multi-modal capabilities.","Moreover, two metrics are developed to measure data leakage and actual performance gain in multi-modal training.","We evaluate 16 leading LVLMs on MMStar to assess their multi-modal capabilities, and on 7 benchmarks with the proposed metrics to investigate their data leakage and actual multi-modal gain."],"url":"http://arxiv.org/abs/2403.20330v1","category":"cs.CV"}
{"created":"2024-03-29 17:50:40","title":"Exploring the baryonic effect signature in the Hyper Suprime-Cam Year 3 cosmic shear two-point correlations on small scales: the $S_8$ tension remains present","abstract":"The baryonic feedback effect is considered as a possible solution to the so-called $S_8$ tension indicated in cosmic shear cosmology. The baryonic effect is more significant on smaller scales, and affects the cosmic shear two-point correlation functions (2PCFs) with different scale- and redshift-dependencies from those of the cosmological parameters. In this paper, we use the Hyper Suprime-Cam Year 3 (HSC-Y3) data to measure the cosmic shear 2PCFs ($\\xi_{\\pm}$) down to 0.28 arcminutes, taking full advantage of the high number density of source galaxies in the deep HSC data, to explore a possible signature of the baryonic effect. While the published HSC analysis used the cosmic shear 2PCFs on angular scales, which are sensitive to the matter power spectrum at $k\\lesssim 1~h{\\rm Mpc}^{-1}$, the smaller scale HSC cosmic shear signal allows us to probe the signature of matter power spectrum up to $k\\simeq 20~h{\\rm Mpc}^{-1}$. Using the accurate emulator of the nonlinear matter power spectrum, DarkEmulator2, we show that the dark matter-only model can provide an acceptable fit to the HSC-Y3 2PCFs down to the smallest scales. In other words, we do not find any clear signature of the baryonic effects or do not find a systematic shift in the $S_8$ value with the inclusion of the smaller-scale information as would be expected if the baryonic effect is significant. Alternatively, we use a flexible 6-parameter model of the baryonic effects, which can lead to both enhancement and suppression in the matter power spectrum compared to the dark matter-only model, to perform the parameter inference of the HSC-Y3 2PCFs. We find that the small-scale HSC data allow only a fractional suppression of up to 5 percent in the matter power spectrum at $k\\sim 1~h{\\rm Mpc}^{-1}$, which is not sufficient to reconcile the $S_8$ tension.","sentences":["The baryonic feedback effect is considered as a possible solution to the so-called $S_8$ tension indicated in cosmic shear cosmology.","The baryonic effect is more significant on smaller scales, and affects the cosmic shear two-point correlation functions (2PCFs) with different scale- and redshift-dependencies from those of the cosmological parameters.","In this paper, we use the Hyper Suprime-Cam Year 3 (HSC-Y3) data to measure the cosmic shear 2PCFs ($\\xi_{\\pm}$) down to 0.28 arcminutes, taking full advantage of the high number density of source galaxies in the deep HSC data, to explore a possible signature of the baryonic effect.","While the published HSC analysis used the cosmic shear 2PCFs on angular scales, which are sensitive to the matter power spectrum at $k\\lesssim 1~h{\\rm Mpc}^{-1}$, the smaller scale HSC cosmic shear signal allows us to probe the signature of matter power spectrum up to $k\\simeq 20~h{\\rm Mpc}^{-1}$. Using the accurate emulator of the nonlinear matter power spectrum, DarkEmulator2, we show that the dark matter-only model can provide an acceptable fit to the HSC-Y3 2PCFs down to the smallest scales.","In other words, we do not find any clear signature of the baryonic effects or do not find a systematic shift in the $S_8$ value with the inclusion of the smaller-scale information as would be expected if the baryonic effect is significant.","Alternatively, we use a flexible 6-parameter model of the baryonic effects, which can lead to both enhancement and suppression in the matter power spectrum compared to the dark matter-only model, to perform the parameter inference of the HSC-Y3 2PCFs.","We find that the small-scale HSC data allow only a fractional suppression of up to 5 percent in the matter power spectrum at $k\\sim 1~h{\\rm Mpc}^{-1}$, which is not sufficient to reconcile the $S_8$ tension."],"url":"http://arxiv.org/abs/2403.20323v1","category":"astro-ph.CO"}
{"created":"2024-03-29 17:19:25","title":"Exploring Constraints on Simplified Dark Matter Model Through Flavour and Electroweak Observables","abstract":"This study focuses on a combined analysis of various available inputs to constrain the parameter spaces of a simplified dark matter (SDM) model featuring a spin-0 mediator and fermionic dark matter (DM). The spin-0 mediator interacts with standard model (SM) fermions, SM gauge bosons, and DM. We constrain the parameter spaces of different relevant couplings, DM mass, and the mediator mass, using the data from flavour-changing charged and neutral current processes, CKM matrices, $W$ and $Z$-pole observables, DM relic density, direct and indirect detection bounds. We have calculated bounds on the couplings from both separate and simultaneous analyses of the mentioned processes. We identify correlated parameter spaces for all the relevant parameters which include the couplings and the masses. For the DM and mediator masses, we have scanned the region between 100 GeV and 1000 GeV. Using our results, we have obtained bounds on the couplings of possible higher dimensional operators from which we can formulate our SDM.","sentences":["This study focuses on a combined analysis of various available inputs to constrain the parameter spaces of a simplified dark matter (SDM) model featuring a spin-0 mediator and fermionic dark matter (DM).","The spin-0 mediator interacts with standard model (SM) fermions, SM gauge bosons, and DM.","We constrain the parameter spaces of different relevant couplings, DM mass, and the mediator mass, using the data from flavour-changing charged and neutral current processes, CKM matrices, $W$ and $Z$-pole observables, DM relic density, direct and indirect detection bounds.","We have calculated bounds on the couplings from both separate and simultaneous analyses of the mentioned processes.","We identify correlated parameter spaces for all the relevant parameters which include the couplings and the masses.","For the DM and mediator masses, we have scanned the region between 100 GeV and 1000 GeV.","Using our results, we have obtained bounds on the couplings of possible higher dimensional operators from which we can formulate our SDM."],"url":"http://arxiv.org/abs/2403.20303v1","category":"hep-ph"}
{"created":"2024-03-29 17:19:13","title":"I'm in AGNi: A new standard for AGN pluralisation","abstract":"We present a new standard acronym for Active Galactic Nuclei, finally settling the argument of AGN vs. AGNs. Our new standard is not only etymologically superior (following the consensus set by SNe), but also boasts other linguistic opportunities, connecting strongly with relevant theology and streamlining descriptions of AGN properties.","sentences":["We present a new standard acronym for Active Galactic Nuclei, finally settling the argument of AGN vs. AGNs.","Our new standard is not only etymologically superior (following the consensus set by SNe), but also boasts other linguistic opportunities, connecting strongly with relevant theology and streamlining descriptions of AGN properties."],"url":"http://arxiv.org/abs/2403.20302v1","category":"astro-ph.GA"}
{"created":"2024-03-29 16:54:29","title":"A reanalysis of the LHS 1140 b atmosphere observed with the Hubble Space Telescope","abstract":"The super-Earth LHS 1140 b is an interesting target for atmospheric observations since it is close to the habitable zone of its star and falls in the gap of the radius distribution of small exoplanets, in the region thought to correspond to the transition between planets with and without atmospheres. Observations of the primary transit with WFC3 on board of the Hubble Space Telescope (HST) revealed a modulation in the planet transmission spectrum compatible with the presence of water; however this modulation may be also due to stellar activity-related phenomena. Here we present a detailed analysis of the WFC3/HST observations to probe the nature of this modulation and to understand if it can be attributable to the presence of unocculted spots on the stellar surface. Our analysis strongly suggests that LHS1140 is a rather quiet star with subsolar [Fe/H] and enriched in alpha elements. Therefore, we rule out the possibility that the planetary spectrum is affected by the presence of spots and faculae. This analysis shows the importance of a proper modelling of the stellar spectrum when analyzing transit observations. Finally, we modelled the planetary atmosphere of LHS1140 b to retrieve its atmospheric composition. However, the low resolution and the narrow spectral range of HST observations prevented us from definitively determining whether the spectral features are attributable to the presence of water or of other molecules in the planetary atmosphere.","sentences":["The super-Earth LHS 1140 b is an interesting target for atmospheric observations since it is close to the habitable zone of its star and falls in the gap of the radius distribution of small exoplanets, in the region thought to correspond to the transition between planets with and without atmospheres.","Observations of the primary transit with WFC3 on board of the Hubble Space Telescope (HST) revealed a modulation in the planet transmission spectrum compatible with the presence of water; however this modulation may be also due to stellar activity-related phenomena.","Here we present a detailed analysis of the WFC3/HST observations to probe the nature of this modulation and to understand if it can be attributable to the presence of unocculted spots on the stellar surface.","Our analysis strongly suggests that LHS1140 is a rather quiet star with subsolar [Fe/H] and enriched in alpha elements.","Therefore, we rule out the possibility that the planetary spectrum is affected by the presence of spots and faculae.","This analysis shows the importance of a proper modelling of the stellar spectrum when analyzing transit observations.","Finally, we modelled the planetary atmosphere of LHS1140 b to retrieve its atmospheric composition.","However, the low resolution and the narrow spectral range of HST observations prevented us from definitively determining whether the spectral features are attributable to the presence of water or of other molecules in the planetary atmosphere."],"url":"http://arxiv.org/abs/2403.20285v1","category":"astro-ph.EP"}
{"created":"2024-03-29 16:51:25","title":"The Higgs Mass and a Perspective on Broken Autonomy of Scales","abstract":"The hierarchy problem of the Higgs mass, the violation of the autonomy of far-distant energy scales, is identified as a pseudo-problem. The pseudo-problem is based on the dogmatic adherence to the methodology of effective theories, for which there is no justification when dealing with presumably fundamental phenomena such as the Higgs mechanism. In view of further breaches of autonomy of scales in fundamental principles outside particle physics, the hierarchy problem is instead reinterpreted as an indication of the fundamental ontological status of the Higgs boson. Selective Realism justifies this attribution within the effective theories of the standard model of particle physics. Moreover, a model of changes in aesthetic canons provides an explanation for the existing dogmatism regarding effective theories.","sentences":["The hierarchy problem of the Higgs mass, the violation of the autonomy of far-distant energy scales, is identified as a pseudo-problem.","The pseudo-problem is based on the dogmatic adherence to the methodology of effective theories, for which there is no justification when dealing with presumably fundamental phenomena such as the Higgs mechanism.","In view of further breaches of autonomy of scales in fundamental principles outside particle physics, the hierarchy problem is instead reinterpreted as an indication of the fundamental ontological status of the Higgs boson.","Selective Realism justifies this attribution within the effective theories of the standard model of particle physics.","Moreover, a model of changes in aesthetic canons provides an explanation for the existing dogmatism regarding effective theories."],"url":"http://arxiv.org/abs/2403.20282v1","category":"physics.hist-ph"}
{"created":"2024-03-29 16:44:19","title":"Constraints on the Blazar-Boosted Dark Matter from the CDEX-10 Experiment","abstract":"We report new constraints on light dark matter (DM) boosted by blazars using the 205.4 kg day data from the CDEX-10 experiment located at the China Jinping Underground Laboratory. Two representative blazars, TXS 0506+56 and BL Lacertae are studied. The results derived from TXS 0506+56 exclude DM-nucleon elastic scattering cross sections from $4.6\\times 10^{-33}\\ \\rm cm^2$ to $1\\times10^{-26}\\ \\rm cm^2$ for DM masses between 10 keV and 1 GeV, and the results derived from BL Lacertae exclude DM-nucleon elastic scattering cross sections from $2.4\\times 10^{-34}\\ \\rm cm^2$ to $1\\times10^{-26}\\ \\rm cm^2$ for the same range of DM masses. The constraints correspond to the best sensitivities among solid-state detector experiments in the sub-MeV mass range.","sentences":["We report new constraints on light dark matter (DM) boosted by blazars using the 205.4 kg day data from the CDEX-10 experiment located at the China Jinping Underground Laboratory.","Two representative blazars, TXS 0506+56 and BL Lacertae are studied.","The results derived from TXS 0506+56 exclude DM-nucleon elastic scattering cross sections from $4.6\\times 10^{-33}\\ \\rm cm^2$ to $1\\times10^{-26}\\ \\rm cm^2$ for DM masses between 10 keV and 1 GeV, and the results derived from BL Lacertae exclude DM-nucleon elastic scattering cross sections from $2.4\\times 10^{-34}\\ \\rm cm^2$ to $1\\times10^{-26}\\ \\rm cm^2$ for the same range of DM masses.","The constraints correspond to the best sensitivities among solid-state detector experiments in the sub-MeV mass range."],"url":"http://arxiv.org/abs/2403.20276v1","category":"hep-ex"}
{"created":"2024-03-29 16:25:58","title":"Mekler's Construction and Murphy's Law for 2-Nilpotent Groups","abstract":"Mekler's construction is a powerful technique for building purely algebraic structures from combinatorial ones. Its power lies in the fact that it allows various model-theoretic tameness properties of the combinatorial structure to transfer to the algebraic one. In this paper, we push this ideology much further, describing a broad class of properties that transfer through Mekler's construction. This technique subsumes many well-known results and opens avenues for many more.   As a straightforward application of our methods, we (1) obtain transfer principles for stably embedded pairs of Mekler groups and (2) construct the first examples of strictly $\\mathsf{NFOP}_k$ pure groups for all $k\\in\\mathbb{N}_{>2}$. We also answer a question of Chernikov and Hempel on the transfer of burden.","sentences":["Mekler's construction is a powerful technique for building purely algebraic structures from combinatorial ones.","Its power lies in the fact that it allows various model-theoretic tameness properties of the combinatorial structure to transfer to the algebraic one.","In this paper, we push this ideology much further, describing a broad class of properties that transfer through Mekler's construction.","This technique subsumes many well-known results and opens avenues for many more.   ","As a straightforward application of our methods, we (1) obtain transfer principles for stably embedded pairs of Mekler groups and (2) construct the first examples of strictly $\\mathsf{NFOP}_k$ pure groups for all $k\\in\\mathbb{N}_{>2}$. We also answer a question of Chernikov and Hempel on the transfer of burden."],"url":"http://arxiv.org/abs/2403.20270v1","category":"math.LO"}
