{"created":"2024-04-29 13:19:31","title":"Sequential model confidence sets","abstract":"In most prediction and estimation situations, scientists consider various statistical models for the same problem, and naturally want to select amongst the best. Hansen et al. (2011) provide a powerful solution to this problem by the so-called model confidence set, a subset of the original set of available models that contains the best models with a given level of confidence. Importantly, model confidence sets respect the underlying selection uncertainty by being flexible in size. However, they presuppose a fixed sample size which stands in contrast to the fact that model selection and forecast evaluation are inherently sequential tasks where we successively collect new data and where the decision to continue or conclude a study may depend on the previous outcomes. In this article, we extend model confidence sets sequentially over time by relying on sequential testing methods. Recently, e-processes and confidence sequences have been introduced as new, safe methods for assessing statistical evidence. Sequential model confidence sets allow to continuously monitor the models' performances and come with time-uniform, nonasymptotic coverage guarantees.","sentences":["In most prediction and estimation situations, scientists consider various statistical models for the same problem, and naturally want to select amongst the best.","Hansen et al. (2011) provide a powerful solution to this problem by the so-called model confidence set, a subset of the original set of available models that contains the best models with a given level of confidence.","Importantly, model confidence sets respect the underlying selection uncertainty by being flexible in size.","However, they presuppose a fixed sample size which stands in contrast to the fact that model selection and forecast evaluation are inherently sequential tasks where we successively collect new data and where the decision to continue or conclude a study may depend on the previous outcomes.","In this article, we extend model confidence sets sequentially over time by relying on sequential testing methods.","Recently, e-processes and confidence sequences have been introduced as new, safe methods for assessing statistical evidence.","Sequential model confidence sets allow to continuously monitor the models' performances and come with time-uniform, nonasymptotic coverage guarantees."],"url":"http://arxiv.org/abs/2404.18678v1","category":"stat.ME"}
