{"created":"2024-04-02 12:08:26","title":"Real, fake and synthetic faces -- does the coin have three sides?","abstract":"With the ever-growing power of generative artificial intelligence, deepfake and artificially generated (synthetic) media have continued to spread online, which creates various ethical and moral concerns regarding their usage. To tackle this, we thus present a novel exploration of the trends and patterns observed in real, deepfake and synthetic facial images. The proposed analysis is done in two parts: firstly, we incorporate eight deep learning models and analyze their performances in distinguishing between the three classes of images. Next, we look to further delve into the similarities and differences between these three sets of images by investigating their image properties both in the context of the entire image as well as in the context of specific regions within the image. ANOVA test was also performed and provided further clarity amongst the patterns associated between the images of the three classes. From our findings, we observe that the investigated deeplearning models found it easier to detect synthetic facial images, with the ViT Patch-16 model performing best on this task with a class-averaged sensitivity, specificity, precision, and accuracy of 97.37%, 98.69%, 97.48%, and 98.25%, respectively. This observation was supported by further analysis of various image properties. We saw noticeable differences across the three category of images. This analysis can help us build better algorithms for facial image generation, and also shows that synthetic, deepfake and real face images are indeed three different classes.","sentences":["With the ever-growing power of generative artificial intelligence, deepfake and artificially generated (synthetic) media have continued to spread online, which creates various ethical and moral concerns regarding their usage.","To tackle this, we thus present a novel exploration of the trends and patterns observed in real, deepfake and synthetic facial images.","The proposed analysis is done in two parts: firstly, we incorporate eight deep learning models and analyze their performances in distinguishing between the three classes of images.","Next, we look to further delve into the similarities and differences between these three sets of images by investigating their image properties both in the context of the entire image as well as in the context of specific regions within the image.","ANOVA test was also performed and provided further clarity amongst the patterns associated between the images of the three classes.","From our findings, we observe that the investigated deeplearning models found it easier to detect synthetic facial images, with the ViT Patch-16 model performing best on this task with a class-averaged sensitivity, specificity, precision, and accuracy of 97.37%, 98.69%, 97.48%, and 98.25%, respectively.","This observation was supported by further analysis of various image properties.","We saw noticeable differences across the three category of images.","This analysis can help us build better algorithms for facial image generation, and also shows that synthetic, deepfake and real face images are indeed three different classes."],"url":"http://arxiv.org/abs/2404.01878v1","category":"cs.CV"}
{"created":"2024-04-01 19:22:43","title":"Generation and Detection of Sign Language Deepfakes -- A Linguistic and Visual Analysis","abstract":"A question in the realm of deepfakes is slowly emerging pertaining to whether we can go beyond facial deepfakes and whether it would be beneficial to society. Therefore, this research presents a positive application of deepfake technology in upper body generation, while performing sign-language for the Deaf and Hard of Hearing (DHoH) community. The resulting videos are later vetted with a sign language expert. This is particularly helpful, given the intricate nature of sign language, a scarcity of sign language experts, and potential benefits for health and education. The objectives of this work encompass constructing a reliable deepfake dataset, evaluating its technical and visual credibility through computer vision and natural language processing models, and assessing the plausibility of the generated content. With over 1200 videos, featuring both previously seen and unseen individuals for the generation model, using the help of a sign language expert, we establish a deepfake dataset in sign language that can further be utilized to detect fake videos that may target certain people of determination.","sentences":["A question in the realm of deepfakes is slowly emerging pertaining to whether we can go beyond facial deepfakes and whether it would be beneficial to society.","Therefore, this research presents a positive application of deepfake technology in upper body generation, while performing sign-language for the Deaf and Hard of Hearing (DHoH) community.","The resulting videos are later vetted with a sign language expert.","This is particularly helpful, given the intricate nature of sign language, a scarcity of sign language experts, and potential benefits for health and education.","The objectives of this work encompass constructing a reliable deepfake dataset, evaluating its technical and visual credibility through computer vision and natural language processing models, and assessing the plausibility of the generated content.","With over 1200 videos, featuring both previously seen and unseen individuals for the generation model, using the help of a sign language expert, we establish a deepfake dataset in sign language that can further be utilized to detect fake videos that may target certain people of determination."],"url":"http://arxiv.org/abs/2404.01438v1","category":"cs.CV"}
{"created":"2024-04-02 09:40:37","title":"Diversity in hydrogen-rich envelope mass of type II supernovae (I): $V$-band light curve modeling","abstract":"We conduct a systematic study on the light curves of type II supernovae (SNe II) to investigate how they are affected by the physical properties of the progenitor and the nature of the explosion. The calculations of pre-supernova evolution, the launch of the explosion, and the light curve are carried out by \\texttt{MESA} and \\texttt{STELLA}. Our study encompasses a wide range of zero-age-main-sequence (ZAMS) masses (10 - 20 $M_{\\rm \\odot}$), wind mass-loss rates (which control the range of hydrogen-rich envelope mass to be 3 - 12 $M_{\\rm \\odot}$), explosion energies (0.1 - 2.5 $\\times$ 10$^{51}$ erg), and $^{56}$Ni masses (0 - 0.15 $M_{\\rm \\odot}$). Our analyses reveal that when the explosion energy is fixed, the light curve is primarily determined by the properties of the hydrogen-rich envelope, despite the large variation in the ZAMS masses. The dependencies of the light-curve characteristics on the envelope mass, radius, and explosion energy are investigated, and we establish the scaling relations connecting these quantities. We further derive a formula that corrects for effects of the $^{56}$Ni heating based on observables. Using the derived equations, we develop a method that can constrain the envelope mass with uncertainty within 1 $M_{\\rm \\odot}$ based on photometry. This method is applied to a large sample of $\\sim$ 100 SNe II, which reveals a considerably broader range of the envelope masses estimated from observables as compared to those predicted by single star models evolving with standard stellar wind; this finding indicates that a large fraction of SNe II experience substantial mass-loss beyond the standard mass-loss prescription prior to their explosions, highlighting the uncertainties involved in the massive star evolution and pre-SN mass-loss mechanism.","sentences":["We conduct a systematic study on the light curves of type II supernovae (SNe II) to investigate how they are affected by the physical properties of the progenitor and the nature of the explosion.","The calculations of pre-supernova evolution, the launch of the explosion, and the light curve are carried out by \\texttt{MESA} and \\texttt{STELLA}.","Our study encompasses a wide range of zero-age-main-sequence (ZAMS) masses (10 - 20 $M_{\\rm \\odot}$), wind mass-loss rates (which control the range of hydrogen-rich envelope mass to be 3 - 12 $M_{\\rm \\odot}$), explosion energies (0.1 - 2.5 $\\times$ 10$^{51}$ erg), and $^{56}$Ni masses (0 - 0.15 $M_{\\rm \\odot}$).","Our analyses reveal that when the explosion energy is fixed, the light curve is primarily determined by the properties of the hydrogen-rich envelope, despite the large variation in the ZAMS masses.","The dependencies of the light-curve characteristics on the envelope mass, radius, and explosion energy are investigated, and we establish the scaling relations connecting these quantities.","We further derive a formula that corrects for effects of the $^{56}$Ni heating based on observables.","Using the derived equations, we develop a method that can constrain the envelope mass with uncertainty within 1 $M_{\\rm \\odot}$ based on photometry.","This method is applied to a large sample of $\\sim$ 100 SNe II, which reveals a considerably broader range of the envelope masses estimated from observables as compared to those predicted by single star models evolving with standard stellar wind; this finding indicates that a large fraction of SNe II experience substantial mass-loss beyond the standard mass-loss prescription prior to their explosions, highlighting the uncertainties involved in the massive star evolution and pre-SN mass-loss mechanism."],"url":"http://arxiv.org/abs/2404.01776v1","category":"astro-ph.HE"}
{"created":"2024-04-02 09:38:18","title":"MHONGOOSE -- A MeerKAT Nearby Galaxy HI Survey","abstract":"The MHONGOOSE (MeerKAT HI Observations of Nearby Galactic Objects: Observing Southern Emitters) survey maps the distribution and kinematics of the neutral atomic hydrogen (HI) gas in and around 30 nearby star-forming spiral and dwarf galaxies to extremely low HI column densities. The HI column density sensitivity (3 sigma over 16 km/s) ranges from ~ 5 x 10^{17} cm^{-2} at 90'' resolution to ~4 x 10^{19} cm^{-2} at the highest resolution of 7''. The HI mass sensitivity (3 sigma over 50 km/s) is ~5.5 X 10^5 M_sun at a distance of 10 Mpc (the median distance of the sample galaxies). The velocity resolution of the data is 1.4 km/s. One of the main science goals of the survey is the detection of cold, accreting gas in the outskirts of the sample galaxies. The sample was selected to cover a range in HI masses, from 10^7 M_sun to almost 10^{11} M_sun, to optimally sample possible accretion scenarios and environments. The distance to the sample galaxies ranges from 3 to 23 Mpc. In this paper, we present the sample selection, survey design, and observation and reduction procedures. We compare the integrated HI fluxes based on the MeerKAT data with those derived from single-dish measurement and find good agreement, indicating that our MeerKAT observations are recovering all flux. We present HI moment maps of the entire sample based on the first ten percent of the survey data, and find that a comparison of the zeroth- and second-moment values shows a clear separation between the physical properties of the HI in areas with star formation and areas without, related to the formation of a cold neutral medium. Finally, we give an overview of the HI-detected companion and satellite galaxies in the 30 fields, five of which have not previously been catalogued. We find a clear relation between the number of companion galaxies and the mass of the main target galaxy.","sentences":["The MHONGOOSE (MeerKAT HI Observations of Nearby Galactic Objects: Observing Southern Emitters) survey maps the distribution and kinematics of the neutral atomic hydrogen (HI) gas in and around 30 nearby star-forming spiral and dwarf galaxies to extremely low HI column densities.","The HI column density sensitivity (3 sigma over 16 km/s) ranges from ~ 5 x 10^{17} cm^{-2} at 90'' resolution to ~4 x 10^{19} cm^{-2} at the highest resolution of 7''.","The HI mass sensitivity (3 sigma over 50 km/s) is ~5.5 X 10^5 M_sun at a distance of 10 Mpc (the median distance of the sample galaxies).","The velocity resolution of the data is 1.4 km/s. One of the main science goals of the survey is the detection of cold, accreting gas in the outskirts of the sample galaxies.","The sample was selected to cover a range in HI masses, from 10^7 M_sun to almost 10^{11} M_sun, to optimally sample possible accretion scenarios and environments.","The distance to the sample galaxies ranges from 3 to 23 Mpc.","In this paper, we present the sample selection, survey design, and observation and reduction procedures.","We compare the integrated HI fluxes based on the MeerKAT data with those derived from single-dish measurement and find good agreement, indicating that our MeerKAT observations are recovering all flux.","We present HI moment maps of the entire sample based on the first ten percent of the survey data, and find that a comparison of the zeroth- and second-moment values shows a clear separation between the physical properties of the HI in areas with star formation and areas without, related to the formation of a cold neutral medium.","Finally, we give an overview of the HI-detected companion and satellite galaxies in the 30 fields, five of which have not previously been catalogued.","We find a clear relation between the number of companion galaxies and the mass of the main target galaxy."],"url":"http://arxiv.org/abs/2404.01774v1","category":"astro-ph.GA"}
