{"created":"2024-05-13 17:58:24","title":"JWST's PEARLS: resolved study of the stellar and dust components in starburst galaxies at cosmic noon","abstract":"Dusty star-forming galaxies (DSFGs) contribute significantly to the stellar buildup at cosmic noon. Major mergers and gas accretion are often invoked to explain DSFGs' prodigious star-formation rates (SFRs) and large stellar masses. We conducted a spatially-resolved morphological analysis of the rest-frame UV/NIR emission in three DSFGs at z~2.5. Initially discovered as CO emitters by NOEMA observations of a bright Herschel source, we observed them with the JWST/NIRCam as part of the PEARLS program. The NIRCam data reveal the galaxies' stellar population and dust distribution on scales of 250 pc. Spatial variations in stellar mass, SFR, and dust extinction are determined in resolved maps obtained through pixel-based SED fitting. The CO emitters are massive, dusty starburst galaxies with SFRs ranging from 340 to 2500 Msun/yr, positioning them among the most active SFGs at 2<z<3. Notably, they belong to the ~1.5% of the entire JWST population with extremely red colors. Their morphologies are disk-like, with effective radii of 2.0-4.4 kpc, and exhibit sub-structures such as clumps and spiral arms. The galaxies have dust extinctions up to Av=5-7 mag with asymmetric distributions extending over several kpc and including off-center regions resembling bent spiral arms and clumps. The NIR dust-attenuation curve in these sources deviates from standard laws, implying different dust grain properties than commonly assumed in starburst galaxies. The proximity of galaxies with consistent redshifts, strong color gradients, overall disturbed appearance, asymmetric dust obscuration, and wide-spread star formation favor interactions (minor mergers and flybys) as the mechanism driving the CO galaxies' exceptional SFRs. Their large masses and rich environment hint at membership in two proto-structures, as initially inferred from their association with a Planck-selected high-z source.","sentences":["Dusty star-forming galaxies (DSFGs) contribute significantly to the stellar buildup at cosmic noon.","Major mergers and gas accretion are often invoked to explain DSFGs' prodigious star-formation rates (SFRs) and large stellar masses.","We conducted a spatially-resolved morphological analysis of the rest-frame UV/NIR emission in three DSFGs at z~2.5.","Initially discovered as CO emitters by NOEMA observations of a bright Herschel source, we observed them with the JWST/NIRCam as part of the PEARLS program.","The NIRCam data reveal the galaxies' stellar population and dust distribution on scales of 250 pc.","Spatial variations in stellar mass, SFR, and dust extinction are determined in resolved maps obtained through pixel-based SED fitting.","The CO emitters are massive, dusty starburst galaxies with SFRs ranging from 340 to 2500 Msun/yr, positioning them among the most active SFGs at 2<z<3.","Notably, they belong to the ~1.5% of the entire JWST population with extremely red colors.","Their morphologies are disk-like, with effective radii of 2.0-4.4 kpc, and exhibit sub-structures such as clumps and spiral arms.","The galaxies have dust extinctions up to Av=5-7 mag with asymmetric distributions extending over several kpc and including off-center regions resembling bent spiral arms and clumps.","The NIR dust-attenuation curve in these sources deviates from standard laws, implying different dust grain properties than commonly assumed in starburst galaxies.","The proximity of galaxies with consistent redshifts, strong color gradients, overall disturbed appearance, asymmetric dust obscuration, and wide-spread star formation favor interactions (minor mergers and flybys) as the mechanism driving the CO galaxies' exceptional SFRs.","Their large masses and rich environment hint at membership in two proto-structures, as initially inferred from their association with a Planck-selected high-z source."],"url":"http://arxiv.org/abs/2405.07986v1","category":"astro-ph.GA"}
{"created":"2024-05-13 17:45:42","title":"Early phase simultaneous multi-band observations of Type II supernova SN 2024ggi with Mephisto","abstract":"We present early-phase good cadence simultaneous multi-band ($ugi$, $vrz$--bands) imaging of nearby supernova SN 2024ggi, which exploded in the nearby galaxy, NGC~3621. A quick follow-up was conducted within less than a day after the explosion and continued $\\sim$23 days. The $uvg$-band light curves display a rapid rise ($\\sim$1.4 mag day$^{-1}$) to maximum in $\\sim$4 days and absolute magnitude $M_{g}\\sim$--17.75 mag. The post-peak decay rate in redder bands is $\\sim$0.01 mag day$^{-1}$. Different colors (e.g., $u-g$ and $v-r$) of SN~2024ggi are slightly redder than SN~2023ixf. A significant rise ($\\sim$12.5 kK) in black-body temperature (optical) was noticed within $\\sim$2 days after the explosion, which successively decreased, indicating shock break out inside a dense circumstellar medium (CSM) surrounding the progenitor. Using semi-analytical modeling, the ejecta mass and progenitor radius were estimated as 1.2 M$_{\\odot}$ and $\\sim$550 R$_{\\odot}$, respectively. The archival deep images ($g,r,i,z$-bands) from the Dark Energy Camera Legacy Survey (DECaLS) were examined, and a possible progenitor was detected in each band ($\\sim$22--22.5 mag) and had a mass range of 14--17 M$_{\\odot}$.","sentences":["We present early-phase good cadence simultaneous multi-band ($ugi$, $vrz$--bands) imaging of nearby supernova SN 2024ggi, which exploded in the nearby galaxy, NGC~3621.","A quick follow-up was conducted within less than a day after the explosion and continued $\\sim$23 days.","The $uvg$-band light curves display a rapid rise ($\\sim$1.4 mag day$^{-1}$) to maximum in $\\sim$4 days and absolute magnitude $M_{g}\\sim$--17.75 mag.","The post-peak decay rate in redder bands is $\\sim$0.01 mag day$^{-1}$. Different colors (e.g., $u-g$ and $v-r$) of SN~2024ggi are slightly redder than SN~2023ixf.","A significant rise ($\\sim$12.5 kK) in black-body temperature (optical) was noticed within $\\sim$2 days after the explosion, which successively decreased, indicating shock break out inside a dense circumstellar medium (CSM) surrounding the progenitor.","Using semi-analytical modeling, the ejecta mass and progenitor radius were estimated as 1.2 M$_{\\odot}$ and $\\sim$550 R$_{\\odot}$, respectively.","The archival deep images ($g,r,i,z$-bands) from the Dark Energy Camera Legacy Survey (DECaLS) were examined, and a possible progenitor was detected in each band ($\\sim$22--22.5 mag) and had a mass range of 14--17 M$_{\\odot}$."],"url":"http://arxiv.org/abs/2405.07964v1","category":"astro-ph.HE"}
{"created":"2024-05-13 17:40:29","title":"Cloaking for random walks using a discrete potential theory","abstract":"The diffusion of charged particles in a graph can be modeled using random walks on a weighted graph. We give strategies to hide (or cloak) changes in a subgraph from the perspective of measurements of expected net particle charges made at nodes away from the cloaked subgraph. We distinguish between passive and active strategies, depending on whether the strategy involves injecting particles. The passive strategy can hide topology and edge weight changes. In addition to these capabilities, the active strategy can also hide sources of particles, at the cost of prior knowledge of the expected net particle charges in the reference graph. The strategies we present rely on discrete analogues of classic potential theory, that include a Calder\\'on calculus on graphs.","sentences":["The diffusion of charged particles in a graph can be modeled using random walks on a weighted graph.","We give strategies to hide (or cloak) changes in a subgraph from the perspective of measurements of expected net particle charges made at nodes away from the cloaked subgraph.","We distinguish between passive and active strategies, depending on whether the strategy involves injecting particles.","The passive strategy can hide topology and edge weight changes.","In addition to these capabilities, the active strategy can also hide sources of particles, at the cost of prior knowledge of the expected net particle charges in the reference graph.","The strategies we present rely on discrete analogues of classic potential theory, that include a Calder\\'on calculus on graphs."],"url":"http://arxiv.org/abs/2405.07961v1","category":"math.PR"}
{"created":"2024-05-13 17:32:49","title":"Quasi-one- and quasi-two-dimensional symbiotic solitons bound by dipolar interaction","abstract":"We study the formation of quasi-one- (quasi-1D) and quasi-two-dimensional (quasi-2D) symbiotic solitons bound by an interspecies dipolar interaction in a binary dipolar Bose-Einstein condensate. These binary solitons have a repulsive intraspecies contact interaction stronger than the intraspecies dipolar interaction, so that they can not be bound in isolation in the absence of an interspecies dipolar interaction. These symbiotic solitons are bound in the presence of an interspecies dipolar interaction and zero interspecies contact interaction. The quasi-1D solitons are free to move along the polarization $z$ direction of the dipolar atoms, whereas the quasi-2D solitons move in the $x$-$z$ plane. To illustrate these, we consider a $^{164}$Er-$^{166}$Er mixture with scattering lengths $a$($^{164}$Er)$ =81a_0$ and $a$($^{166}$Er)$ =68a_0$ and with dipolar lengths $a_{\\mathrm{dd}}$($^{164}$Er)$\\approx a_{\\mathrm{dd}}$($^{166}$Er)$\\approx 65a_0$, where $a_0$ is the Bohr radius. In each of the two components $a> a_{\\mathrm{dd}}$, which stops the binding of solitons in each component in isolation, whereas a binary quasi-1D or a quasi-2D $^{164}$Er-$^{166}$Er soliton is bound in the presence of an interspecies dipolar interaction. The stationary states were obtained by imaginary-time propagation of the underlying mean-field model; dynamical stability of the solitons was established by real-time propagation over a long period of time.","sentences":["We study the formation of quasi-one- (quasi-1D) and quasi-two-dimensional (quasi-2D) symbiotic solitons bound by an interspecies dipolar interaction in a binary dipolar Bose-Einstein condensate.","These binary solitons have a repulsive intraspecies contact interaction stronger than the intraspecies dipolar interaction, so that they can not be bound in isolation in the absence of an interspecies dipolar interaction.","These symbiotic solitons are bound in the presence of an interspecies dipolar interaction and zero interspecies contact interaction.","The quasi-1D solitons are free to move along the polarization $z$ direction of the dipolar atoms, whereas the quasi-2D solitons move in the $x$-$z$ plane.","To illustrate these, we consider a $^{164}$Er-$^{166}$Er mixture with scattering lengths $a$($^{164}$Er)$ =81a_0$ and $a$($^{166}$Er)$ =68a_0$ and with dipolar lengths $a_{\\mathrm{dd}}$($^{164}$Er)$\\approx a_{\\mathrm{dd}}$($^{166}$Er)$\\approx 65a_0$, where $a_0$ is the Bohr radius.","In each of the two components $a> a_{\\mathrm{dd}}$, which stops the binding of solitons in each component in isolation, whereas a binary quasi-1D or a quasi-2D $^{164}$Er-$^{166}$Er soliton is bound in the presence of an interspecies dipolar interaction.","The stationary states were obtained by imaginary-time propagation of the underlying mean-field model; dynamical stability of the solitons was established by real-time propagation over a long period of time."],"url":"http://arxiv.org/abs/2405.07957v1","category":"cond-mat.quant-gas"}
{"created":"2024-05-13 17:21:10","title":"GRASS II: Simulations of Potential Granulation Noise Mitigation Methods","abstract":"We present an updated version of GRASS (the GRanulation And Spectrum Simulator, Palumbo et al. 2022) which now uses an expanded library of 22 solar lines to empirically model time-resolved spectral variations arising from solar granulation. We show that our synthesis model accurately reproduces disk-integrated solar line profiles and bisectors, and we quantify the intrinsic granulation-driven radial-velocity (RV) variability for each of the 22 lines studied. We show that summary statistics of bisector shape (e.g., bisector inverse slope) are strongly correlated with the measured anomalous, variability-driven RV at high pixel signal-to-noise ratio (SNR) and spectral resolution. Further, the strength of the correlations vary both line by line and with the summary statistic used. These correlations disappear for individual lines at the typical spectral resolutions and SNRs achieved by current EPRV spectrographs; so we use simulations from GRASS to demonstrate that they can, in principle, be recovered by selectively binning lines that are similarly affected by granulation. In the best-case scenario (high SNR and large number of binned lines), we find that a $\\lesssim$30$\\%$ reduction in the granulation-induced root mean square (RMS) RV can be achieved, but that the achievable reduction in variability is most strongly limited by the spectral resolution of the observing instrument. Based on our simulations, we predict that existing ultra-high-resolution spectrographs, namely ESPRESSO and PEPSI, should be able to resolve convective variability in other, bright stars.","sentences":["We present an updated version of GRASS (the GRanulation And Spectrum Simulator, Palumbo et al. 2022) which now uses an expanded library of 22 solar lines to empirically model time-resolved spectral variations arising from solar granulation.","We show that our synthesis model accurately reproduces disk-integrated solar line profiles and bisectors, and we quantify the intrinsic granulation-driven radial-velocity (RV) variability for each of the 22 lines studied.","We show that summary statistics of bisector shape (e.g., bisector inverse slope) are strongly correlated with the measured anomalous, variability-driven RV at high pixel signal-to-noise ratio (SNR) and spectral resolution.","Further, the strength of the correlations vary both line by line and with the summary statistic used.","These correlations disappear for individual lines at the typical spectral resolutions and SNRs achieved by current EPRV spectrographs; so we use simulations from GRASS to demonstrate that they can, in principle, be recovered by selectively binning lines that are similarly affected by granulation.","In the best-case scenario (high SNR and large number of binned lines), we find that a $\\lesssim$30$\\%$ reduction in the granulation-induced root mean square (RMS) RV can be achieved, but that the achievable reduction in variability is most strongly limited by the spectral resolution of the observing instrument.","Based on our simulations, we predict that existing ultra-high-resolution spectrographs, namely ESPRESSO and PEPSI, should be able to resolve convective variability in other, bright stars."],"url":"http://arxiv.org/abs/2405.07945v1","category":"astro-ph.SR"}
{"created":"2024-05-13 17:11:49","title":"Comparative study of the direct $^{16}{\\rm O}(p, γ)^{17}{\\rm F}$ astrophysical capture reaction within a potential model approach","abstract":"A potential model is applied for the comparative analysis of the astrophysical direct nuclear capture process $^{16}$O(p,$\\gamma)^{17}$F. The phase-equivalent potentials of the Woods-Saxon form for the p$-^{16}$O interaction are examined which reproduce the binding energies and the empirical values of ANC from different sources for the $^{17}$F(5/2$^+$) ground and $^{17}$F(1/2$^+$) ($E^*$=0.495 MeV) excited bound states. The best description of the experimental data for the astrophysical $S$ factor is obtained within the potential model which yields the ANC values of 1.043 fm$^{-1/2}$ and 75.484 fm$^{-1/2}$ for the $^{17}$F($5/2^{+}$) ground and $^{17}$F($1/2^{+}$) excited bound states, respectively. The zero-energy astrophysical factor $S(0)=9.321$ keV b was obtained by using the asymptotic expansion method of D. Baye. The calculated reaction rates are in good agreement with the R-matrix approach and the Bayesian model in the description of the both absolute values and temperature dependence within the region up to 10$^{10}$ K.","sentences":["A potential model is applied for the comparative analysis of the astrophysical direct nuclear capture process $^{16}$O(p,$\\gamma)^{17}$F. The phase-equivalent potentials of the Woods-Saxon form for the p$-^{16}$O interaction are examined which reproduce the binding energies and the empirical values of ANC from different sources for the $^{17}$F(5/2$^+$) ground and $^{17}$F(1/2$^+$) ($E^*$=0.495 MeV) excited bound states.","The best description of the experimental data for the astrophysical $S$ factor is obtained within the potential model which yields the ANC values of 1.043 fm$^{-1/2}$ and 75.484 fm$^{-1/2}$ for the $^{17}$F($5/2^{+}$) ground and $^{17}$F($1/2^{+}$) excited bound states, respectively.","The zero-energy astrophysical factor $S(0)=9.321$ keV b was obtained by using the asymptotic expansion method of D. Baye.","The calculated reaction rates are in good agreement with the R-matrix approach and the Bayesian model in the description of the both absolute values and temperature dependence within the region up to 10$^{10}$ K."],"url":"http://arxiv.org/abs/2405.07935v1","category":"nucl-th"}
{"created":"2024-05-13 16:54:45","title":"Towards understanding fermion masses and mixings","abstract":"The Standard Model does not constrain the form of the Yukawa matrices and thus the origin of fermion mass hierarchies and mixing pattern remains puzzling. On the other hand, there are intriguing relations between the quark masses and their weak mixing angles, such as the well-known one $\\tan \\theta_C= \\sqrt{m_d/m_s}$ for the Cabibbo angle, which may point towards specific textures of Yukawa matrices hypothesized by Harald Fritzsch at the end of the 70's. Though the original ansatz of Fritzsch is excluded by the experimental data, one can consider its minimal modification which consists in introducing an asymmetry between the 23 and 32 entries in the down-quark Yukawa matrix. We show that this structure is perfectly compatible with the present precision data on quark masses and CKM mixing matrix, and theoretically it can be obtained in the context of $SU(5)$ model with inter-family $SU(3)_H$ symmetry. We also discuss some alternative approaches which could give a natural description of the fermion mass spectrum and weak mixing pattern.","sentences":["The Standard Model does not constrain the form of the Yukawa matrices and thus the origin of fermion mass hierarchies and mixing pattern remains puzzling.","On the other hand, there are intriguing relations between the quark masses and their weak mixing angles, such as the well-known one $\\tan \\theta_C= \\sqrt{m_d/m_s}$ for the Cabibbo angle, which may point towards specific textures of Yukawa matrices hypothesized by Harald Fritzsch at the end of the 70's.","Though the original ansatz of Fritzsch is excluded by the experimental data, one can consider its minimal modification which consists in introducing an asymmetry between the 23 and 32 entries in the down-quark Yukawa matrix.","We show that this structure is perfectly compatible with the present precision data on quark masses and CKM mixing matrix, and theoretically it can be obtained in the context of $SU(5)$ model with inter-family $SU(3)_H$ symmetry.","We also discuss some alternative approaches which could give a natural description of the fermion mass spectrum and weak mixing pattern."],"url":"http://arxiv.org/abs/2405.07923v1","category":"hep-ph"}
{"created":"2024-05-13 16:49:55","title":"Untangling individual cation roles in rock salt high-entropy oxides","abstract":"We unravel the distinct roles each cation plays in phase evolution, stability, and properties within Mg1/5Co1/5Ni1/5Cu1/5Zn1/5O high-entropy oxide (HEO) by integrating experimental findings, thermodynamic analyses, and first-principles predictions. Our approach is through sequentially removing one cation at a time from the five-component high-entropy oxide to create five four-component derivatives. Bulk synthesis experiments indicate that Mg, Ni, and Co act as rock salt phase stabilizers whereas only Mg and Ni enthalpically enhance single-phase rock salt stability in thin film growth; synthesis conditions dictate whether Co is a rock salt phase stabilizer or destabilizer. By examining the competing phases and oxidation state preferences using pseudo-binary phase diagrams and first-principles calculations, we resolve the stability differences between bulk and thin film for all compositions. We systematically explore HEO macroscopic property sensitivity to cation selection employing both predicted and measured optical spectra. This study establishes a framework for understanding high-entropy oxide synthesizability and properties on a per-cation basis that is broadly applicable to tailoring functional property design in other high-entropy materials.","sentences":["We unravel the distinct roles each cation plays in phase evolution, stability, and properties within Mg1/5Co1/5Ni1/5Cu1/5Zn1/5O high-entropy oxide (HEO) by integrating experimental findings, thermodynamic analyses, and first-principles predictions.","Our approach is through sequentially removing one cation at a time from the five-component high-entropy oxide to create five four-component derivatives.","Bulk synthesis experiments indicate that Mg, Ni, and Co act as rock salt phase stabilizers whereas only Mg and Ni enthalpically enhance single-phase rock salt stability in thin film growth; synthesis conditions dictate whether Co is a rock salt phase stabilizer or destabilizer.","By examining the competing phases and oxidation state preferences using pseudo-binary phase diagrams and first-principles calculations, we resolve the stability differences between bulk and thin film for all compositions.","We systematically explore HEO macroscopic property sensitivity to cation selection employing both predicted and measured optical spectra.","This study establishes a framework for understanding high-entropy oxide synthesizability and properties on a per-cation basis that is broadly applicable to tailoring functional property design in other high-entropy materials."],"url":"http://arxiv.org/abs/2405.07918v1","category":"cond-mat.mtrl-sci"}
{"created":"2024-05-13 16:37:03","title":"Latest results from Super-Kamiokande","abstract":"Super-Kamiokande is the world's largest water Cherenkov experiment with its 50-kton tank of ultrapure water, recently doped with gadolinium to enhance neutron capture identification. It is a highly versatile, multi-purpose experiment in the MeV-TeV range, and here we will summarize the latest results and advancements in the atmospheric-$\\nu$, solar-$\\nu$, and Diffuse Supernova Neutrino Background analyses.","sentences":["Super-Kamiokande is the world's largest water Cherenkov experiment with its 50-kton tank of ultrapure water, recently doped with gadolinium to enhance neutron capture identification.","It is a highly versatile, multi-purpose experiment in the MeV-TeV range, and here we will summarize the latest results and advancements in the atmospheric-$\\nu$, solar-$\\nu$, and Diffuse Supernova Neutrino Background analyses."],"url":"http://arxiv.org/abs/2405.07900v1","category":"hep-ex"}
{"created":"2024-05-13 16:29:35","title":"Neutrinos from captured dark matter in galactic stars","abstract":"Sub-GeV neutrinos produced in a stellar core may emerge from main sequence stars, white dwarfs and brown dwarfs producing possible observable signals of dark matter capture. A distribution of these stars near the Milky Way galactic center will produce a neutrino flux that can be probed at Earth based neutrino observatories like Super-Kamiokande. We demonstrate that this can provide a handle to probe dark matter masses in the 100 MeV - 2 GeV mass scales that compares favourably with present day direct detection bounds.","sentences":["Sub-GeV neutrinos produced in a stellar core may emerge from main sequence stars, white dwarfs and brown dwarfs producing possible observable signals of dark matter capture.","A distribution of these stars near the Milky Way galactic center will produce a neutrino flux that can be probed at Earth based neutrino observatories like Super-Kamiokande.","We demonstrate that this can provide a handle to probe dark matter masses in the 100 MeV - 2 GeV mass scales that compares favourably with present day direct detection bounds."],"url":"http://arxiv.org/abs/2405.07894v1","category":"hep-ph"}
{"created":"2024-05-13 16:26:53","title":"Particle acceleration in relativistic Alfvénic turbulence","abstract":"Strong magnetically dominated Alfv\\'enic turbulence is an efficient engine of non-thermal particle acceleration in a relativistic collisionless plasma. We argue that in the limit of strong magnetization, the type of energy distribution attained by accelerated particles depends on the relative strengths of turbulent fluctuations $\\delta B_0$ and the guide field $B_0$. If $\\delta B_0\\ll B_0$, the particle magnetic moments are conserved and the acceleration is provided by magnetic curvature drifts. Curvature acceleration energizes particles in the direction parallel to the magnetic field lines, resulting in log-normal tails of particle energy distribution functions. Conversely, if $\\delta B_0 \\gtrsim B_0$, interactions of energetic particles with intense turbulent structures can scatter particles, creating a population with large pitch angles. In this case, magnetic mirror effects become important, and turbulent acceleration leads to power-law tails of the energy distribution functions.","sentences":["Strong magnetically dominated Alfv\\'enic turbulence is an efficient engine of non-thermal particle acceleration in a relativistic collisionless plasma.","We argue that in the limit of strong magnetization, the type of energy distribution attained by accelerated particles depends on the relative strengths of turbulent fluctuations $\\delta B_0$ and the guide field $B_0$. If $\\delta B_0\\ll B_0$, the particle magnetic moments are conserved and the acceleration is provided by magnetic curvature drifts.","Curvature acceleration energizes particles in the direction parallel to the magnetic field lines, resulting in log-normal tails of particle energy distribution functions.","Conversely, if $\\delta B_0 \\gtrsim B_0$, interactions of energetic particles with intense turbulent structures can scatter particles, creating a population with large pitch angles.","In this case, magnetic mirror effects become important, and turbulent acceleration leads to power-law tails of the energy distribution functions."],"url":"http://arxiv.org/abs/2405.07891v1","category":"physics.plasm-ph"}
{"created":"2024-05-13 16:25:27","title":"Tritium $β$-decay and Proton-Proton Fusion in Pionless Effective Field Theory","abstract":"The Gamow-Teller and Fermi matrix elements, ${\\left<\\mathbf{GT}\\right>}$ and ${\\left<\\mathbf{F}\\right>}$, respectively, for tritium $\\beta$-decay are calculated to next-to-leading order (NLO) in pionless effective field theory in the absence of Coulomb and isospin violation giving the leading order predictions ${\\left<\\mathbf{GT}\\right>}_{0}=0.9807$ and ${\\left<\\mathbf{F}\\right>}_{0}=1$. Using an experimentally determined value for the tritium-$\\beta$ decay GT matrix element, the two-body axial current low energy constant is fixed at NLO yielding $L_{1,A}=6.01\\pm2.08$ fm$^{3}$ at the renormalization scale of the physical pion mass, which agrees with predictions based on naive dimensional analysis. Finally, the consequences of Wigner-SU(4) spin-isospin symmetry are considered for the Gamow-Teller matrix element.","sentences":["The Gamow-Teller and Fermi matrix elements, ${\\left<\\mathbf{GT}\\right>}$ and ${\\left<\\mathbf{F}\\right>}$, respectively, for tritium $\\beta$-decay are calculated to next-to-leading order (NLO) in pionless effective field theory in the absence of Coulomb and isospin violation giving the leading order predictions ${\\left<\\mathbf{GT}\\right>}_{0}=0.9807$ and ${\\left<\\mathbf{F}\\right>}_{0}=1$. Using an experimentally determined value for the tritium-$\\beta$ decay GT matrix element, the two-body axial current low energy constant is fixed at NLO yielding $L_{1,A}=6.01\\pm2.08$ fm$^{3}$ at the renormalization scale of the physical pion mass, which agrees with predictions based on naive dimensional analysis.","Finally, the consequences of Wigner-SU(4) spin-isospin symmetry are considered for the Gamow-Teller matrix element."],"url":"http://arxiv.org/abs/2405.07889v1","category":"hep-ph"}
{"created":"2024-05-13 16:15:14","title":"Phase Transition of Anisotropic Hot Dense QGP in Magnetic Field: $z^5$-term Holography for Heavy Quarks","abstract":"We present a five-dimensional twice anisotropic holographic model for heavy quarks supported by Einstein-dilaton-three-Maxwell action. A special feature of the model is the presence of $z^5$-term in the metric strain coefficient (warp factor). It's influence on the model properties, mainly on the confinement/deconfinement phase transition, is considered. Conditions for the direct magnetic catalysis are found and the corresponding phase diagrams are discussed.","sentences":["We present a five-dimensional twice anisotropic holographic model for heavy quarks supported by Einstein-dilaton-three-Maxwell action.","A special feature of the model is the presence of $z^5$-term in the metric strain coefficient (warp factor).","It's influence on the model properties, mainly on the confinement/deconfinement phase transition, is considered.","Conditions for the direct magnetic catalysis are found and the corresponding phase diagrams are discussed."],"url":"http://arxiv.org/abs/2405.07881v1","category":"hep-th"}
{"created":"2024-05-13 16:07:14","title":"Long-range wormhole teleportation","abstract":"We extend the protocol of Gao and Jafferis arXiv:1911.07416 to allow wormhole teleportation between two entangled copies of the Sachdev-Ye-Kitaev (SYK) model communicating only through a classical channel. We demonstrate in finite $N$ simulations that the protocol exhibits the characteristic holographic features of wormhole teleportation discussed and summarized in Jafferis et al. https://www.nature.com/articles/s41586-022-05424-3 . We review and exhibit in detail how these holographic features relate to size winding which, as first shown by Brown et al. arXiv:1911.06314 and Nezami et al. arXiv:2102.01064, encodes a dual description of wormhole teleportation.","sentences":["We extend the protocol of Gao and Jafferis arXiv:1911.07416 to allow wormhole teleportation between two entangled copies of the Sachdev-Ye-Kitaev (SYK) model communicating only through a classical channel.","We demonstrate in finite $N$ simulations that the protocol exhibits the characteristic holographic features of wormhole teleportation discussed and summarized in Jafferis et al. https://www.nature.com/articles/s41586-022-05424-3 .","We review and exhibit in detail how these holographic features relate to size winding which, as first shown by Brown et al.","arXiv:1911.06314 and Nezami et al.","arXiv:2102.01064, encodes a dual description of wormhole teleportation."],"url":"http://arxiv.org/abs/2405.07876v1","category":"quant-ph"}
{"created":"2024-05-13 15:21:30","title":"Topological Embedding of Human Brain Networks with Applications to Dynamics of Temporal Lobe Epilepsy","abstract":"We introduce a novel, data-driven topological data analysis (TDA) approach for embedding brain networks into a lower-dimensional space in quantifying the dynamics of temporal lobe epilepsy (TLE) obtained from resting-state functional magnetic resonance imaging (rs-fMRI). This embedding facilitates the orthogonal projection of 0D and 1D topological features, allowing for the visualization and modeling of the dynamics of functional human brain networks in a resting state. We then quantify the topological disparities between networks to determine the coordinates for embedding. This framework enables us to conduct a coherent statistical inference within the embedded space. Our results indicate that brain network topology in TLE patients exhibits increased rigidity in 0D topology but more rapid flections compared to that of normal controls in 1D topology.","sentences":["We introduce a novel, data-driven topological data analysis (TDA) approach for embedding brain networks into a lower-dimensional space in quantifying the dynamics of temporal lobe epilepsy (TLE) obtained from resting-state functional magnetic resonance imaging (rs-fMRI).","This embedding facilitates the orthogonal projection of 0D and 1D topological features, allowing for the visualization and modeling of the dynamics of functional human brain networks in a resting state.","We then quantify the topological disparities between networks to determine the coordinates for embedding.","This framework enables us to conduct a coherent statistical inference within the embedded space.","Our results indicate that brain network topology in TLE patients exhibits increased rigidity in 0D topology but more rapid flections compared to that of normal controls in 1D topology."],"url":"http://arxiv.org/abs/2405.07835v1","category":"q-bio.NC"}
{"created":"2024-05-13 15:02:12","title":"An impressionist view of V Hydrae. When MATISSE paints Asymmetric Giant Blobs","abstract":"Our purpose is to study the effect of binary companions located within the first 10 stellar radii from the primary AGB star. In this work, we target the mass-losing carbon star V Hydrae (V Hya), looking for signatures of its companion in the dust forming region of the atmosphere. The star was observed in the L- and N-bands with the VLTI/MATISSE instrument at low spectral resolution. We reconstructed images of V Hya's photosphere and surroundings using the two bands and compared our interferometric observables with VLTI/MIDI and VISIR archival data. To constrain the dust properties, we used DUSTY to model the spectral energy distribution. The star is dominated by dust emission in the L- and N- bands. The VISIR image confirms the presence of a large-scale dusty circumstellar envelope surrounding V Hya. The MATISSE reconstructed images show asymmetric and elongated structures in both infrared bands. In the L-band, we detected an elongated shape of approximately 15 mas, likely to be of photospheric origin. In the N-band, we found a 20 mas extension North-East from the star, and perpendicular to the L-band elongated axis. The position angle and the size of the N-band extension match the prediction of the companion position at MATISSE epoch. By comparing MATISSE N-band with MIDI data, we deduce that the elongation axis in the N-band has rotated since the previous interferometric measurements 13 years ago, supporting the idea that the particle enhancement is related to the dusty clump moving along with the companion. The MATISSE images unveil the presence of a dust enhancement at the companion position, opening new doors for further analysis on the binary interaction with an AGB component.","sentences":["Our purpose is to study the effect of binary companions located within the first 10 stellar radii from the primary AGB star.","In this work, we target the mass-losing carbon star V Hydrae (V Hya), looking for signatures of its companion in the dust forming region of the atmosphere.","The star was observed in the L- and N-bands with the VLTI/MATISSE instrument at low spectral resolution.","We reconstructed images of V Hya's photosphere and surroundings using the two bands and compared our interferometric observables with VLTI/MIDI and VISIR archival data.","To constrain the dust properties, we used DUSTY to model the spectral energy distribution.","The star is dominated by dust emission in the L- and N- bands.","The VISIR image confirms the presence of a large-scale dusty circumstellar envelope surrounding V Hya.","The MATISSE reconstructed images show asymmetric and elongated structures in both infrared bands.","In the L-band, we detected an elongated shape of approximately 15 mas, likely to be of photospheric origin.","In the N-band, we found a 20 mas extension North-East from the star, and perpendicular to the L-band elongated axis.","The position angle and the size of the N-band extension match the prediction of the companion position at MATISSE epoch.","By comparing MATISSE N-band with MIDI data, we deduce that the elongation axis in the N-band has rotated since the previous interferometric measurements 13 years ago, supporting the idea that the particle enhancement is related to the dusty clump moving along with the companion.","The MATISSE images unveil the presence of a dust enhancement at the companion position, opening new doors for further analysis on the binary interaction with an AGB component."],"url":"http://arxiv.org/abs/2405.07821v1","category":"astro-ph.SR"}
{"created":"2024-05-13 14:58:46","title":"Gravitational form factors of the pion and meson dominance","abstract":"We show that the recent MIT lattice QCD data for the pion's gravitational form factors are, in the covered momentum transfer range, fully consistent with the meson dominance principle. In particular, the $2^{++}$ component can be accurately saturated with the $f_2(1270)$ meson, whereas the $0^{++}$ component with the $\\sigma$ meson. To incorporate the large width of the $\\sigma$, we use the dispersion relation with the spectral density obtained from the analysis of the physical pion scattering data by Donoghue, Gasser, and Leutwyler. We also discuss the implications of the perturbative QCD constraints at high momentum transfers, leading to specific sum rules for the spectral densities of the gravitational form factors, and argue that these densities cannot be of definite sign.","sentences":["We show that the recent MIT lattice QCD data for the pion's gravitational form factors are, in the covered momentum transfer range, fully consistent with the meson dominance principle.","In particular, the $2^{++}$ component can be accurately saturated with the $f_2(1270)$ meson, whereas the $0^{++}$ component with the $\\sigma$ meson.","To incorporate the large width of the $\\sigma$, we use the dispersion relation with the spectral density obtained from the analysis of the physical pion scattering data by Donoghue, Gasser, and Leutwyler.","We also discuss the implications of the perturbative QCD constraints at high momentum transfers, leading to specific sum rules for the spectral densities of the gravitational form factors, and argue that these densities cannot be of definite sign."],"url":"http://arxiv.org/abs/2405.07815v1","category":"hep-ph"}
{"created":"2024-05-13 14:41:51","title":"Widom's conjecture: variance asymptotics and entropy bounds for counting statistics of free fermions","abstract":"We obtain a central limit theorem for bulk counting statistics of free fermions in smooth domains of $\\mathbb{R}^n$ with an explicit description of the covariance structure. This amounts to a study of the asymptotics of norms of commutators between spectral projectors of semiclassical Schr\\\"odinger operators and indicator functions supported in the bulk. In the spirit of the Widom conjecture, we show that the squared Hilbert-Schmidt norm of these commutators is of order $\\hbar^{-n+1}\\log(\\hbar)$ as the semiclassical parameter $\\hbar$ tends to $0$. We also give a new upper bound on the trace norm of these commutators and applications to estimations of the entanglement entropy for free fermions.","sentences":["We obtain a central limit theorem for bulk counting statistics of free fermions in smooth domains of $\\mathbb{R}^n$ with an explicit description of the covariance structure.","This amounts to a study of the asymptotics of norms of commutators between spectral projectors of semiclassical Schr\\\"odinger operators and indicator functions supported in the bulk.","In the spirit of the Widom conjecture, we show that the squared Hilbert-Schmidt norm of these commutators is of order $\\hbar^{-n+1}\\log(\\hbar)$ as the semiclassical parameter $\\hbar$ tends to $0$. We also give a new upper bound on the trace norm of these commutators and applications to estimations of the entanglement entropy for free fermions."],"url":"http://arxiv.org/abs/2405.07796v1","category":"math.SP"}
{"created":"2024-05-13 14:41:17","title":"Deeper-band electron contributions to stopping power of silicon for low-energy ions","abstract":"This study provides accurate results for the electronic stopping cross-sections of H, He, N, and Ne in silicon in low to intermediate energy ranges using various non-perturbative theoretical methods, including real-time time-dependent density functional theory, transport cross-section, and induced-density approach. Recent experimental findings [Ntemou \\textit{et al.}, Phys. Rev. B {\\bf 107}, 155145 (2023)] revealed discrepancies between the estimates of density functional theory and observed values. We show that these discrepancies vanish by considering the nonuniform electron density of the silicon deeper bands for ion velocities approaching zero ($v \\to 0$). This indicates that mechanisms such as ``elevator'' and ``promotion,'' which can dynamically excite deeper-band electrons, are active, enabling a localized free electron gas to emulate ion energy loss, as pointed out by [Lim \\textit{et al.}, Phys. Rev. Lett. {\\bf 116}, 043201 (2016)]. The observation and the description of a velocity-proportionality breakdown in electronic stopping cross-sections at very low velocities are considered to be a signature of the deeper-band electrons' contributions.","sentences":["This study provides accurate results for the electronic stopping cross-sections of H, He, N, and Ne in silicon in low to intermediate energy ranges using various non-perturbative theoretical methods, including real-time time-dependent density functional theory, transport cross-section, and induced-density approach.","Recent experimental findings [Ntemou \\textit{et al.}, Phys. Rev. B {\\bf 107}, 155145 (2023)] revealed discrepancies between the estimates of density functional theory and observed values.","We show that these discrepancies vanish by considering the nonuniform electron density of the silicon deeper bands for ion velocities approaching zero ($v \\to 0$).","This indicates that mechanisms such as ``elevator'' and ``promotion,'' which can dynamically excite deeper-band electrons, are active, enabling a localized free electron gas to emulate ion energy loss, as pointed out by [Lim \\textit{et al.}, Phys.","Rev. Lett.","{\\bf 116}, 043201 (2016)].","The observation and the description of a velocity-proportionality breakdown in electronic stopping cross-sections at very low velocities are considered to be a signature of the deeper-band electrons' contributions."],"url":"http://arxiv.org/abs/2405.07794v1","category":"physics.chem-ph"}
{"created":"2024-05-13 14:28:28","title":"The $γ$-process nucleosynthesis in core-collapse supernovae II. Effect of the explosive recipe","abstract":"The $\\gamma$-process in core-collapse supernovae (CCSNe) can produce a number of neutron-deficient stable isotopes heavier than iron (p-nuclei). However, current model predictions do to not fully reproduce the solar abundances. We investigate the impact of different explosion energies and parameters on the nucleosynthesis of p-nuclei, by studying stellar models with different initial masses and CCSN explosions. We find that the total p-nuclei yields are only marginally affected by the CCSN explosion prescriptions if the $\\gamma$-process production is already efficient in the stellar progenitors due to a C-O shell merger. In most of CCSN explosions from progenitors without C-O shell merger, the $\\gamma$-process yields increase with the explosion energy up to an order of magnitude, depending on the progenitor structure and the CCSN prescriptions. The trend of the p-nuclei production with the explosion energy is more complicated if we look at the production of single p-nuclei. The light p-nuclei tend to be the most enhanced with increasing the explosion energy. In particular, for the CCSN models where the $\\alpha$-rich freeze-out component is ejected, the yields of the lightest p-nuclei increase by up to three orders of magnitude. We provide the first extensive study using different sets of massive stars of the impact of varying CCSN explosion prescriptions on the production of the p-nuclei. Unlike previous expectations and recent results in the literature, we find that the average production of p-nuclei tends to increase with the explosion energy. We also confirm that the pre-explosive production of p-nuclei in C-O shell mergers is a robust result, independently from the subsequent explosive nucleosynthesis. A realistic range of variations in the evolution of stellar progenitors and in the CCSN explosions might boost the CCSN contribution to the galactic chemical evolution of p-nuclei.","sentences":["The $\\gamma$-process in core-collapse supernovae (CCSNe) can produce a number of neutron-deficient stable isotopes heavier than iron (p-nuclei).","However, current model predictions do to not fully reproduce the solar abundances.","We investigate the impact of different explosion energies and parameters on the nucleosynthesis of p-nuclei, by studying stellar models with different initial masses and CCSN explosions.","We find that the total p-nuclei yields are only marginally affected by the CCSN explosion prescriptions if the $\\gamma$-process production is already efficient in the stellar progenitors due to a C-O shell merger.","In most of CCSN explosions from progenitors without C-O shell merger, the $\\gamma$-process yields increase with the explosion energy up to an order of magnitude, depending on the progenitor structure and the CCSN prescriptions.","The trend of the p-nuclei production with the explosion energy is more complicated if we look at the production of single p-nuclei.","The light p-nuclei tend to be the most enhanced with increasing the explosion energy.","In particular, for the CCSN models where the $\\alpha$-rich freeze-out component is ejected, the yields of the lightest p-nuclei increase by up to three orders of magnitude.","We provide the first extensive study using different sets of massive stars of the impact of varying CCSN explosion prescriptions on the production of the p-nuclei.","Unlike previous expectations and recent results in the literature, we find that the average production of p-nuclei tends to increase with the explosion energy.","We also confirm that the pre-explosive production of p-nuclei in C-O shell mergers is a robust result, independently from the subsequent explosive nucleosynthesis.","A realistic range of variations in the evolution of stellar progenitors and in the CCSN explosions might boost the CCSN contribution to the galactic chemical evolution of p-nuclei."],"url":"http://arxiv.org/abs/2405.07783v1","category":"astro-ph.SR"}
{"created":"2024-05-13 14:04:34","title":"A method for supervoxel-wise association studies of age and other non-imaging variables from coronary computed tomography angiograms","abstract":"The study of associations between an individual's age and imaging and non-imaging data is an active research area that attempts to aid understanding of the effects and patterns of aging. In this work we have conducted a supervoxel-wise association study between both volumetric and tissue density features in coronary computed tomography angiograms and the chronological age of a subject, to understand the localized changes in morphology and tissue density with age. To enable a supervoxel-wise study of volume and tissue density, we developed a novel method based on image segmentation, inter-subject image registration, and robust supervoxel-based correlation analysis, to achieve a statistical association study between the images and age. We evaluate the registration methodology in terms of the Dice coefficient for the heart chambers and myocardium, and the inverse consistency of the transformations, showing that the method works well in most cases with high overlap and inverse consistency. In a sex-stratified study conducted on a subset of $n=1388$ images from the SCAPIS study, the supervoxel-wise analysis was able to find localized associations with age outside of the commonly segmented and analyzed sub-regions, and several substantial differences between the sexes in association of age and volume.","sentences":["The study of associations between an individual's age and imaging and non-imaging data is an active research area that attempts to aid understanding of the effects and patterns of aging.","In this work we have conducted a supervoxel-wise association study between both volumetric and tissue density features in coronary computed tomography angiograms and the chronological age of a subject, to understand the localized changes in morphology and tissue density with age.","To enable a supervoxel-wise study of volume and tissue density, we developed a novel method based on image segmentation, inter-subject image registration, and robust supervoxel-based correlation analysis, to achieve a statistical association study between the images and age.","We evaluate the registration methodology in terms of the Dice coefficient for the heart chambers and myocardium, and the inverse consistency of the transformations, showing that the method works well in most cases with high overlap and inverse consistency.","In a sex-stratified study conducted on a subset of $n=1388$ images from the SCAPIS study, the supervoxel-wise analysis was able to find localized associations with age outside of the commonly segmented and analyzed sub-regions, and several substantial differences between the sexes in association of age and volume."],"url":"http://arxiv.org/abs/2405.07762v1","category":"eess.IV"}
{"created":"2024-05-13 13:43:23","title":"Pulsar timing array constraints on the cosmological magnetic field from quark confinement epoch","abstract":"Recent evidence for the stochastic gravitational wave backgorund reported by the pulsar timing arrays (PTA) can be interpreted as a signal from the cosmological phase transition. We use up-to-date models of the gravitational wave power spectra to compare constraints on the parameters of the phase transition for the three different available PTA measurements and to work out a refined estimate of the cosmological magnetic field that should result from this transition. We find that the PTA data, combined with a constraint from the abundance of primordial black holes, are consistent with a possibility of a moderate strength first-order phase transition during quark confinement and yield a rather precise prediction for the initial parameters of the magnetic field, with the magnetic field energy density in near equipartition with photon energy density and correlation length close to one co-moving parsec.","sentences":["Recent evidence for the stochastic gravitational wave backgorund reported by the pulsar timing arrays (PTA) can be interpreted as a signal from the cosmological phase transition.","We use up-to-date models of the gravitational wave power spectra to compare constraints on the parameters of the phase transition for the three different available PTA measurements and to work out a refined estimate of the cosmological magnetic field that should result from this transition.","We find that the PTA data, combined with a constraint from the abundance of primordial black holes, are consistent with a possibility of a moderate strength first-order phase transition during quark confinement and yield a rather precise prediction for the initial parameters of the magnetic field, with the magnetic field energy density in near equipartition with photon energy density and correlation length close to one co-moving parsec."],"url":"http://arxiv.org/abs/2405.07746v1","category":"astro-ph.CO"}
{"created":"2024-05-13 13:22:29","title":"Violation of Weak Cosmic Censorship in de Sitter Space","abstract":"Inspired by the recent discovery of a violation of strong cosmic censorship (SCC) for the near-extremal Reissner-Nordstr\\\"om black holes in de Sitter space (RN-dS), we investigate if the weak cosmic censorship conjecture (WCCC) can also be violated in RN-dS with a fixed cosmological constant. Our method is based on the recent formulation of examining WCCC by requiring the second law to hold, which requires the sum of areas of the event and cosmic horizons cannot decrease during the infall process of Wald's gedanken experiment. We find that the WCCC can be violated for the near-extremal RN-dS in some regimes of second-order perturbation of field configurations. Given the charge parameter of RN-dS, we can find the lowest value of the sub-extremality parameter, beyond which the WCCC holds. Our results imply that violations of SCC and WCCC could be correlated. Because of a lack of an unambiguous relation between the gravitational mass and matter's kinematic mass in asymptotically de Sitter space, we cannot compare the corresponding regimes of parameter space for the violations of SCC and WCCC. We also discuss the subtlety in formulating both the first-law and second-law approaches to examine WCCC.","sentences":["Inspired by the recent discovery of a violation of strong cosmic censorship (SCC) for the near-extremal Reissner-Nordstr\\\"om black holes in de Sitter space (RN-dS), we investigate if the weak cosmic censorship conjecture (WCCC) can also be violated in RN-dS with a fixed cosmological constant.","Our method is based on the recent formulation of examining WCCC by requiring the second law to hold, which requires the sum of areas of the event and cosmic horizons cannot decrease during the infall process of Wald's gedanken experiment.","We find that the WCCC can be violated for the near-extremal RN-dS in some regimes of second-order perturbation of field configurations.","Given the charge parameter of RN-dS, we can find the lowest value of the sub-extremality parameter, beyond which the WCCC holds.","Our results imply that violations of SCC and WCCC could be correlated.","Because of a lack of an unambiguous relation between the gravitational mass and matter's kinematic mass in asymptotically de Sitter space, we cannot compare the corresponding regimes of parameter space for the violations of SCC and WCCC.","We also discuss the subtlety in formulating both the first-law and second-law approaches to examine WCCC."],"url":"http://arxiv.org/abs/2405.07728v1","category":"hep-th"}
{"created":"2024-05-13 12:46:44","title":"Shell structure and shape transition in odd-$Z$ superheavy nuclei with proton numbers $Z=117, 119$: insights from deformed relativistic Hartree-Bogoliubov in continuum","abstract":"We present a systematic study on the structural properties of odd-$Z$ superheavy nuclei with proton numbers $Z=117, 119$, and neutron numbers $N$ increasing from $N=170$ to the neutron dripline within the framework of axially deformed relativistic Hartree-Bogoliubov theory in continuum (DRHBc). The results are compared with those of even-even superheavy nuclei with proton numbers $Z=118$ and $120$. We analyze various bulk properties of their ground states, including binding energies, quadrupole deformations, root-mean-square radii, nucleon separation energies, and $\\alpha$-decay energies. The coexistence of competing prolate and oblate or spherical shapes leads to abrupt changes in both quadrupole deformations and charge radii as functions of neutron numbers. Compared to even-even nuclei, the odd-mass ones exhibit a more complicated transition picture, in which the quantum numbers of $K^\\pi$ of the lowest-energy configuration may change with deformation. This may result in the change of angular momentum in the ground-state to ground-state $\\alpha$-decay and thus quench the decay rate in odd-mass nuclei. Moreover, our results demonstrate a pronounced proton shell gap at $Z=120$, instead of $Z=114$, which is consistent with the predictions of most covariant density functional theories. Moreover, large neutron shell gaps are found at $N=172$ and $N=258$ in the four isotopic chains, as well as at $N=184$ in the light two isotopic chains with $Z=117$ and $Z=118$, attributed to the nearly-degenerate $3d$ and $4p$ spin-orbit doublet states due to the presence of bubble structure.","sentences":["We present a systematic study on the structural properties of odd-$Z$ superheavy nuclei with proton numbers $Z=117, 119$, and neutron numbers $N$ increasing from $N=170$ to the neutron dripline within the framework of axially deformed relativistic Hartree-Bogoliubov theory in continuum (DRHBc).","The results are compared with those of even-even superheavy nuclei with proton numbers $Z=118$ and $120$. We analyze various bulk properties of their ground states, including binding energies, quadrupole deformations, root-mean-square radii, nucleon separation energies, and $\\alpha$-decay energies.","The coexistence of competing prolate and oblate or spherical shapes leads to abrupt changes in both quadrupole deformations and charge radii as functions of neutron numbers.","Compared to even-even nuclei, the odd-mass ones exhibit a more complicated transition picture, in which the quantum numbers of $K^\\pi$ of the lowest-energy configuration may change with deformation.","This may result in the change of angular momentum in the ground-state to ground-state $\\alpha$-decay and thus quench the decay rate in odd-mass nuclei.","Moreover, our results demonstrate a pronounced proton shell gap at $Z=120$, instead of $Z=114$, which is consistent with the predictions of most covariant density functional theories.","Moreover, large neutron shell gaps are found at $N=172$ and $N=258$ in the four isotopic chains, as well as at $N=184$ in the light two isotopic chains with $Z=117$ and $Z=118$, attributed to the nearly-degenerate $3d$ and $4p$ spin-orbit doublet states due to the presence of bubble structure."],"url":"http://arxiv.org/abs/2405.07704v1","category":"nucl-th"}
{"created":"2024-05-13 12:34:31","title":"The Red Supergiant Progenitor of Type II Supernova 2024ggi","abstract":"We present a detailed analysis of the progenitor and its local environment for the recently discovered type II supernova (SN) 2024ggi at a distance of about 6.7~Mpc, by utilizing the pre-explosion images from the Hubble Space Telescope (HST) and \\textit{Spitzer} Space Telescope. The progenitor is identified as a red, bright variable star, with absolute $F814W$-band magnitudes being $-$6.2 mag in 1995 to $-$7.2 mag in 2003, respectively, consistent with that of a normal red supergiant (RSG) star. Combining with the historical mid-infrared light curves, a pulsational period of about 379~days can be inferred for the progenitor star. Fitting its spectral energy distribution with stellar spectral models yields the stellar parameters of temperature, radius and bolometric luminosity as $T_*=3290_{-27}^{+19}$~K, $R_*=887_{-51}^{+60}$~R$_{\\odot}$, and log($L$/L$_{\\odot}$)$=4.92_{-0.04}^{+0.05}$, respectively. The above parameters indicate that the progenitor of SN 2024ggi is consistent with the stellar evolutionary track of a solar-metallicity massive star with an initial mass of $13_{-1}^{+1}$~M$_{\\odot}$. Moreover, our analysis indicates a relatively low mass loss rate (i.e., $< 3\\times10^{-6}$~M$_{\\odot}$~yr$^{-1}$) for the progenitor compared to that inferred from the flashed spectra and X-ray detection (i.e., $10^{-2}$$-$$ 10$$^{-5}$~M$_{\\odot}$~yr$^{-1}$), implying a significant enhancement in mass loss within a few years prior to the explosion.","sentences":["We present a detailed analysis of the progenitor and its local environment for the recently discovered type II supernova (SN) 2024ggi at a distance of about 6.7~Mpc, by utilizing the pre-explosion images from the Hubble Space Telescope (HST) and \\textit{Spitzer} Space Telescope.","The progenitor is identified as a red, bright variable star, with absolute $F814W$-band magnitudes being $-$6.2 mag in 1995 to $-$7.2 mag in 2003, respectively, consistent with that of a normal red supergiant (RSG) star.","Combining with the historical mid-infrared light curves, a pulsational period of about 379~days can be inferred for the progenitor star.","Fitting its spectral energy distribution with stellar spectral models yields the stellar parameters of temperature, radius and bolometric luminosity as $T_*=3290_{-27}^{+19}$~K, $R_*=887_{-51}^{+60}$~R$_{\\odot}$, and log($L$/L$_{\\odot}$)$=4.92_{-0.04}^{+0.05}$, respectively.","The above parameters indicate that the progenitor of SN 2024ggi is consistent with the stellar evolutionary track of a solar-metallicity massive star with an initial mass of $13_{-1}^{+1}$~M$_{\\odot}$. Moreover, our analysis indicates a relatively low mass loss rate (i.e., $< 3\\times10^{-6}$~M$_{\\odot}$~yr$^{-1}$) for the progenitor compared to that inferred from the flashed spectra and X-ray detection (i.e., $10^{-2}$$-$$ 10$$^{-5}$~M$_{\\odot}$~yr$^{-1}$), implying a significant enhancement in mass loss within a few years prior to the explosion."],"url":"http://arxiv.org/abs/2405.07699v1","category":"astro-ph.HE"}
{"created":"2024-05-13 12:28:44","title":"$\\mathrm{B^0_{(s)}}\\to μ^+μ^-$ rare decays at LHC","abstract":"The ATLAS, CMS, and LHCb collaborations have leveraged data from proton-proton collisions at the Large Hadron Collider (LHC) to advance our understanding of fundamental particles and their interactions. These collaborative efforts underscore the significance of integrating datasets across different runs and energy levels, yielding insights that contribute to the ongoing measurements of the $\\mathrm{B^0_{(s)}}\\to \\mu^+\\mu^-$ decay branching fractions and $\\mathrm{B^0_{s}}\\to \\mu^+\\mu^-$ effective lifetime.","sentences":["The ATLAS, CMS, and LHCb collaborations have leveraged data from proton-proton collisions at the Large Hadron Collider (LHC) to advance our understanding of fundamental particles and their interactions.","These collaborative efforts underscore the significance of integrating datasets across different runs and energy levels, yielding insights that contribute to the ongoing measurements of the $\\mathrm{B^0_{(s)}}\\to \\mu^+\\mu^-$ decay branching fractions and $\\mathrm{B^0_{s}}\\to \\mu^+\\mu^-$ effective lifetime."],"url":"http://arxiv.org/abs/2405.07693v1","category":"hep-ex"}
{"created":"2024-05-13 12:25:43","title":"Discovery of Very-high-energy Gamma-ray Emissions from the Low Luminosity AGN NGC 4278 by LHAASO","abstract":"The first source catalog of Large High Altitude Air Shower Observatory reported the detection of a very-high-energy gamma ray source, 1LHAASO J1219+2915. In this paper a further detailed study of the spectral and temporal behavior of this point-like source have been carried. The best-fit position of the TeV source ($\\rm{RA}=185.05^{\\circ}\\pm0.04^{\\circ}$, $\\rm{Dec}=29.25^{\\circ}\\pm0.03^{\\circ}$) is compatible with NGC 4278 within $\\sim0.03$ degree. Variation analysis shows an indication of the variability at a few months level in the TeV band, which is consistent with low frequency observations. Based on these observations, we report the detection of TeV $\\gamma$-ray emissions from this low-luminosity AGN NGC 4278. The observations by LHAASO-WCDA during active period has a significance level of 8.8\\,$\\sigma$ with best-fit photon spectral index $\\varGamma=2.56\\pm0.14$ and a flux $f_{1-10\\,\\rm{TeV}}=(7.0\\pm1.1_{\\rm{sta}}\\pm0.35_{\\rm{syst}})\\times10^{-13}\\,\\rm{photons\\,cm^{-2}\\,s^{-1}}$, or approximately $5\\%$ of the Crab Nebula. The discovery of VHE from NGC 4278 indicates that the compact, weak radio jet can efficiently accelerate particles and emit TeV photons.","sentences":["The first source catalog of Large High Altitude Air Shower Observatory reported the detection of a very-high-energy gamma ray source, 1LHAASO J1219+2915.","In this paper a further detailed study of the spectral and temporal behavior of this point-like source have been carried.","The best-fit position of the TeV source ($\\rm{RA}=185.05^{\\circ}\\pm0.04^{\\circ}$, $\\rm{Dec}=29.25^{\\circ}\\pm0.03^{\\circ}$) is compatible with NGC 4278 within $\\sim0.03$ degree.","Variation analysis shows an indication of the variability at a few months level in the TeV band, which is consistent with low frequency observations.","Based on these observations, we report the detection of TeV $\\gamma$-ray emissions from this low-luminosity AGN NGC 4278.","The observations by LHAASO-WCDA during active period has a significance level of 8.8\\,$\\sigma$ with best-fit photon spectral index $\\varGamma=2.56\\pm0.14$ and a flux $f_{1-10\\,\\rm{TeV}}=(7.0\\pm1.1_{\\rm{sta}}\\pm0.35_{\\rm{syst}})\\times10^{-13}\\,\\rm{photons\\,cm^{-2}\\,s^{-1}}$, or approximately $5\\%$ of the Crab Nebula.","The discovery of VHE from NGC 4278 indicates that the compact, weak radio jet can efficiently accelerate particles and emit TeV photons."],"url":"http://arxiv.org/abs/2405.07691v1","category":"astro-ph.HE"}
{"created":"2024-05-13 12:04:34","title":"Super-concentrated alkali hydroxide electrolytes for rechargeable Zn batteries","abstract":"Rechargeable Zn batteries offer safe, inexpensive energy storage, but when deeply discharged to compete with lithium-ion batteries, they are plagued by parasitic reactions at the Zn anodes. We apply super-concentrated alkaline electrolytes to suppress two key parasitic reactions, hydrogen evolution and ZnO passivation. An electrolyte with 15 M KOH displays a broad electrochemical window (>2.5 V on Au), a high ZnO solubility (>1.5 M), and an exceptionally high ionic conductivity (>0.27 S/cm at 25 C). Spectroscopies and ab-initio molecular dynamics simulation suggest K+-OH- pairs and a tightened water network to underpin the stability. The simulation further reveals unique triggered proton hopping that offsets the lack of water wires to sustain the conductivity. Low hydrogen evolution, confirmed via online mass spectroscopy, and slow passivation enable a NiOOH||Zn battery to deliver a cumulative capacity of 8.4 Ah cm-2 and a Zn-air battery to last for over 110 hours.","sentences":["Rechargeable Zn batteries offer safe, inexpensive energy storage, but when deeply discharged to compete with lithium-ion batteries, they are plagued by parasitic reactions at the Zn anodes.","We apply super-concentrated alkaline electrolytes to suppress two key parasitic reactions, hydrogen evolution and ZnO passivation.","An electrolyte with 15 M KOH displays a broad electrochemical window (>2.5 V on Au), a high ZnO solubility (>1.5 M), and an exceptionally high ionic conductivity (>0.27 S/cm at 25 C).","Spectroscopies and ab-initio molecular dynamics simulation suggest K+-OH- pairs and a tightened water network to underpin the stability.","The simulation further reveals unique triggered proton hopping that offsets the lack of water wires to sustain the conductivity.","Low hydrogen evolution, confirmed via online mass spectroscopy, and slow passivation enable a NiOOH||Zn battery to deliver a cumulative capacity of 8.4 Ah cm-2 and a Zn-air battery to last for over 110 hours."],"url":"http://arxiv.org/abs/2405.07675v1","category":"cond-mat.mtrl-sci"}
{"created":"2024-05-13 11:20:44","title":"InP/GaSb core-shell nanowires: a practical proposal for Majorana modes in a full-shell hybrid geometry with hole bands","abstract":"Full-shell hybrid nanowires (NWs), structures comprising a superconductor shell that encapsulates a semiconductor (SM) core, have attracted considerable attention in the search for Majorana zero modes (MZMs). The main caveats of this platform, however, are that the predicted Rashba spin-orbit coupling (SOC) in the SM is too small to achieve substantial topological minigaps and that the MZMs typically coexist with a finite background of trivial subgap states. In order to overcome both problems, we explore the advantages of utilizing core-shell hole-band NWs for the SM part of the full-shell hybrid, with an insulating core and an active SM shell. In particular, we consider InP/GaSb core-shell NWs, which allow to exploit the unique characteristics of the III-V compound SM valence bands. We demonstrate that they exhibit a robust hole SOC that depends mainly on SM and geometrical parameters. In other words, the SOC is intrinsic and does not rely on neither electric fields, which are non-tunable in a full-shell hybrid geometry, nor on the strain at the interface, contrary to what happens in Ge/Si heterostructures where the strain plays a crucial role. As a result, core-shell hole-band NWs emerge as a promising candidate for full-shell Majorana physics, addressing several challenges in the field.","sentences":["Full-shell hybrid nanowires (NWs), structures comprising a superconductor shell that encapsulates a semiconductor (SM) core, have attracted considerable attention in the search for Majorana zero modes (MZMs).","The main caveats of this platform, however, are that the predicted Rashba spin-orbit coupling (SOC) in the SM is too small to achieve substantial topological minigaps and that the MZMs typically coexist with a finite background of trivial subgap states.","In order to overcome both problems, we explore the advantages of utilizing core-shell hole-band NWs for the SM part of the full-shell hybrid, with an insulating core and an active SM shell.","In particular, we consider InP/GaSb core-shell NWs, which allow to exploit the unique characteristics of the III-V compound SM valence bands.","We demonstrate that they exhibit a robust hole SOC that depends mainly on SM and geometrical parameters.","In other words, the SOC is intrinsic and does not rely on neither electric fields, which are non-tunable in a full-shell hybrid geometry, nor on the strain at the interface, contrary to what happens in Ge/Si heterostructures where the strain plays a crucial role.","As a result, core-shell hole-band NWs emerge as a promising candidate for full-shell Majorana physics, addressing several challenges in the field."],"url":"http://arxiv.org/abs/2405.07651v1","category":"cond-mat.mes-hall"}
{"created":"2024-05-13 10:37:55","title":"End-to-End Delivery in LEO Mega-constellations and the Reordering Problem","abstract":"Low Earth orbit (LEO) satellite mega-constellations with hundreds or thousands of satellites and inter-satellite links (ISLs) have the potential to provide global end-to-end connectivity. Furthermore, if the physical distance between source and destination is sufficiently long, end-to-end routing over the LEO constellation can provide lower latency when compared to the terrestrial infrastructure due to the faster propagation of electromagnetic waves in space than in optic fiber. However, the frequent route changes due to the movement of the satellites result in the out-of-order delivery of packets, causing sudden changes to the Round-Trip Time (RTT) that can be misinterpreted as congestion by congestion control algorithms. In this paper, the performance of three widely used congestion control algorithms, Cubic, Reno, and BBR, is evaluated in an emulated LEO satellite constellation with Free-Space Optical (FSO) ISLs. Furthermore, we perform a sensitivity analysis for Cubic by changing the satellite constellation parameters, length of the routes, and the positions of the source and destination to identify problematic routing scenarios. The results show that route changes can have profound transient effects on the goodput of the connection, posing problems for typical broadband applications.","sentences":["Low Earth orbit (LEO) satellite mega-constellations with hundreds or thousands of satellites and inter-satellite links (ISLs) have the potential to provide global end-to-end connectivity.","Furthermore, if the physical distance between source and destination is sufficiently long, end-to-end routing over the LEO constellation can provide lower latency when compared to the terrestrial infrastructure due to the faster propagation of electromagnetic waves in space than in optic fiber.","However, the frequent route changes due to the movement of the satellites result in the out-of-order delivery of packets, causing sudden changes to the Round-Trip Time (RTT) that can be misinterpreted as congestion by congestion control algorithms.","In this paper, the performance of three widely used congestion control algorithms, Cubic, Reno, and BBR, is evaluated in an emulated LEO satellite constellation with Free-Space Optical (FSO) ISLs.","Furthermore, we perform a sensitivity analysis for Cubic by changing the satellite constellation parameters, length of the routes, and the positions of the source and destination to identify problematic routing scenarios.","The results show that route changes can have profound transient effects on the goodput of the connection, posing problems for typical broadband applications."],"url":"http://arxiv.org/abs/2405.07627v1","category":"cs.NI"}
{"created":"2024-05-13 09:27:44","title":"Discovery of a shock-compressed magnetic field in the north-western rim of the young supernova remnant RX J1713.7-3946 with X-ray polarimetry","abstract":"Supernova remnants (SNRs) provide insights into cosmic-ray acceleration and magnetic field dynamics at shock fronts. Recent X-ray polarimetric measurements by the Imaging X-ray Polarimetry Explorer (IXPE) have revealed radial magnetic fields near particle acceleration sites in young SNRs, including Cassiopeia A, Tycho, and SN 1006. We present here the spatially-resolved IXPE X-ray polarimetric observation of the northwestern rim of SNR RX J1713.7-3946. For the first time, our analysis shows that the magnetic field in particle acceleration sites of this SNR is oriented tangentially with respect to the shock front. Because of the lack of precise Faraday-rotation measurements in the radio band, this was not possible before. The average measured polarization degree (PD) of the synchtrotron emission is 12.5 {\\pm} 3.3%, lower than the one measured by IXPE in SN 1006, comparable to the Tycho one, but notably higher than the one in Cassiopeia A. On sub-parsec scales, localized patches within RX J1713.7-3946 display PD up to 41.5 {\\pm} 9.5%. These results are compatible with a shock-compressed magnetic field. However, in order to explain the observed PD, either the presence of a radial net magnetic field upstream of the shock, or partial reisotropization of the turbulence downstream by radial magneto-hydrodynamical instabilities, can be invoked. From comparison of PD and magnetic field distribution with {\\gamma}-rays and 12 CO data, our results provide new inputs in favor of a leptonic origin of the {\\gamma}-ray emission.","sentences":["Supernova remnants (SNRs) provide insights into cosmic-ray acceleration and magnetic field dynamics at shock fronts.","Recent X-ray polarimetric measurements by the Imaging X-ray Polarimetry Explorer (IXPE) have revealed radial magnetic fields near particle acceleration sites in young SNRs, including Cassiopeia A, Tycho, and SN 1006.","We present here the spatially-resolved IXPE X-ray polarimetric observation of the northwestern rim of SNR RX J1713.7-3946.","For the first time, our analysis shows that the magnetic field in particle acceleration sites of this SNR is oriented tangentially with respect to the shock front.","Because of the lack of precise Faraday-rotation measurements in the radio band, this was not possible before.","The average measured polarization degree (PD) of the synchtrotron emission is 12.5 {\\pm} 3.3%, lower than the one measured by IXPE in SN 1006, comparable to the Tycho one, but notably higher than the one in Cassiopeia A. On sub-parsec scales, localized patches within RX J1713.7-3946 display PD up to 41.5 {\\pm} 9.5%.","These results are compatible with a shock-compressed magnetic field.","However, in order to explain the observed PD, either the presence of a radial net magnetic field upstream of the shock, or partial reisotropization of the turbulence downstream by radial magneto-hydrodynamical instabilities, can be invoked.","From comparison of PD and magnetic field distribution with {\\gamma}-rays and 12 CO data, our results provide new inputs in favor of a leptonic origin of the {\\gamma}-ray emission."],"url":"http://arxiv.org/abs/2405.07577v1","category":"astro-ph.HE"}
{"created":"2024-05-13 08:24:21","title":"EMS-SD: Efficient Multi-sample Speculative Decoding for Accelerating Large Language Models","abstract":"Speculative decoding emerges as a pivotal technique for enhancing the inference speed of Large Language Models (LLMs). Despite recent research aiming to improve prediction efficiency, multi-sample speculative decoding has been overlooked due to varying numbers of accepted tokens within a batch in the verification phase. Vanilla method adds padding tokens in order to ensure that the number of new tokens remains consistent across samples. However, this increases the computational and memory access overhead, thereby reducing the speedup ratio. We propose a novel method that can resolve the issue of inconsistent tokens accepted by different samples without necessitating an increase in memory or computing overhead. Furthermore, our proposed method can handle the situation where the prediction tokens of different samples are inconsistent without the need to add padding tokens. Sufficient experiments demonstrate the efficacy of our method. Our code is available at https://github.com/niyunsheng/EMS-SD.","sentences":["Speculative decoding emerges as a pivotal technique for enhancing the inference speed of Large Language Models (LLMs).","Despite recent research aiming to improve prediction efficiency, multi-sample speculative decoding has been overlooked due to varying numbers of accepted tokens within a batch in the verification phase.","Vanilla method adds padding tokens in order to ensure that the number of new tokens remains consistent across samples.","However, this increases the computational and memory access overhead, thereby reducing the speedup ratio.","We propose a novel method that can resolve the issue of inconsistent tokens accepted by different samples without necessitating an increase in memory or computing overhead.","Furthermore, our proposed method can handle the situation where the prediction tokens of different samples are inconsistent without the need to add padding tokens.","Sufficient experiments demonstrate the efficacy of our method.","Our code is available at https://github.com/niyunsheng/EMS-SD."],"url":"http://arxiv.org/abs/2405.07542v1","category":"cs.CL"}
{"created":"2024-05-13 06:55:05","title":"Hierarchical inference of evidence using posterior samples","abstract":"The Bayesian evidence, crucial ingredient for model selection, is arguably the most important quantity in Bayesian data analysis: at the same time, however, it is also one of the most difficult to compute. In this paper we present a hierarchical method that leverages on a multivariate normalised approximant for the posterior probability density to infer the evidence for a model in a hierarchical fashion using a set of posterior samples drawn using an arbitrary sampling scheme.","sentences":["The Bayesian evidence, crucial ingredient for model selection, is arguably the most important quantity in Bayesian data analysis: at the same time, however, it is also one of the most difficult to compute.","In this paper we present a hierarchical method that leverages on a multivariate normalised approximant for the posterior probability density to infer the evidence for a model in a hierarchical fashion using a set of posterior samples drawn using an arbitrary sampling scheme."],"url":"http://arxiv.org/abs/2405.07504v1","category":"stat.ME"}
{"created":"2024-05-13 06:49:37","title":"Influence of Black Hole Kick Velocity on Microlensing Distributions","abstract":"The natal kick velocity distribution for black holes (BHs) is unknown regardless of its importance for understanding the BH formation process. Gravitational microlensing is a unique tool for studying the distribution of BHs in our Galaxy, and the first isolated stellar-mass BH event, OGLE-2011-BLG-0462/MOA-2011-BLG-191 (OB110462), was recently identified by astrometric microlensing. This study investigates how the natal kick velocity for Galactic BHs affects the microlensing event rate distribution. We consider a Maxwell distribution with various average kick velocities, as well as the consequent variation of the spatial distribution of BHs. We find that the event rate for the BH lenses toward the Galactic bulge decreases as $v_{\\rm avg}$ increases, mainly due to the scale height inflation. We focus on the unique microlensing parameters measured for OB110462, with microlens parallax $\\pi_{\\rm E}$ larger than 0.06 for its long timescale of $t_{\\rm E} > 200~$ days. We calculate the expected number of BH events occurring with parameters similar to OB110462 during the OGLE-IV survey by Mr\\'oz et al. (2017, 2019) and compare it with the actual number that occurred, at least one. Our fiducial model predicts 0.26, 0.19, 0.095, 0.020, and $1.8 \\times 10^{-3}$ events occurring for $v_{\\rm avg} =$ 25 km/sec, 50 km/sec, 100 km/sec, 200 km/sec, and 400 km/sec, respectively, which suggests that the average kick velocity is likely to be $v_{\\rm avg} \\lesssim 100~{\\rm km/sec}$. The expected number smaller than unity even at maximum might indicate our luckiness of finding OB110462, which can be tested with future surveys by e.g. the Roman space telescope.","sentences":["The natal kick velocity distribution for black holes (BHs) is unknown regardless of its importance for understanding the BH formation process.","Gravitational microlensing is a unique tool for studying the distribution of BHs in our Galaxy, and the first isolated stellar-mass BH event, OGLE-2011-BLG-0462/MOA-2011-BLG-191 (OB110462), was recently identified by astrometric microlensing.","This study investigates how the natal kick velocity for Galactic BHs affects the microlensing event rate distribution.","We consider a Maxwell distribution with various average kick velocities, as well as the consequent variation of the spatial distribution of BHs.","We find that the event rate for the BH lenses toward the Galactic bulge decreases as $v_{\\rm avg}$ increases, mainly due to the scale height inflation.","We focus on the unique microlensing parameters measured for OB110462, with microlens parallax $\\pi_{\\rm E}$ larger than 0.06 for its long timescale of $t_{\\rm E} > 200~$ days.","We calculate the expected number of BH events occurring with parameters similar to OB110462 during the OGLE-IV survey by Mr\\'oz et al. (2017, 2019) and compare it with the actual number that occurred, at least one.","Our fiducial model predicts 0.26, 0.19, 0.095, 0.020, and $1.8 \\times 10^{-3}$ events occurring for $v_{\\rm avg} =$ 25 km/sec, 50 km/sec, 100 km/sec, 200 km/sec, and 400 km/sec, respectively, which suggests that the average kick velocity is likely to be $v_{\\rm avg} \\lesssim 100~{\\rm km/sec}$.","The expected number smaller than unity even at maximum might indicate our luckiness of finding OB110462, which can be tested with future surveys by e.g. the Roman space telescope."],"url":"http://arxiv.org/abs/2405.07502v1","category":"astro-ph.GA"}
{"created":"2024-05-13 05:58:51","title":"The Energy Sources, the Physical Properties, and the Mass-loss History of SN 2017dio","abstract":"We study the energy sources, the physical properties of the ejecta and the circumstellar medium (CSM), as well as the mass-loss history of the progenitor of SN 2017dio which is a broad-lined Ic (Ic-BL) supernova (SN) having unusual light curves (LCs) and signatures of hydrogen-rich CSM in its early spectrum. We find that the temperature of SN 2017dio began to increase linearly about 20 days after the explosion. We use the $^{56}$Ni plus the ejecta-CSM interaction (CSI) model to fit the LCs of SN 2017dio, finding that the masses of the ejecta, the $^{56}$Ni, and the CSM are $\\sim$ 12.41 M$_\\odot$, $\\sim$ 0.17 M$_\\odot$, and $\\sim$ 5.82 M$_\\odot$, respectively. The early-time photosphere velocity and the kinetic energy of the SN are respectively {$\\sim$ 1.89 $\\times 10^4$ km s$^{-1}$} and $\\sim$ 2.66 $\\times 10^{52}$ erg, which are respectively comparable to those of SNe Ic-BL and hypernovae (HNe). We suggest that the CSM of SN 2017dio might be {from an luminous-blue-variable-like outburst or} pulsational pair instability $\\sim$ 1.2$-$11.4 yr prior to the SN explosion{, or binary mass transfer}. {Moreover,} we find that its ejecta mass is larger than those of many SNe Ic-BL, and that its $^{56}$Ni mass ($M_{\\rm Ni}$) is approximately equal to the mean (or median) value of $M_{\\rm Ni}$ of SNe Ic-BL in the literature, but lower than $M_{\\rm Ni}$ of prototype HNe (e.g., SN 1998bw and SN 2003dh).","sentences":["We study the energy sources, the physical properties of the ejecta and the circumstellar medium (CSM), as well as the mass-loss history of the progenitor of SN 2017dio which is a broad-lined Ic (Ic-BL) supernova (SN) having unusual light curves (LCs) and signatures of hydrogen-rich CSM in its early spectrum.","We find that the temperature of SN 2017dio began to increase linearly about 20 days after the explosion.","We use the $^{56}$Ni plus the ejecta-CSM interaction (CSI) model to fit the LCs of SN 2017dio, finding that the masses of the ejecta, the $^{56}$Ni, and the CSM are $\\sim$ 12.41 M$_\\odot$, $\\sim$ 0.17 M$_\\odot$, and $\\sim$ 5.82 M$_\\odot$, respectively.","The early-time photosphere velocity and the kinetic energy of the SN are respectively {$\\sim$ 1.89 $\\times 10^4$ km s$^{-1}$} and $\\sim$ 2.66 $\\times 10^{52}$ erg, which are respectively comparable to those of SNe Ic-BL and hypernovae (HNe).","We suggest that the CSM of SN 2017dio might be {from an luminous-blue-variable-like outburst or} pulsational pair instability","$\\sim$ 1.2$-$11.4","yr prior to the SN explosion{, or binary mass transfer}.","{Moreover,} we find that its ejecta mass is larger than those of many SNe Ic-BL, and that its $^{56}$Ni mass ($M_{\\rm Ni}$) is approximately equal to the mean (or median) value of $M_{\\rm Ni}$ of SNe Ic-BL in the literature, but lower than $M_{\\rm Ni}$ of prototype HNe (e.g., SN 1998bw and SN 2003dh)."],"url":"http://arxiv.org/abs/2405.07485v1","category":"astro-ph.HE"}
{"created":"2024-05-13 04:52:06","title":"New Models of $SU(6)$ Grand Gauge-Higgs Unification","abstract":"A five dimensional $SU(6)$ grand gauge-Higgs unification compactified on $S^1/Z_2$ is discussed. We propose new sets of the $SU(6)$ representations where the quarks and leptons in one generation are embedded and there is no extra massless exotic fermions absent in the Standard Model. The correct electroweak symmetry breaking pattern can be realized by introducing some adjoint fermions. We also analyze whether a viable Higgs mass can be obtained.","sentences":["A five dimensional $SU(6)$ grand gauge-Higgs unification compactified on $S^1/Z_2$ is discussed.","We propose new sets of the $SU(6)$ representations where the quarks and leptons in one generation are embedded and there is no extra massless exotic fermions absent in the Standard Model.","The correct electroweak symmetry breaking pattern can be realized by introducing some adjoint fermions.","We also analyze whether a viable Higgs mass can be obtained."],"url":"http://arxiv.org/abs/2405.07463v1","category":"hep-ph"}
{"created":"2024-05-13 03:11:48","title":"A Generic Model for Persistent Radio Source around Fast Radio Bursts","abstract":"The repeated fast radio burst FRB 121102A and FRB 190520B has been reported, along with a spatially coincident, compact, persistent radio emission. In this paper, we present a parameterized one-zone model, with a basic scenario that a relativistic magnetized wind from the pulsar sweeps up the surroundings, e.g. freely expanding supernova ejecta, giving rise to a power-law distribution of electron filled between the forward shock and the termination shock. We show that via appropriate adjustment of the model parameters, we can obtain the synchrotron radio emission properties from the one-zone model bright enough to account for observation, simply and analytically fitting the observed spectra well. Through dynamical evolution of the model, we can also obtain time-varying of relevant properties. This parameterized model does not depend on concrete physical models such as central engine, instead we can constraint physical model via comparison between parameters and observation, indicating the information about the central engine and surroundings. We also discuss the synchrotron self-Compton emission in our scenario in the end, but find no clue on the counterparts at other waveband.","sentences":["The repeated fast radio burst FRB 121102A and FRB 190520B has been reported, along with a spatially coincident, compact, persistent radio emission.","In this paper, we present a parameterized one-zone model, with a basic scenario that a relativistic magnetized wind from the pulsar sweeps up the surroundings, e.g. freely expanding supernova ejecta, giving rise to a power-law distribution of electron filled between the forward shock and the termination shock.","We show that via appropriate adjustment of the model parameters, we can obtain the synchrotron radio emission properties from the one-zone model bright enough to account for observation, simply and analytically fitting the observed spectra well.","Through dynamical evolution of the model, we can also obtain time-varying of relevant properties.","This parameterized model does not depend on concrete physical models such as central engine, instead we can constraint physical model via comparison between parameters and observation, indicating the information about the central engine and surroundings.","We also discuss the synchrotron self-Compton emission in our scenario in the end, but find no clue on the counterparts at other waveband."],"url":"http://arxiv.org/abs/2405.07446v1","category":"astro-ph.HE"}
{"created":"2024-05-13 03:01:05","title":"Minimum-Variance Recursive State Estimation for 2-D Systems: When Asynchronous Multi-Channel Delays meet Energy Harvesting Constraints","abstract":"This paper is concerned with the state estimation problem for two-dimensional systems with asynchronous multichannel delays and energy harvesting constraints. In the system, each smart sensor has a certain probability of harvesting energy from the external environment, the authorized transmission between the sensor and the remote filter is contingent upon the current energy level of the sensor, which results in intermittent transmission of observation information. Addressing the issue of incomplete observation information due to asynchronous multi-channel delays, a novel approach for observation partition reconstruction is proposed to convert the delayed activated observation sequences into equivalent delay-free activated observation sequences. Through generating spatial equivalency validation, it is found that the reconstructed delay-free activated observation sequences contain the same information as the original delayed activated observation sequences. Based on the reconstructed activated observation sequence and activated probability, a novel unbiased h+1-step recursive estimator is constructed. Then, the evolution of the probability distribution of the energy level is discussed. The estimation gains are obtained by minimizing the filtering error covariance. Subsequently, through parameter assumptions, a uniform lower bound and a recursive upper bound for the filtering error covariance are presented. And the monotonicity analysis of activated probability on estimation performance is given. Finally, the effectiveness of the proposed estimation scheme is verified through a numerical simulation example.","sentences":["This paper is concerned with the state estimation problem for two-dimensional systems with asynchronous multichannel delays and energy harvesting constraints.","In the system, each smart sensor has a certain probability of harvesting energy from the external environment, the authorized transmission between the sensor and the remote filter is contingent upon the current energy level of the sensor, which results in intermittent transmission of observation information.","Addressing the issue of incomplete observation information due to asynchronous multi-channel delays, a novel approach for observation partition reconstruction is proposed to convert the delayed activated observation sequences into equivalent delay-free activated observation sequences.","Through generating spatial equivalency validation, it is found that the reconstructed delay-free activated observation sequences contain the same information as the original delayed activated observation sequences.","Based on the reconstructed activated observation sequence and activated probability, a novel unbiased h+1-step recursive estimator is constructed.","Then, the evolution of the probability distribution of the energy level is discussed.","The estimation gains are obtained by minimizing the filtering error covariance.","Subsequently, through parameter assumptions, a uniform lower bound and a recursive upper bound for the filtering error covariance are presented.","And the monotonicity analysis of activated probability on estimation performance is given.","Finally, the effectiveness of the proposed estimation scheme is verified through a numerical simulation example."],"url":"http://arxiv.org/abs/2405.07443v1","category":"eess.SY"}
{"created":"2024-05-13 02:09:15","title":"Don't Chase Your Tail! Missing Key Aspects Augmentation in Textual Vulnerability Descriptions of Long-tail Software through Feature Inference","abstract":"Augmenting missing key aspects in Textual Vulnerability Descriptions (TVDs) for software with a large user base (referred to as non-long-tail software) has greatly advanced vulnerability analysis and software security research. However, these methods often overlook software instances that have a limited user base (referred to as long-tail software) due to limited TVDs, variations in software features, and domain-specific jargon, which hinders vulnerability analysis and software repairs. In this paper, we introduce a novel software feature inference framework designed to augment the missing key aspects of TVDs for long-tail software. Firstly, we tackle the issue of non-standard software names found in community-maintained vulnerability databases by cross-referencing government databases with Common Vulnerabilities and Exposures (CVEs). Next, we employ Large Language Models (LLMs) to generate the missing key aspects. However, the limited availability of historical TVDs restricts the variety of examples. To overcome this limitation, we utilize the Common Weakness Enumeration (CWE) to classify all TVDs and select cluster centers as representative examples. To ensure accuracy, we present Natural Language Inference (NLI) models specifically designed for long-tail software. These models identify and eliminate incorrect responses. Additionally, we use a wiki repository to provide explanations for proprietary terms. Our evaluations demonstrate that our approach significantly improves the accuracy of augmenting missing key aspects of TVDs for log-tail software from 0.27 to 0.56 (+107%). Interestingly, the accuracy of non-long-tail software also increases from 64% to 71%. As a result, our approach can be useful in various downstream tasks that require complete TVD information.","sentences":["Augmenting missing key aspects in Textual Vulnerability Descriptions (TVDs) for software with a large user base (referred to as non-long-tail software) has greatly advanced vulnerability analysis and software security research.","However, these methods often overlook software instances that have a limited user base (referred to as long-tail software) due to limited TVDs, variations in software features, and domain-specific jargon, which hinders vulnerability analysis and software repairs.","In this paper, we introduce a novel software feature inference framework designed to augment the missing key aspects of TVDs for long-tail software.","Firstly, we tackle the issue of non-standard software names found in community-maintained vulnerability databases by cross-referencing government databases with Common Vulnerabilities and Exposures (CVEs).","Next, we employ Large Language Models (LLMs) to generate the missing key aspects.","However, the limited availability of historical TVDs restricts the variety of examples.","To overcome this limitation, we utilize the Common Weakness Enumeration (CWE) to classify all TVDs and select cluster centers as representative examples.","To ensure accuracy, we present Natural Language Inference (NLI) models specifically designed for long-tail software.","These models identify and eliminate incorrect responses.","Additionally, we use a wiki repository to provide explanations for proprietary terms.","Our evaluations demonstrate that our approach significantly improves the accuracy of augmenting missing key aspects of TVDs for log-tail software from 0.27 to 0.56 (+107%).","Interestingly, the accuracy of non-long-tail software also increases from 64% to 71%.","As a result, our approach can be useful in various downstream tasks that require complete TVD information."],"url":"http://arxiv.org/abs/2405.07430v1","category":"cs.SE"}
{"created":"2024-05-13 01:57:24","title":"Multiple Bound States in the Continuum: Towards Intense Terahertz Matter Interaction","abstract":"Bound states in the continuum (BICs) are an excellent platform enabling highly efficient light-matter interaction in applications for lasing, nonlinear generation, and sensing. However, the current focus in implementing BICs has primarily been on single sharp resonances, limiting the extent of electric field enhancement for multiple resonances. In this study, we conducted experimental demonstrations to showcase how metasurfaces can enable the control of symmetry-broken and Friedrich-Wintgen BICs by leveraging the asymmetry of split resonant rings. This approach allows for the existence of multiple free-control BIC resonances and tailored enhancement of controlling light-matter interactions. We have conducted further experiments to validate the effectiveness and performance of our approach for identification of the distinct fingerprint of {\\alpha}-lactose with high sensitivity using only one single metasurface. These findings present a novel and efficient platform for the development of miniaturized and chip-scale photonics devices with intense light-matter interaction.","sentences":["Bound states in the continuum (BICs) are an excellent platform enabling highly efficient light-matter interaction in applications for lasing, nonlinear generation, and sensing.","However, the current focus in implementing BICs has primarily been on single sharp resonances, limiting the extent of electric field enhancement for multiple resonances.","In this study, we conducted experimental demonstrations to showcase how metasurfaces can enable the control of symmetry-broken and Friedrich-Wintgen BICs by leveraging the asymmetry of split resonant rings.","This approach allows for the existence of multiple free-control BIC resonances and tailored enhancement of controlling light-matter interactions.","We have conducted further experiments to validate the effectiveness and performance of our approach for identification of the distinct fingerprint of {\\alpha}-lactose with high sensitivity using only one single metasurface.","These findings present a novel and efficient platform for the development of miniaturized and chip-scale photonics devices with intense light-matter interaction."],"url":"http://arxiv.org/abs/2405.07426v1","category":"physics.optics"}
{"created":"2024-05-13 01:39:25","title":"Robust Inference for High-Dimensional Panel Data Models","abstract":"In this paper, we propose a robust estimation and inferential method for high-dimensional panel data models. Specifically, (1) we investigate the case where the number of regressors can grow faster than the sample size, (2) we pay particular attention to non-Gaussian, serially and cross-sectionally correlated and heteroskedastic error processes, and (3) we develop an estimation method for high-dimensional long-run covariance matrix using a thresholded estimator.   Methodologically and technically, we develop two Nagaev-types of concentration inequalities: one for a partial sum and the other for a quadratic form, subject to a set of easily verifiable conditions. Leveraging these two inequalities, we also derive a non-asymptotic bound for the LASSO estimator, achieve asymptotic normality via the node-wise LASSO regression, and establish a sharp convergence rate for the thresholded heteroskedasticity and autocorrelation consistent (HAC) estimator.   Our study thus provides the relevant literature with a complete toolkit for conducting inference about the parameters of interest involved in a high-dimensional panel data framework. We also demonstrate the practical relevance of these theoretical results by investigating a high-dimensional panel data model with interactive fixed effects. Moreover, we conduct extensive numerical studies using simulated and real data examples.","sentences":["In this paper, we propose a robust estimation and inferential method for high-dimensional panel data models.","Specifically, (1) we investigate the case where the number of regressors can grow faster than the sample size, (2) we pay particular attention to non-Gaussian, serially and cross-sectionally correlated and heteroskedastic error processes, and (3) we develop an estimation method for high-dimensional long-run covariance matrix using a thresholded estimator.   ","Methodologically and technically, we develop two Nagaev-types of concentration inequalities: one for a partial sum and the other for a quadratic form, subject to a set of easily verifiable conditions.","Leveraging these two inequalities, we also derive a non-asymptotic bound for the LASSO estimator, achieve asymptotic normality via the node-wise LASSO regression, and establish a sharp convergence rate for the thresholded heteroskedasticity and autocorrelation consistent (HAC) estimator.   ","Our study thus provides the relevant literature with a complete toolkit for conducting inference about the parameters of interest involved in a high-dimensional panel data framework.","We also demonstrate the practical relevance of these theoretical results by investigating a high-dimensional panel data model with interactive fixed effects.","Moreover, we conduct extensive numerical studies using simulated and real data examples."],"url":"http://arxiv.org/abs/2405.07420v1","category":"econ.EM"}
{"created":"2024-05-13 00:01:02","title":"Gravitational influence of Saturn's rings on its moons","abstract":"Exploratory missions have found that regolith on interplanetary bodies can be loosely packed and freely flowing, a state that strongly affects mission plans and that may also influence the large scale shapes of these bodies. We investigate whether notable circumferential ridges seen on Saturn's moons may be a byproduct of free flow of loosely packed regolith. Such ridges and other features likely record the history of the moons, and we find that if surface grains are freely flowing, then the combined gravity of Saturn itself and its tenuous ring generate similar circumferential features. Moreover, analysis of these features reveals the possibility of previously unreported morphologies, for example a stationary torus around a non rotating satellite. Some of these features persist even for a very low density and distant disk. This raises the prospect that nonlinear analysis of interactions from disks to moons and back again may lead to new insights.","sentences":["Exploratory missions have found that regolith on interplanetary bodies can be loosely packed and freely flowing, a state that strongly affects mission plans and that may also influence the large scale shapes of these bodies.","We investigate whether notable circumferential ridges seen on Saturn's moons may be a byproduct of free flow of loosely packed regolith.","Such ridges and other features likely record the history of the moons, and we find that if surface grains are freely flowing, then the combined gravity of Saturn itself and its tenuous ring generate similar circumferential features.","Moreover, analysis of these features reveals the possibility of previously unreported morphologies, for example a stationary torus around a non rotating satellite.","Some of these features persist even for a very low density and distant disk.","This raises the prospect that nonlinear analysis of interactions from disks to moons and back again may lead to new insights."],"url":"http://arxiv.org/abs/2405.07401v1","category":"astro-ph.EP"}
{"created":"2024-05-12 22:03:55","title":"All-multiplicity amplitudes in impulsive PP-waves from the worldline formalism","abstract":"We use the worldline formalism to derive Bern-Kosower type Master Formulae for the tree-level scattering of a charged particle and an arbitrary number of photons on impulsive PP-waves, where the coupling of the PP-wave to matter is treated fully non-perturbatively. We show that, in a certain kinematic regime characterised by a semi-classical positive energy condition, both off-shell currents and scattering amplitudes exhibit two novel factorisation structures. First, they may be written as currents in vacuum but with a single additional photon, averaged over the momentum of that photon. This converts the all-orders interaction with the PP-wave into a single effective interaction. Second, the currents and amplitudes may be written as a weighted average of the corresponding quantities in an impulsive plane wave background, with the average taken over all possible field strengths of the plane wave. This generalises a known single-photon result to arbitrary multiplicity.","sentences":["We use the worldline formalism to derive Bern-Kosower type Master Formulae for the tree-level scattering of a charged particle and an arbitrary number of photons on impulsive PP-waves, where the coupling of the PP-wave to matter is treated fully non-perturbatively.","We show that, in a certain kinematic regime characterised by a semi-classical positive energy condition, both off-shell currents and scattering amplitudes exhibit two novel factorisation structures.","First, they may be written as currents in vacuum but with a single additional photon, averaged over the momentum of that photon.","This converts the all-orders interaction with the PP-wave into a single effective interaction.","Second, the currents and amplitudes may be written as a weighted average of the corresponding quantities in an impulsive plane wave background, with the average taken over all possible field strengths of the plane wave.","This generalises a known single-photon result to arbitrary multiplicity."],"url":"http://arxiv.org/abs/2405.07385v1","category":"hep-th"}
{"created":"2024-05-12 21:59:14","title":"Acoustic Bound States in the Continuum and Exceptional Points in Coupled Helmholtz Resonators","abstract":"Resonant states underlie a variety of metastructures that exhibit remarkable capabilities for effective control of acoustic waves at subwavelength scales. The development of metamaterials relies on the rigorous mode engineering providing the implementation of the desired properties. At the same time, the application of metamaterials is still limited as their building blocks are frequently characterized by complicated geometry and can't be tuned easily. In this work, we consider a simple system of coupled Helmholtz resonators and study their properties associated with the tuning of coupling strength and symmetry breaking. We numerically and experimentally demonstrate the excitation of quasi-bound state in the continuum in the resonators placed in a free space and in a rectangular cavity. It is also shown that tuning the intrinsic losses via introducing porous inserts can lead to spectral splitting or merging of quasi-bound states in the continuum and occurrence of exceptional points. The obtained results will open new opportunities for the development of simple and easy-tunable metastructures based on Helmholtz resonances.","sentences":["Resonant states underlie a variety of metastructures that exhibit remarkable capabilities for effective control of acoustic waves at subwavelength scales.","The development of metamaterials relies on the rigorous mode engineering providing the implementation of the desired properties.","At the same time, the application of metamaterials is still limited as their building blocks are frequently characterized by complicated geometry and can't be tuned easily.","In this work, we consider a simple system of coupled Helmholtz resonators and study their properties associated with the tuning of coupling strength and symmetry breaking.","We numerically and experimentally demonstrate the excitation of quasi-bound state in the continuum in the resonators placed in a free space and in a rectangular cavity.","It is also shown that tuning the intrinsic losses via introducing porous inserts can lead to spectral splitting or merging of quasi-bound states in the continuum and occurrence of exceptional points.","The obtained results will open new opportunities for the development of simple and easy-tunable metastructures based on Helmholtz resonances."],"url":"http://arxiv.org/abs/2405.07383v1","category":"physics.app-ph"}
{"created":"2024-05-12 18:45:36","title":"Effect of annealed disorder on the plasticity of amorphous solids","abstract":"We investigate the effect of annealed disorder on the mechanical properties and plasticity of a modeled amorphous solid by introducing a small fraction of heavy impurities into the material which resembles real experimental systems. The disorder being mobile, the total degrees of freedom and the potential energy landscape of the pure system are preserved in our model. The mechanical failure and the shear band formation in the amorphous solid in the presence of annealed disorder are studied at the microscopic level by employing the finite shear deformation protocol at nonzero temperature. A significant enhancement in the shear modulus and yield stress is observed as a function of the heaviness of the impurity particles. Via the analysis of the non-affine displacement field and the microscopic strain fluctuations and the nature of their spatial correlations we find that the shear band formation in the plastic regime is gradually suppressed with increasing impurity mass. Eventually, a critical mass of the disordered particles is identified above which the plastic events become completely localized. This is marked by a transition from a power law to an exponential decay in the spatial correlations non-affine displacement field. Likewise, a similar change is observed in the strain correlation function, transitioning from a slower $1/r$ decay to a more rapid $1/r^3$ decay. Finally, the effect shear rate on the plastic events in the presence of annealed disorder is explored.","sentences":["We investigate the effect of annealed disorder on the mechanical properties and plasticity of a modeled amorphous solid by introducing a small fraction of heavy impurities into the material which resembles real experimental systems.","The disorder being mobile, the total degrees of freedom and the potential energy landscape of the pure system are preserved in our model.","The mechanical failure and the shear band formation in the amorphous solid in the presence of annealed disorder are studied at the microscopic level by employing the finite shear deformation protocol at nonzero temperature.","A significant enhancement in the shear modulus and yield stress is observed as a function of the heaviness of the impurity particles.","Via the analysis of the non-affine displacement field and the microscopic strain fluctuations and the nature of their spatial correlations we find that the shear band formation in the plastic regime is gradually suppressed with increasing impurity mass.","Eventually, a critical mass of the disordered particles is identified above which the plastic events become completely localized.","This is marked by a transition from a power law to an exponential decay in the spatial correlations non-affine displacement field.","Likewise, a similar change is observed in the strain correlation function, transitioning from a slower $1/r$ decay to a more rapid $1/r^3$ decay.","Finally, the effect shear rate on the plastic events in the presence of annealed disorder is explored."],"url":"http://arxiv.org/abs/2405.07360v1","category":"cond-mat.soft"}
{"created":"2024-05-12 18:35:24","title":"On thermally driven fluid flows arising in astrophysics","abstract":"We consider the Navier-Stokes-Fourier-Poisson system driven by an inhomogeneous temperature distribution on the boundary of an exterior fluid domain. We impose the finite mass constraint, positive far field condition for the temperature as well as the no--slip boundary conditions for the velocity. The existence of global--in--time weak solutions and the weak-strong principle are proved.","sentences":["We consider the Navier-Stokes-Fourier-Poisson system driven by an inhomogeneous temperature distribution on the boundary of an exterior fluid domain.","We impose the finite mass constraint, positive far field condition for the temperature as well as the no--slip boundary conditions for the velocity.","The existence of global--in--time weak solutions and the weak-strong principle are proved."],"url":"http://arxiv.org/abs/2405.07355v1","category":"math.AP"}
{"created":"2024-05-12 17:30:30","title":"An IR Fixed Point in QCD with a Dilaton in Nuclear Dynamics","abstract":"The possible consequence of an IR fixed point in QCD for $N_f=2, 3$ in nuclear matter is discussed. It is shown in terms of d(ilaton)-$\\chi$ effective field theory (d$\\chi$EFT) incorporated in a generalized effective field theory (G$n$EFT) implemented with hidden local symmetry and hidden scale symmetry that the recently measured superallowed Gamow-Teller transition in the doubly-magic-shell nucleus $^{100}$Sn indicates a surprisingly large anomaly-induced quenching (AIQ) of $g_A$ from the free-space value of 1.276 to $\\approx 0.8 $. Combined with the quenching expected from strong nuclear correlations, the effective coupling in nuclei, $g_A^{\\rm eff}$ would come to $\\sim 0.6$. If this result were reconfirmed, it would impact not only nuclear structure and dense compact-star matter -- where $g_A$ figures in $\\pi$-N coupling via the Goldberger-Treiman relation -- but also in search for physics Beyond the Standard Model (BSM), e.g. $0\\nu\\beta\\beta$ decay, where 4th power of $g_A$ figures.","sentences":["The possible consequence of an IR fixed point in QCD for $N_f=2, 3$ in nuclear matter is discussed.","It is shown in terms of d(ilaton)-$\\chi$ effective field theory (d$\\chi$EFT) incorporated in a generalized effective field theory (G$n$EFT) implemented with hidden local symmetry and hidden scale symmetry that the recently measured superallowed Gamow-Teller transition in the doubly-magic-shell nucleus $^{100}$Sn indicates a surprisingly large anomaly-induced quenching (AIQ) of $g_A$ from the free-space value of 1.276 to $\\approx 0.8 $.","Combined with the quenching expected from strong nuclear correlations, the effective coupling in nuclei, $g_A^{\\rm eff}$ would come to $\\sim 0.6$.","If this result were reconfirmed, it would impact not only nuclear structure and dense compact-star matter -- where $g_A$ figures in $\\pi$-N coupling via the Goldberger-Treiman relation -- but also in search for physics Beyond the Standard Model (BSM), e.g. $0\\nu\\beta\\beta$ decay, where 4th power of $g_A$ figures."],"url":"http://arxiv.org/abs/2405.07339v1","category":"nucl-th"}
{"created":"2024-05-12 17:19:17","title":"The Rank-Ramsey Problem and the Log-Rank Conjecture","abstract":"A graph is called Rank-Ramsey if (i) Its clique number is small, and (ii) The adjacency matrix of its complement has small rank. We initiate a systematic study of such graphs. Our main motivation is that their constructions, as well as proofs of their non-existence, are intimately related to the famous log-rank conjecture from the field of communication complexity. These investigations also open interesting new avenues in Ramsey theory.   We construct two families of Rank-Ramsey graphs exhibiting polynomial separation between order and complement rank. Graphs in the first family have bounded clique number (as low as $41$). These are subgraphs of certain strong products, whose building blocks are derived from triangle-free strongly-regular graphs. Graphs in the second family are obtained by applying Boolean functions to Erd\\H{o}s-R\\'enyi graphs. Their clique number is logarithmic, but their complement rank is far smaller than in the first family, about $\\mathcal{O}(n^{2/3})$. A key component of this construction is our matrix-theoretic view of lifts.   We also consider lower bounds on the Rank-Ramsey numbers, and determine them in the range where the complement rank is $5$ or less. We consider connections between said numbers and other graph parameters, and find that the two best known explicit constructions of triangle-free Ramsey graphs turn out to be far from Rank-Ramsey.","sentences":["A graph is called Rank-Ramsey if (i) Its clique number is small, and (ii) The adjacency matrix of its complement has small rank.","We initiate a systematic study of such graphs.","Our main motivation is that their constructions, as well as proofs of their non-existence, are intimately related to the famous log-rank conjecture from the field of communication complexity.","These investigations also open interesting new avenues in Ramsey theory.   ","We construct two families of Rank-Ramsey graphs exhibiting polynomial separation between order and complement rank.","Graphs in the first family have bounded clique number (as low as $41$).","These are subgraphs of certain strong products, whose building blocks are derived from triangle-free strongly-regular graphs.","Graphs in the second family are obtained by applying Boolean functions to Erd\\H{o}s-R\\'enyi graphs.","Their clique number is logarithmic, but their complement rank is far smaller than in the first family, about $\\mathcal{O}(n^{2/3})$. A key component of this construction is our matrix-theoretic view of lifts.   ","We also consider lower bounds on the Rank-Ramsey numbers, and determine them in the range where the complement rank is $5$ or less.","We consider connections between said numbers and other graph parameters, and find that the two best known explicit constructions of triangle-free Ramsey graphs turn out to be far from Rank-Ramsey."],"url":"http://arxiv.org/abs/2405.07337v1","category":"math.CO"}
{"created":"2024-05-12 16:49:25","title":"Simulating Heavy Neutral Leptons with General Couplings at Collider and Fixed Target Experiments","abstract":"Heavy neutral leptons (HNLs) are motivated by attempts to explain neutrino masses and dark matter. If their masses are in the MeV to several GeV range, HNLs are light enough to be copiously produced at collider and accelerator facilities, but also heavy enough to decay to visible particles on length scales that can be observed in particle detectors. Previous studies evaluating the sensitivities of experiments have often focused on simple, but not particularly well-motivated, models in which the HNL mixes with only one active neutrino flavor. In this work, we accurately simulate models for HNL masses between 100 MeV and 10 GeV and arbitrary couplings to $e$, $\\mu$, and $\\tau$ leptons. We include over 150 HNL production channels and over 100 HNL decay modes, including all of the processes that can be dominant in some region of the general parameter space. The result is HNLCalc, a user-friendly, fast, and flexible library to compute the properties of HNL models. As examples, we implement HNLCalc to extend the FORESEE package to evaluate the prospects for HNL discovery at forward LHC experiments. We present sensitivity reaches for FASER and FASER2 in five benchmark scenarios with coupling ratios $|U_e|^2 : |U_\\mu|^2 : |U_{\\tau}|^2$ = 1:0:0, 0:1:0, 0:0:1, 0:1:1, and 1:1:1, where the latter two have not been studied previously. Comparing these to current constraints, we identify regions of parameter space with significant discovery prospects.","sentences":["Heavy neutral leptons (HNLs) are motivated by attempts to explain neutrino masses and dark matter.","If their masses are in the MeV to several GeV range, HNLs are light enough to be copiously produced at collider and accelerator facilities, but also heavy enough to decay to visible particles on length scales that can be observed in particle detectors.","Previous studies evaluating the sensitivities of experiments have often focused on simple, but not particularly well-motivated, models in which the HNL mixes with only one active neutrino flavor.","In this work, we accurately simulate models for HNL masses between 100 MeV and 10 GeV and arbitrary couplings to $e$, $\\mu$, and $\\tau$ leptons.","We include over 150 HNL production channels and over 100 HNL decay modes, including all of the processes that can be dominant in some region of the general parameter space.","The result is HNLCalc, a user-friendly, fast, and flexible library to compute the properties of HNL models.","As examples, we implement HNLCalc to extend the FORESEE package to evaluate the prospects for HNL discovery at forward LHC experiments.","We present sensitivity reaches for FASER and FASER2 in five benchmark scenarios with coupling ratios $|U_e|^2 : |U_\\mu|^2 : |U_{\\tau}|^2$ = 1:0:0, 0:1:0, 0:0:1, 0:1:1, and 1:1:1, where the latter two have not been studied previously.","Comparing these to current constraints, we identify regions of parameter space with significant discovery prospects."],"url":"http://arxiv.org/abs/2405.07330v1","category":"hep-ph"}
