{"created":"2024-05-09 16:49:09","title":"On the construction of a family of well-posed approximate formulations for the stationary Stokes problem using an extended system","abstract":"We introduce an exact parameterized extended system such that, under adequate data, between the components of its solution, there is the solution of the weak formulation of the homogeneous Dirichlet problem for the stationary Stokes equations. In the extended system, we introduce the momentum equation together with two other forms of this one. This allows us to reformulate, for the stationary case, the consistent pressure Poisson equation of Sani, Shen, Pironneau, Gresho [\\textit{Int. J. Numer. Meth. Fluids}, \\textbf{50} (2006), pp. 673-682], from the unsteady case. In this way, we can retain the information we need for the approximate pressure on the boundary. We obtain a parameterized perturbed pressure Poisson equation for the stationary Stokes problem. We prove that to solve the stationary Stokes problem is equivalent to solve a problem for the momentum equation, the parameterized equation and the equation that defines the Laplace operator acting on velocity. The approximation of this last problem give a family of well - posed approximate formulations. The solution of each element of this family approximates the solution of the stationary Stokes problem. Some necessary variants of existing results on general Banach spaces are also developed. These concern the density of subspaces related to isomorphisms and the connection between the exact and the approximate problems. First, the well - posedness of the exact extended system is proved in some dense subspaces. The well posed approximate problem does not necessitate the discrete inf-sup condition. The paper is also related to the existing discussions on the boundary conditions for the pressure and on the imposing of the incompressibility constraint on the boundary.","sentences":["We introduce an exact parameterized extended system such that, under adequate data, between the components of its solution, there is the solution of the weak formulation of the homogeneous Dirichlet problem for the stationary Stokes equations.","In the extended system, we introduce the momentum equation together with two other forms of this one.","This allows us to reformulate, for the stationary case, the consistent pressure Poisson equation of Sani, Shen, Pironneau, Gresho [\\textit{Int.","J. Numer.","Meth.","Fluids}, \\textbf{50} (2006), pp.","673-682], from the unsteady case.","In this way, we can retain the information we need for the approximate pressure on the boundary.","We obtain a parameterized perturbed pressure Poisson equation for the stationary Stokes problem.","We prove that to solve the stationary Stokes problem is equivalent to solve a problem for the momentum equation, the parameterized equation and the equation that defines the Laplace operator acting on velocity.","The approximation of this last problem give a family of well - posed approximate formulations.","The solution of each element of this family approximates the solution of the stationary Stokes problem.","Some necessary variants of existing results on general Banach spaces are also developed.","These concern the density of subspaces related to isomorphisms and the connection between the exact and the approximate problems.","First, the well - posedness of the exact extended system is proved in some dense subspaces.","The well posed approximate problem does not necessitate the discrete inf-sup condition.","The paper is also related to the existing discussions on the boundary conditions for the pressure and on the imposing of the incompressibility constraint on the boundary."],"url":"http://arxiv.org/abs/2405.05898v1","category":"math.NA"}
