{"created":"2024-01-18 18:57:10","title":"Enabling Efficient Equivariant Operations in the Fourier Basis via Gaunt Tensor Products","abstract":"Developing equivariant neural networks for the E(3) group plays an important role in modeling 3D data across real-world applications. Enforcing this equivariance primarily involves the tensor products of irreducible representations (irreps). However, the computational complexity of such operations increases significantly as higher-order tensors are used. In this work, we propose a systematic approach to substantially accelerate the computation of the tensor products of irreps. We mathematically connect the commonly used Clebsch-Gordan coefficients to the Gaunt coefficients, which are integrals of products of three spherical harmonics. Through Gaunt coefficients, the tensor product of irreps becomes equivalent to the multiplication between spherical functions represented by spherical harmonics. This perspective further allows us to change the basis for the equivariant operations from spherical harmonics to a 2D Fourier basis. Consequently, the multiplication between spherical functions represented by a 2D Fourier basis can be efficiently computed via the convolution theorem and Fast Fourier Transforms. This transformation reduces the complexity of full tensor products of irreps from $\\mathcal{O}(L^6)$ to $\\mathcal{O}(L^3)$, where $L$ is the max degree of irreps. Leveraging this approach, we introduce the Gaunt Tensor Product, which serves as a new method to construct efficient equivariant operations across different model architectures. Our experiments on the Open Catalyst Project and 3BPA datasets demonstrate both the increased efficiency and improved performance of our approach.","sentences":["Developing equivariant neural networks for the E(3) group plays an important role in modeling 3D data across real-world applications.","Enforcing this equivariance primarily involves the tensor products of irreducible representations (irreps).","However, the computational complexity of such operations increases significantly as higher-order tensors are used.","In this work, we propose a systematic approach to substantially accelerate the computation of the tensor products of irreps.","We mathematically connect the commonly used Clebsch-Gordan coefficients to the Gaunt coefficients, which are integrals of products of three spherical harmonics.","Through Gaunt coefficients, the tensor product of irreps becomes equivalent to the multiplication between spherical functions represented by spherical harmonics.","This perspective further allows us to change the basis for the equivariant operations from spherical harmonics to a 2D Fourier basis.","Consequently, the multiplication between spherical functions represented by a 2D Fourier basis can be efficiently computed via the convolution theorem and Fast Fourier Transforms.","This transformation reduces the complexity of full tensor products of irreps from $\\mathcal{O}(L^6)$ to $\\mathcal{O}(L^3)$, where $L$ is the max degree of irreps.","Leveraging this approach, we introduce the Gaunt Tensor Product, which serves as a new method to construct efficient equivariant operations across different model architectures.","Our experiments on the Open Catalyst Project and 3BPA datasets demonstrate both the increased efficiency and improved performance of our approach."],"url":"http://arxiv.org/abs/2401.10216v1","category":"cs.LG"}
{"created":"2024-01-18 18:55:06","title":"Non-perturbative Wavefunction of the Universe in Inflation with (Resonant) Features","abstract":"We study the statistics of scalar perturbations in models of inflation with small and rapid oscillations in the inflaton potential (resonant non-Gaussianity). We do so by deriving the wavefunction $\\Psi[\\zeta(\\boldsymbol{x})]$ non-perturbatively in $\\zeta$, but at first order in the amplitude of the oscillations. The expression of the wavefunction of the universe (WFU) is explicit and does not require solving partial differential equations. One finds qualitative deviations from perturbation theory for $ |\\zeta| \\gtrsim \\alpha^{-2}$, where $\\alpha \\gg 1$ is the number of oscillations per Hubble time. Notably, the WFU exhibits distinct behaviours for negative and positive values of $\\zeta$ (troughs and peaks respectively). While corrections for $\\zeta <0$ remain relatively small, of the order of the oscillation amplitude, positive $\\zeta$ yields substantial effects, growing exponentially as $e^{\\pi\\alpha/2}$ in the limit of large $\\zeta$. This indicates that even minute oscillations give large effects on the tail of the distribution.","sentences":["We study the statistics of scalar perturbations in models of inflation with small and rapid oscillations in the inflaton potential (resonant non-Gaussianity).","We do so by deriving the wavefunction $\\Psi[\\zeta(\\boldsymbol{x})]$ non-perturbatively in $\\zeta$, but at first order in the amplitude of the oscillations.","The expression of the wavefunction of the universe (WFU) is explicit and does not require solving partial differential equations.","One finds qualitative deviations from perturbation theory for $ |\\zeta| \\gtrsim \\alpha^{-2}$, where $\\alpha \\gg 1$ is the number of oscillations per Hubble time.","Notably, the WFU exhibits distinct behaviours for negative and positive values of $\\zeta$ (troughs and peaks respectively).","While corrections for $\\zeta <0$ remain relatively small, of the order of the oscillation amplitude, positive $\\zeta$ yields substantial effects, growing exponentially as $e^{\\pi\\alpha/2}$ in the limit of large $\\zeta$. This indicates that even minute oscillations give large effects on the tail of the distribution."],"url":"http://arxiv.org/abs/2401.10212v1","category":"hep-th"}
{"created":"2024-01-18 18:42:28","title":"Quantum State Obfuscation from Classical Oracles","abstract":"A major unresolved question in quantum cryptography is whether it is possible to obfuscate arbitrary quantum computation. Indeed, there is much yet to understand about the feasibility of quantum obfuscation even in the classical oracle model, where one is given for free the ability to obfuscate any classical circuit.   In this work, we develop a new array of techniques that we use to construct a quantum state obfuscator, a powerful notion formalized recently by Coladangelo and Gunn (arXiv:2311.07794) in their pursuit of better software copy-protection schemes. Quantum state obfuscation refers to the task of compiling a quantum program, consisting of a quantum circuit $C$ with a classical description and an auxiliary quantum state $\\ket{\\psi}$, into a functionally-equivalent obfuscated quantum program that hides as much as possible about $C$ and $\\ket{\\psi}$. We prove the security of our obfuscator when applied to any pseudo-deterministic quantum program, i.e. one that computes a (nearly) deterministic classical input / classical output functionality. Our security proof is with respect to an efficient classical oracle, which may be heuristically instantiated using quantum-secure indistinguishability obfuscation for classical circuits.   Our result improves upon the recent work of Bartusek, Kitagawa, Nishimaki and Yamakawa (STOC 2023) who also showed how to obfuscate pseudo-deterministic quantum circuits in the classical oracle model, but only ones with a completely classical description. Furthermore, our result answers a question of Coladangelo and Gunn, who provide a construction of quantum state indistinguishability obfuscation with respect to a quantum oracle. Indeed, our quantum state obfuscator together with Coladangelo-Gunn gives the first candidate realization of a ``best-possible'' copy-protection scheme for all polynomial-time functionalities.","sentences":["A major unresolved question in quantum cryptography is whether it is possible to obfuscate arbitrary quantum computation.","Indeed, there is much yet to understand about the feasibility of quantum obfuscation even in the classical oracle model, where one is given for free the ability to obfuscate any classical circuit.   ","In this work, we develop a new array of techniques that we use to construct a quantum state obfuscator, a powerful notion formalized recently by Coladangelo and Gunn (arXiv:2311.07794) in their pursuit of better software copy-protection schemes.","Quantum state obfuscation refers to the task of compiling a quantum program, consisting of a quantum circuit $C$ with a classical description and an auxiliary quantum state $\\ket{\\psi}$, into a functionally-equivalent obfuscated quantum program that hides as much as possible about $C$ and $\\ket{\\psi}$. We prove the security of our obfuscator when applied to any pseudo-deterministic quantum program, i.e. one that computes a (nearly) deterministic classical input / classical output functionality.","Our security proof is with respect to an efficient classical oracle, which may be heuristically instantiated using quantum-secure indistinguishability obfuscation for classical circuits.   ","Our result improves upon the recent work of Bartusek, Kitagawa, Nishimaki and Yamakawa (STOC 2023) who also showed how to obfuscate pseudo-deterministic quantum circuits in the classical oracle model, but only ones with a completely classical description.","Furthermore, our result answers a question of Coladangelo and Gunn, who provide a construction of quantum state indistinguishability obfuscation with respect to a quantum oracle.","Indeed, our quantum state obfuscator together with Coladangelo-Gunn gives the first candidate realization of a ``best-possible'' copy-protection scheme for all polynomial-time functionalities."],"url":"http://arxiv.org/abs/2401.10200v1","category":"quant-ph"}
{"created":"2024-01-18 18:35:32","title":"Perfect pulsed inline twin-beam squeezers","abstract":"Perfect inline squeezers are both spectrally pure and have identical input and output temporal modes, allowing one to squeeze an arbitrary input quantum state in the sole input mode on which the device acts, while the quantum states of any other modes are unaffected. We study theoretically how to obtain a perfect pulsed inline squeezer in twin-beam systems by considering three commonly used configurations: unpoled single pass, poled single pass, and poled double pass. By obtaining analytical relations between the input and output temporal modes from the Bloch-Messiah decomposition of the discretized Heisenberg-picture propagator, we find that a double pass structure produces a perfect pulsed inline squeezer when operated in a frequency degenerate, symmetric group-velocity matched type-II configuration.","sentences":["Perfect inline squeezers are both spectrally pure and have identical input and output temporal modes, allowing one to squeeze an arbitrary input quantum state in the sole input mode on which the device acts, while the quantum states of any other modes are unaffected.","We study theoretically how to obtain a perfect pulsed inline squeezer in twin-beam systems by considering three commonly used configurations: unpoled single pass, poled single pass, and poled double pass.","By obtaining analytical relations between the input and output temporal modes from the Bloch-Messiah decomposition of the discretized Heisenberg-picture propagator, we find that a double pass structure produces a perfect pulsed inline squeezer when operated in a frequency degenerate, symmetric group-velocity matched type-II configuration."],"url":"http://arxiv.org/abs/2401.10197v1","category":"quant-ph"}
{"created":"2024-01-18 18:25:29","title":"Divide and not forget: Ensemble of selectively trained experts in Continual Learning","abstract":"Class-incremental learning is becoming more popular as it helps models widen their applicability while not forgetting what they already know. A trend in this area is to use a mixture-of-expert technique, where different models work together to solve the task. However, the experts are usually trained all at once using whole task data, which makes them all prone to forgetting and increasing computational burden. To address this limitation, we introduce a novel approach named SEED. SEED selects only one, the most optimal expert for a considered task, and uses data from this task to fine-tune only this expert. For this purpose, each expert represents each class with a Gaussian distribution, and the optimal expert is selected based on the similarity of those distributions. Consequently, SEED increases diversity and heterogeneity within the experts while maintaining the high stability of this ensemble method. The extensive experiments demonstrate that SEED achieves state-of-the-art performance in exemplar-free settings across various scenarios, showing the potential of expert diversification through data in continual learning.","sentences":["Class-incremental learning is becoming more popular as it helps models widen their applicability while not forgetting what they already know.","A trend in this area is to use a mixture-of-expert technique, where different models work together to solve the task.","However, the experts are usually trained all at once using whole task data, which makes them all prone to forgetting and increasing computational burden.","To address this limitation, we introduce a novel approach named SEED.","SEED selects only one, the most optimal expert for a considered task, and uses data from this task to fine-tune only this expert.","For this purpose, each expert represents each class with a Gaussian distribution, and the optimal expert is selected based on the similarity of those distributions.","Consequently, SEED increases diversity and heterogeneity within the experts while maintaining the high stability of this ensemble method.","The extensive experiments demonstrate that SEED achieves state-of-the-art performance in exemplar-free settings across various scenarios, showing the potential of expert diversification through data in continual learning."],"url":"http://arxiv.org/abs/2401.10191v1","category":"cs.LG"}
{"created":"2024-01-18 18:23:10","title":"A Kaczmarz-inspired approach to accelerate the optimization of neural network wavefunctions","abstract":"Neural network wavefunctions optimized using the variational Monte Carlo method have been shown to produce highly accurate results for the electronic structure of atoms and small molecules, but the high cost of optimizing such wavefunctions prevents their application to larger systems. We propose the Subsampled Projected-Increment Natural Gradient Descent (SPRING) optimizer to reduce this bottleneck. SPRING combines ideas from the recently introduced minimum-step stochastic reconfiguration optimizer (MinSR) and the classical randomized Kaczmarz method for solving linear least-squares problems. We demonstrate that SPRING outperforms both MinSR and the popular Kronecker-Factored Approximate Curvature method (KFAC) across a number of small atoms and molecules, given that the learning rates of all methods are optimally tuned. For example, on the oxygen atom, SPRING attains chemical accuracy after forty thousand training iterations, whereas both MinSR and KFAC fail to do so even after one hundred thousand iterations.","sentences":["Neural network wavefunctions optimized using the variational Monte Carlo method have been shown to produce highly accurate results for the electronic structure of atoms and small molecules, but the high cost of optimizing such wavefunctions prevents their application to larger systems.","We propose the Subsampled Projected-Increment Natural Gradient Descent (SPRING) optimizer to reduce this bottleneck.","SPRING combines ideas from the recently introduced minimum-step stochastic reconfiguration optimizer (MinSR) and the classical randomized Kaczmarz method for solving linear least-squares problems.","We demonstrate that SPRING outperforms both MinSR and the popular Kronecker-Factored Approximate Curvature method (KFAC) across a number of small atoms and molecules, given that the learning rates of all methods are optimally tuned.","For example, on the oxygen atom, SPRING attains chemical accuracy after forty thousand training iterations, whereas both MinSR and KFAC fail to do so even after one hundred thousand iterations."],"url":"http://arxiv.org/abs/2401.10190v1","category":"physics.comp-ph"}
{"created":"2024-01-18 18:12:35","title":"Transfer Learning in Human Activity Recognition: A Survey","abstract":"Sensor-based human activity recognition (HAR) has been an active research area, owing to its applications in smart environments, assisted living, fitness, healthcare, etc. Recently, deep learning based end-to-end training has resulted in state-of-the-art performance in domains such as computer vision and natural language, where large amounts of annotated data are available. However, large quantities of annotated data are not available for sensor-based HAR. Moreover, the real-world settings on which the HAR is performed differ in terms of sensor modalities, classification tasks, and target users. To address this problem, transfer learning has been employed extensively. In this survey, we focus on these transfer learning methods in the application domains of smart home and wearables-based HAR. In particular, we provide a problem-solution perspective by categorizing and presenting the works in terms of their contributions and the challenges they address. We also present an updated view of the state-of-the-art for both application domains. Based on our analysis of 205 papers, we highlight the gaps in the literature and provide a roadmap for addressing them. This survey provides a reference to the HAR community, by summarizing the existing works and providing a promising research agenda.","sentences":["Sensor-based human activity recognition (HAR) has been an active research area, owing to its applications in smart environments, assisted living, fitness, healthcare, etc.","Recently, deep learning based end-to-end training has resulted in state-of-the-art performance in domains such as computer vision and natural language, where large amounts of annotated data are available.","However, large quantities of annotated data are not available for sensor-based HAR.","Moreover, the real-world settings on which the HAR is performed differ in terms of sensor modalities, classification tasks, and target users.","To address this problem, transfer learning has been employed extensively.","In this survey, we focus on these transfer learning methods in the application domains of smart home and wearables-based HAR.","In particular, we provide a problem-solution perspective by categorizing and presenting the works in terms of their contributions and the challenges they address.","We also present an updated view of the state-of-the-art for both application domains.","Based on our analysis of 205 papers, we highlight the gaps in the literature and provide a roadmap for addressing them.","This survey provides a reference to the HAR community, by summarizing the existing works and providing a promising research agenda."],"url":"http://arxiv.org/abs/2401.10185v1","category":"cs.LG"}
{"created":"2024-01-18 18:10:48","title":"Experimental demonstration of quantum illumination using polarization-entangled photon pairs and CHSH value as measure","abstract":"Entangled light sources for illuminating objects offers advantages over conventional illumination methods by enhancing the detection sensitivity of a reflecting object. The crux of the quantum advantage lies in way we can practically leverage quantum correlations to isolate the background noise and detect the low reflectivity object. In this work we experimentally demonstrated the advantages of using polarization-entangled photon pairs for quantum illumination and show that the quantum correlation measure using CHSH value is robust against background noise and losses. We also show that the residual of quantum correlations help in identifying the object of reflectivity, $\\eta$ as low as 0.05 and when signal-to-noise ratio is as low as 0.003 for $\\eta=0.7$, surpassing the earlier demonstrated results. Robustness of correlation measure with photon attenuation in atmospheric condition is analysed to show the practical feasibility of the real time application.","sentences":["Entangled light sources for illuminating objects offers advantages over conventional illumination methods by enhancing the detection sensitivity of a reflecting object.","The crux of the quantum advantage lies in way we can practically leverage quantum correlations to isolate the background noise and detect the low reflectivity object.","In this work we experimentally demonstrated the advantages of using polarization-entangled photon pairs for quantum illumination and show that the quantum correlation measure using CHSH value is robust against background noise and losses.","We also show that the residual of quantum correlations help in identifying the object of reflectivity, $\\eta$ as low as 0.05 and when signal-to-noise ratio is as low as 0.003 for $\\eta=0.7$, surpassing the earlier demonstrated results.","Robustness of correlation measure with photon attenuation in atmospheric condition is analysed to show the practical feasibility of the real time application."],"url":"http://arxiv.org/abs/2401.10182v1","category":"quant-ph"}
{"created":"2024-01-18 18:05:35","title":"Comprehensive OOD Detection Improvements","abstract":"As machine learning becomes increasingly prevalent in impactful decisions, recognizing when inference data is outside the model's expected input distribution is paramount for giving context to predictions. Out-of-distribution (OOD) detection methods have been created for this task. Such methods can be split into representation-based or logit-based methods from whether they respectively utilize the model's embeddings or predictions for OOD detection. In contrast to most papers which solely focus on one such group, we address both. We employ dimensionality reduction on feature embeddings in representation-based methods for both time speedups and improved performance. Additionally, we propose DICE-COL, a modification of the popular logit-based method Directed Sparsification (DICE) that resolves an unnoticed flaw. We demonstrate the effectiveness of our methods on the OpenOODv1.5 benchmark framework, where they significantly improve performance and set state-of-the-art results.","sentences":["As machine learning becomes increasingly prevalent in impactful decisions, recognizing when inference data is outside the model's expected input distribution is paramount for giving context to predictions.","Out-of-distribution (OOD) detection methods have been created for this task.","Such methods can be split into representation-based or logit-based methods from whether they respectively utilize the model's embeddings or predictions for OOD detection.","In contrast to most papers which solely focus on one such group, we address both.","We employ dimensionality reduction on feature embeddings in representation-based methods for both time speedups and improved performance.","Additionally, we propose DICE-COL, a modification of the popular logit-based method Directed Sparsification (DICE) that resolves an unnoticed flaw.","We demonstrate the effectiveness of our methods on the OpenOODv1.5 benchmark framework, where they significantly improve performance and set state-of-the-art results."],"url":"http://arxiv.org/abs/2401.10176v1","category":"cs.LG"}
{"created":"2024-01-18 17:49:32","title":"Anomalies and gauging of U(1) symmetries","abstract":"We propose the Symmetry TFT for theories with a $U(1)$ symmetry in arbitrary dimension. The Symmetry TFT describes the structure of the symmetry, its anomalies, and the possible topological manipulations. It is constructed as a BF theory of gauge fields for groups $U(1)$ and $\\mathbb{R}$, and contains a continuum of topological operators. We also propose an operation that produces the Symmetry TFT for the theory obtained by dynamically gauging the $U(1)$ symmetry. We discuss many examples. As an interesting outcome, we obtain the Symmetry TFT for the non-invertible $\\mathbb{Q}/\\mathbb{Z}$ chiral symmetry in four dimensions.","sentences":["We propose the Symmetry TFT for theories with a $U(1)$ symmetry in arbitrary dimension.","The Symmetry TFT describes the structure of the symmetry, its anomalies, and the possible topological manipulations.","It is constructed as a BF theory of gauge fields for groups $U(1)$ and $\\mathbb{R}$, and contains a continuum of topological operators.","We also propose an operation that produces the Symmetry TFT for the theory obtained by dynamically gauging the $U(1)$ symmetry.","We discuss many examples.","As an interesting outcome, we obtain the Symmetry TFT for the non-invertible $\\mathbb{Q}/\\mathbb{Z}$ chiral symmetry in four dimensions."],"url":"http://arxiv.org/abs/2401.10165v1","category":"hep-th"}
{"created":"2024-01-18 17:41:03","title":"An Exploration to the Correlation Structure and Clustering of Macroeconomic Variables (MEV)","abstract":"As a quantitative characterization of the complicated economy, Macroeconomic Variables (MEVs), including GDP, inflation, unemployment, income, spending, interest rate, etc., are playing a crucial role in banks' portfolio management and stress testing exercise. In recent years, especially during the COVID-19 period and the current high inflation environment, people are frequently talking about the changing \"correlation structure\" of MEVs. In this paper, we use a principal component based algorithm to better understand MEVs' correlation structure in a given period. We also demonstrate how this method can be used to visualize historical MEVs pattern changes between 2000 and 2022. Further, we use this method to compare different hypothetical or historical macroeconomic scenarios and present our key findings.","sentences":["As a quantitative characterization of the complicated economy, Macroeconomic Variables (MEVs), including GDP, inflation, unemployment, income, spending, interest rate, etc., are playing a crucial role in banks' portfolio management and stress testing exercise.","In recent years, especially during the COVID-19 period and the current high inflation environment, people are frequently talking about the changing \"correlation structure\" of MEVs.","In this paper, we use a principal component based algorithm to better understand MEVs' correlation structure in a given period.","We also demonstrate how this method can be used to visualize historical MEVs pattern changes between 2000 and 2022.","Further, we use this method to compare different hypothetical or historical macroeconomic scenarios and present our key findings."],"url":"http://arxiv.org/abs/2401.10162v1","category":"q-fin.RM"}
{"created":"2024-01-18 17:22:22","title":"Multi-Agent Reinforcement Learning for Maritime Operational Technology Cyber Security","abstract":"This paper demonstrates the potential for autonomous cyber defence to be applied on industrial control systems and provides a baseline environment to further explore Multi-Agent Reinforcement Learning's (MARL) application to this problem domain. It introduces a simulation environment, IPMSRL, of a generic Integrated Platform Management System (IPMS) and explores the use of MARL for autonomous cyber defence decision-making on generic maritime based IPMS Operational Technology (OT). OT cyber defensive actions are less mature than they are for Enterprise IT. This is due to the relatively brittle nature of OT infrastructure originating from the use of legacy systems, design-time engineering assumptions, and lack of full-scale modern security controls. There are many obstacles to be tackled across the cyber landscape due to continually increasing cyber-attack sophistication and the limitations of traditional IT-centric cyber defence solutions. Traditional IT controls are rarely deployed on OT infrastructure, and where they are, some threats aren't fully addressed. In our experiments, a shared critic implementation of Multi Agent Proximal Policy Optimisation (MAPPO) outperformed Independent Proximal Policy Optimisation (IPPO). MAPPO reached an optimal policy (episode outcome mean of 1) after 800K timesteps, whereas IPPO was only able to reach an episode outcome mean of 0.966 after one million timesteps. Hyperparameter tuning greatly improved training performance. Across one million timesteps the tuned hyperparameters reached an optimal policy whereas the default hyperparameters only managed to win sporadically, with most simulations resulting in a draw. We tested a real-world constraint, attack detection alert success, and found that when alert success probability is reduced to 0.75 or 0.9, the MARL defenders were still able to win in over 97.5% or 99.5% of episodes, respectively.","sentences":["This paper demonstrates the potential for autonomous cyber defence to be applied on industrial control systems and provides a baseline environment to further explore Multi-Agent Reinforcement Learning's (MARL) application to this problem domain.","It introduces a simulation environment, IPMSRL, of a generic Integrated Platform Management System (IPMS) and explores the use of MARL for autonomous cyber defence decision-making on generic maritime based IPMS Operational Technology (OT).","OT cyber defensive actions are less mature than they are for Enterprise IT.","This is due to the relatively brittle nature of OT infrastructure originating from the use of legacy systems, design-time engineering assumptions, and lack of full-scale modern security controls.","There are many obstacles to be tackled across the cyber landscape due to continually increasing cyber-attack sophistication and the limitations of traditional IT-centric cyber defence solutions.","Traditional IT controls are rarely deployed on OT infrastructure, and where they are, some threats aren't fully addressed.","In our experiments, a shared critic implementation of Multi Agent Proximal Policy Optimisation (MAPPO) outperformed Independent Proximal Policy Optimisation (IPPO).","MAPPO reached an optimal policy (episode outcome mean of 1) after 800K timesteps, whereas IPPO was only able to reach an episode outcome mean of 0.966 after one million timesteps.","Hyperparameter tuning greatly improved training performance.","Across one million timesteps the tuned hyperparameters reached an optimal policy whereas the default hyperparameters only managed to win sporadically, with most simulations resulting in a draw.","We tested a real-world constraint, attack detection alert success, and found that when alert success probability is reduced to 0.75 or 0.9, the MARL defenders were still able to win in over 97.5% or 99.5% of episodes, respectively."],"url":"http://arxiv.org/abs/2401.10149v1","category":"cs.LG"}
{"created":"2024-01-18 17:20:29","title":"Strong decay of correlations for Gibbs states in any dimension","abstract":"Quantum systems in thermal equilibrium are described using Gibbs states. The correlations in such states determine how difficult it is to describe or simulate them. In this article, we show that systems with short-range interactions that are above a critical temperature satisfy a mixing condition, that is that for any regions $A$, $C$ the distance of the reduced state $\\rho_{AC}$ on these regions to the product of its marginals, $$\\| \\rho_{AC} \\rho_A^{-1} \\otimes \\rho_C^{-1} - \\mathbf{1}_{AC}\\| \\, ,$$ decays exponentially with the distance between regions $A$ and $C$. This mixing condition is stronger than other commonly studied measures of correlation. In particular, it implies the exponential decay of the mutual information between distant regions. The mixing condition has been used, for example, to prove positive log-Sobolev constants. On the way, we investigate the relations to other notions of decay of correlations in quantum many-body systems and show that many of them are equivalent under the assumption that there exists a local effective Hamiltonian. The proof employs a variety of tools such as Araki's expansionals and quantum belief propagation.","sentences":["Quantum systems in thermal equilibrium are described using Gibbs states.","The correlations in such states determine how difficult it is to describe or simulate them.","In this article, we show that systems with short-range interactions that are above a critical temperature satisfy a mixing condition, that is that for any regions $A$, $C$ the distance of the reduced state $\\rho_{AC}$ on these regions to the product of its marginals, $$\\| \\rho_{AC} \\rho_A^{-1} \\otimes \\rho_C^{-1} - \\mathbf{1}_{AC}\\| \\, ,$$ decays exponentially with the distance between regions $A$ and $C$.","This mixing condition is stronger than other commonly studied measures of correlation.","In particular, it implies the exponential decay of the mutual information between distant regions.","The mixing condition has been used, for example, to prove positive log-Sobolev constants.","On the way, we investigate the relations to other notions of decay of correlations in quantum many-body systems and show that many of them are equivalent under the assumption that there exists a local effective Hamiltonian.","The proof employs a variety of tools such as Araki's expansionals and quantum belief propagation."],"url":"http://arxiv.org/abs/2401.10147v1","category":"quant-ph"}
{"created":"2024-01-18 17:12:35","title":"Resource Theory of Non-Revivals with Applications to Quantum Many-Body Scars","abstract":"The study of state revivals has a long history in dynamical systems. We introduce a resource theory to understand the use of state revivals in quantum physics, especially in quantum many-body scarred systems. In this theory, a state is said to contain no amount of resource if it experiences perfect revivals under some unitary evolution. All other states are said to be resourceful. We show that this resource bounds information scrambling. Furthermore, we show that quantum many-body scarred dynamics can produce revivals in the Hayden-Preskill decoding protocol and can also be used to recover damaged quantum information. Our theory establishes a framework to study information retrieval and its applications in quantum many-body physics.","sentences":["The study of state revivals has a long history in dynamical systems.","We introduce a resource theory to understand the use of state revivals in quantum physics, especially in quantum many-body scarred systems.","In this theory, a state is said to contain no amount of resource if it experiences perfect revivals under some unitary evolution.","All other states are said to be resourceful.","We show that this resource bounds information scrambling.","Furthermore, we show that quantum many-body scarred dynamics can produce revivals in the Hayden-Preskill decoding protocol and can also be used to recover damaged quantum information.","Our theory establishes a framework to study information retrieval and its applications in quantum many-body physics."],"url":"http://arxiv.org/abs/2401.10142v1","category":"quant-ph"}
{"created":"2024-01-18 17:07:54","title":"FSSH-2: Fewest Switches Surface Hopping with robust switching probability","abstract":"This study introduces the FSSH-2 scheme, a redefined and numerically stable adiabatic Fewest Switches Surface Hopping (FSSH) method for mixed quantum-classical dynamics. It reformulates the standard FSSH hopping probability without non-adiabatic coupling vectors and allows for numerical time integration with larger step sizes. The advantages of FSSH-2 are demonstrated by numerical experiments for five different model systems in one and two spatial dimensions with up to three electronic states.","sentences":["This study introduces the FSSH-2 scheme, a redefined and numerically stable adiabatic Fewest Switches Surface Hopping (FSSH) method for mixed quantum-classical dynamics.","It reformulates the standard FSSH hopping probability without non-adiabatic coupling vectors and allows for numerical time integration with larger step sizes.","The advantages of FSSH-2 are demonstrated by numerical experiments for five different model systems in one and two spatial dimensions with up to three electronic states."],"url":"http://arxiv.org/abs/2401.10140v1","category":"physics.comp-ph"}
{"created":"2024-01-18 17:06:16","title":"Wallets' explorations across non-fungible token collections","abstract":"Non-fungible tokens (NFTs), which are immutable and transferable tokens on blockchain networks, have been used to certify the ownership of digital images often grouped in collections. Depending on individual interests, wallets explore and purchase NFTs in one or more image collections. Among many potential factors of shaping purchase trajectories, this paper specifically examines how visual similarities between collections affect wallets' explorations. Our model shows that wallets' explorations are not random but tend to favor collections having similar visual features to their previous purchases. The model also predicts the extent to which the next collection is close to the most recent collection of purchases with respect to visual features. These results are expected to enhance and support recommendation systems for the NFT market.","sentences":["Non-fungible tokens (NFTs), which are immutable and transferable tokens on blockchain networks, have been used to certify the ownership of digital images often grouped in collections.","Depending on individual interests, wallets explore and purchase NFTs in one or more image collections.","Among many potential factors of shaping purchase trajectories, this paper specifically examines how visual similarities between collections affect wallets' explorations.","Our model shows that wallets' explorations are not random but tend to favor collections having similar visual features to their previous purchases.","The model also predicts the extent to which the next collection is close to the most recent collection of purchases with respect to visual features.","These results are expected to enhance and support recommendation systems for the NFT market."],"url":"http://arxiv.org/abs/2401.10138v1","category":"physics.soc-ph"}
{"created":"2024-01-18 17:05:51","title":"Universal adjointation of isometry operations using transformation of quantum supermaps","abstract":"The full characterization of the possible transformations of quantum operations is indispensable to developing algorithms in higher-order quantum computation, which is the quantum version of functional programming. Although universal transformations of unitary operations have been well investigated, their extensions to non-unitary operations are still missing, except for a few examples. Here we construct \\emph{isometry adjointation} protocols, transforming an input isometry operation into its adjoint operation. This task reduces to the transformation of unitary operation or that of quantum states in special cases. Parallel and sequential isometry adjointation protocols are constructed by transforming unitary inversion protocols using the composition of quantum combs. This construction achieves the optimal approximation error, which implies that the optimal performance does not depend on the output dimension of the isometry operation. In particular, we explicitly obtain the asymptotically optimal parallel protocol achieving the approximation error $\\epsilon = \\Theta(d^2/n)$, where $d$ is the input dimension of the isometry operation and $n$ is the number of calls of the isometry operation. We also construct the protocols for the related tasks called isometry inversion and universal error detection. We conduct semidefinite programming to investigate the optimal performances of the tasks using general protocols including indefinite causal order protocols. The numerical results show that the optimal performances of general protocols do not depend on the output dimension of the isometry operation for isometry adjointation and universal error detection, which is shown analytically for parallel and sequential protocols. They also exhibit the advantage of indefinite causal order protocols over sequential protocols for isometry inversion and universal error detection.","sentences":["The full characterization of the possible transformations of quantum operations is indispensable to developing algorithms in higher-order quantum computation, which is the quantum version of functional programming.","Although universal transformations of unitary operations have been well investigated, their extensions to non-unitary operations are still missing, except for a few examples.","Here we construct \\emph{isometry adjointation} protocols, transforming an input isometry operation into its adjoint operation.","This task reduces to the transformation of unitary operation or that of quantum states in special cases.","Parallel and sequential isometry adjointation protocols are constructed by transforming unitary inversion protocols using the composition of quantum combs.","This construction achieves the optimal approximation error, which implies that the optimal performance does not depend on the output dimension of the isometry operation.","In particular, we explicitly obtain the asymptotically optimal parallel protocol achieving the approximation error $\\epsilon = \\Theta(d^2/n)$, where $d$ is the input dimension of the isometry operation and $n$ is the number of calls of the isometry operation.","We also construct the protocols for the related tasks called isometry inversion and universal error detection.","We conduct semidefinite programming to investigate the optimal performances of the tasks using general protocols including indefinite causal order protocols.","The numerical results show that the optimal performances of general protocols do not depend on the output dimension of the isometry operation for isometry adjointation and universal error detection, which is shown analytically for parallel and sequential protocols.","They also exhibit the advantage of indefinite causal order protocols over sequential protocols for isometry inversion and universal error detection."],"url":"http://arxiv.org/abs/2401.10137v1","category":"quant-ph"}
{"created":"2024-01-18 17:03:59","title":"Spatial-Temporal Large Language Model for Traffic Prediction","abstract":"Traffic prediction, a critical component for intelligent transportation systems, endeavors to foresee future traffic at specific locations using historical data. Although existing traffic prediction models often emphasize developing complex neural network structures, their accuracy has not seen improvements accordingly. Recently, Large Language Models (LLMs) have shown outstanding capabilities in time series analysis. Differing from existing models, LLMs progress mainly through parameter expansion and extensive pre-training while maintaining their fundamental structures. In this paper, we propose a Spatial-Temporal Large Language Model (ST-LLM) for traffic prediction. Specifically, ST-LLM redefines the timesteps at each location as tokens and incorporates a spatial-temporal embedding module to learn the spatial location and global temporal representations of tokens. Then these representations are fused to provide each token with unified spatial and temporal information. Furthermore, we propose a novel partially frozen attention strategy of the LLM, which is designed to capture spatial-temporal dependencies for traffic prediction. Comprehensive experiments on real traffic datasets offer evidence that ST-LLM outperforms state-of-the-art models. Notably, the ST-LLM also exhibits robust performance in both few-shot and zero-shot prediction scenarios.","sentences":["Traffic prediction, a critical component for intelligent transportation systems, endeavors to foresee future traffic at specific locations using historical data.","Although existing traffic prediction models often emphasize developing complex neural network structures, their accuracy has not seen improvements accordingly.","Recently, Large Language Models (LLMs) have shown outstanding capabilities in time series analysis.","Differing from existing models, LLMs progress mainly through parameter expansion and extensive pre-training while maintaining their fundamental structures.","In this paper, we propose a Spatial-Temporal Large Language Model (ST-LLM) for traffic prediction.","Specifically, ST-LLM redefines the timesteps at each location as tokens and incorporates a spatial-temporal embedding module to learn the spatial location and global temporal representations of tokens.","Then these representations are fused to provide each token with unified spatial and temporal information.","Furthermore, we propose a novel partially frozen attention strategy of the LLM, which is designed to capture spatial-temporal dependencies for traffic prediction.","Comprehensive experiments on real traffic datasets offer evidence that ST-LLM outperforms state-of-the-art models.","Notably, the ST-LLM also exhibits robust performance in both few-shot and zero-shot prediction scenarios."],"url":"http://arxiv.org/abs/2401.10134v1","category":"cs.LG"}
{"created":"2024-01-18 16:59:37","title":"Biorthogonal measures, polymer partition functions, and random matrices","abstract":"We develop the study of a particular class of biorthogonal measures, encompassing at the same time several random matrix models and partition functions of polymers. This general framework allows us to characterize the partition functions of the Log Gamma polymer and the mixed polymer in terms of explicit biorthogonal measures, as it was previously done for the homogeneous O'Connell-Yor polymer by Imamura and Sasamoto. In addition, we show that the biorthogonal measures associated to these three polymer models (Log Gamma, O'Connell-Yor, and mixed polymer) converge to random matrix eigenvalue distributions in small temperature limits. We also clarify the connection between different Fredholm determinant representations and explain how our results might be useful for asymptotic analysis and large deviation estimates.","sentences":["We develop the study of a particular class of biorthogonal measures, encompassing at the same time several random matrix models and partition functions of polymers.","This general framework allows us to characterize the partition functions of the Log Gamma polymer and the mixed polymer in terms of explicit biorthogonal measures, as it was previously done for the homogeneous O'Connell-Yor polymer by Imamura and Sasamoto.","In addition, we show that the biorthogonal measures associated to these three polymer models (Log Gamma, O'Connell-Yor, and mixed polymer) converge to random matrix eigenvalue distributions in small temperature limits.","We also clarify the connection between different Fredholm determinant representations and explain how our results might be useful for asymptotic analysis and large deviation estimates."],"url":"http://arxiv.org/abs/2401.10130v1","category":"math-ph"}
{"created":"2024-01-18 16:51:51","title":"Differentially Private Approval-Based Committee Voting","abstract":"In this paper, we investigate tradeoffs between differential privacy (DP) and several voting axioms for approval-based committee voting, including proportionality, Pareto efficiency, Condorcet criterion, and strategyproofness. For all the axioms except strategyproofness, we show their incompatibility with DP, and provide both upper and lower bounds for their tradeoffs with DP. Furthermore, we show that any $\\epsilon$-DP mechanism satisfies $e^{-\\epsilon}$-cardinality strategyproofness, and the satisfaction can be further improved if the mechanism satisfies monotonicity.","sentences":["In this paper, we investigate tradeoffs between differential privacy (DP) and several voting axioms for approval-based committee voting, including proportionality, Pareto efficiency, Condorcet criterion, and strategyproofness.","For all the axioms except strategyproofness, we show their incompatibility with DP, and provide both upper and lower bounds for their tradeoffs with DP.","Furthermore, we show that any $\\epsilon$-DP mechanism satisfies $e^{-\\epsilon}$-cardinality strategyproofness, and the satisfaction can be further improved if the mechanism satisfies monotonicity."],"url":"http://arxiv.org/abs/2401.10122v1","category":"cs.GT"}
{"created":"2024-01-18 16:51:02","title":"A Novel Noise-Aware Classical Optimizer for Variational Quantum Algorithms","abstract":"A key component of variational quantum algorithms (VQAs) is the choice of classical optimizer employed to update the parameterization of an ansatz. It is well recognized that quantum algorithms will, for the foreseeable future, necessarily be run on noisy devices with limited fidelities. Thus, the evaluation of an objective function (e.g., the guiding function in the quantum approximate optimization algorithm (QAOA) or the expectation of the electronic Hamiltonian in variational quantum eigensolver (VQE)) required by a classical optimizer is subject not only to stochastic error from estimating an expected value but also to error resulting from intermittent hardware noise. Model-based derivative-free optimization methods have emerged as popular choices of a classical optimizer in the noisy VQA setting, based on empirical studies. However, these optimization methods were not explicitly designed with the consideration of noise. In this work we adapt recent developments from the ``noise-aware numerical optimization'' literature to these commonly used derivative-free model-based methods. We introduce the key defining characteristics of these novel noise-aware derivative-free model-based methods that separate them from standard model-based methods. We study an implementation of such noise-aware derivative-free model-based methods and compare its performance on demonstrative VQA simulations to classical solvers packaged in \\texttt{scikit-quant}.","sentences":["A key component of variational quantum algorithms (VQAs) is the choice of classical optimizer employed to update the parameterization of an ansatz.","It is well recognized that quantum algorithms will, for the foreseeable future, necessarily be run on noisy devices with limited fidelities.","Thus, the evaluation of an objective function (e.g., the guiding function in the quantum approximate optimization algorithm (QAOA) or the expectation of the electronic Hamiltonian in variational quantum eigensolver (VQE)) required by a classical optimizer is subject not only to stochastic error from estimating an expected value but also to error resulting from intermittent hardware noise.","Model-based derivative-free optimization methods have emerged as popular choices of a classical optimizer in the noisy VQA setting, based on empirical studies.","However, these optimization methods were not explicitly designed with the consideration of noise.","In this work we adapt recent developments from the ``noise-aware numerical optimization'' literature to these commonly used derivative-free model-based methods.","We introduce the key defining characteristics of these novel noise-aware derivative-free model-based methods that separate them from standard model-based methods.","We study an implementation of such noise-aware derivative-free model-based methods and compare its performance on demonstrative VQA simulations to classical solvers packaged in \\texttt{scikit-quant}."],"url":"http://arxiv.org/abs/2401.10121v1","category":"quant-ph"}
{"created":"2024-01-18 16:51:01","title":"Binary Quantum Control Optimization with Uncertain Hamiltonians","abstract":"Optimizing the controls of quantum systems plays a crucial role in advancing quantum technologies. The time-varying noises in quantum systems and the widespread use of inhomogeneous quantum ensembles raise the need for high-quality quantum controls under uncertainties. In this paper, we consider a stochastic discrete optimization formulation of a binary optimal quantum control problem involving Hamiltonians with predictable uncertainties. We propose a sample-based reformulation that optimizes both risk-neutral and risk-averse measurements of control policies, and solve these with two gradient-based algorithms using sum-up-rounding approaches. Furthermore, we discuss the differentiability of the objective function and prove upper bounds of the gaps between the optimal solutions to binary control problems and their continuous relaxations. We conduct numerical studies on various sized problem instances based of two applications of quantum pulse optimization; we evaluate different strategies to mitigate the impact of uncertainties in quantum systems. We demonstrate that the controls of our stochastic optimization model achieve significantly higher quality and robustness compared to the controls of a deterministic model.","sentences":["Optimizing the controls of quantum systems plays a crucial role in advancing quantum technologies.","The time-varying noises in quantum systems and the widespread use of inhomogeneous quantum ensembles raise the need for high-quality quantum controls under uncertainties.","In this paper, we consider a stochastic discrete optimization formulation of a binary optimal quantum control problem involving Hamiltonians with predictable uncertainties.","We propose a sample-based reformulation that optimizes both risk-neutral and risk-averse measurements of control policies, and solve these with two gradient-based algorithms using sum-up-rounding approaches.","Furthermore, we discuss the differentiability of the objective function and prove upper bounds of the gaps between the optimal solutions to binary control problems and their continuous relaxations.","We conduct numerical studies on various sized problem instances based of two applications of quantum pulse optimization; we evaluate different strategies to mitigate the impact of uncertainties in quantum systems.","We demonstrate that the controls of our stochastic optimization model achieve significantly higher quality and robustness compared to the controls of a deterministic model."],"url":"http://arxiv.org/abs/2401.10120v1","category":"quant-ph"}
{"created":"2024-01-18 16:50:55","title":"Towards Principled Graph Transformers","abstract":"Graph learning architectures based on the k-dimensional Weisfeiler-Leman (k-WL) hierarchy offer a theoretically well-understood expressive power. However, such architectures often fail to deliver solid predictive performance on real-world tasks, limiting their practical impact. In contrast, global attention-based models such as graph transformers demonstrate strong performance in practice, but comparing their expressive power with the k-WL hierarchy remains challenging, particularly since these architectures rely on positional or structural encodings for their expressivity and predictive performance. To address this, we show that the recently proposed Edge Transformer, a global attention model operating on node pairs instead of nodes, has at least 3-WL expressive power. Empirically, we demonstrate that the Edge Transformer surpasses other theoretically aligned architectures regarding predictive performance while not relying on positional or structural encodings.","sentences":["Graph learning architectures based on the k-dimensional Weisfeiler-Leman (k-WL) hierarchy offer a theoretically well-understood expressive power.","However, such architectures often fail to deliver solid predictive performance on real-world tasks, limiting their practical impact.","In contrast, global attention-based models such as graph transformers demonstrate strong performance in practice, but comparing their expressive power with the k-WL hierarchy remains challenging, particularly since these architectures rely on positional or structural encodings for their expressivity and predictive performance.","To address this, we show that the recently proposed Edge Transformer, a global attention model operating on node pairs instead of nodes, has at least 3-WL expressive power.","Empirically, we demonstrate that the Edge Transformer surpasses other theoretically aligned architectures regarding predictive performance while not relying on positional or structural encodings."],"url":"http://arxiv.org/abs/2401.10119v1","category":"cs.LG"}
{"created":"2024-01-18 16:10:07","title":"Counterfactual Reasoning with Probabilistic Graphical Models for Analyzing Socioecological Systems","abstract":"Causal and counterfactual reasoning are emerging directions in data science that allow us to reason about hypothetical scenarios. This is particularly useful in domains where experimental data are usually not available. In the context of environmental and ecological sciences, causality enables us, for example, to predict how an ecosystem would respond to hypothetical interventions. A structural causal model is a class of probabilistic graphical models for causality, which, due to its intuitive nature, can be easily understood by experts in multiple fields. However, certain queries, called unidentifiable, cannot be calculated in an exact and precise manner. This paper proposes applying a novel and recent technique for bounding unidentifiable queries within the domain of socioecological systems. Our findings indicate that traditional statistical analysis, including probabilistic graphical models, can identify the influence between variables. However, such methods do not offer insights into the nature of the relationship, specifically whether it involves necessity or sufficiency. This is where counterfactual reasoning becomes valuable.","sentences":["Causal and counterfactual reasoning are emerging directions in data science that allow us to reason about hypothetical scenarios.","This is particularly useful in domains where experimental data are usually not available.","In the context of environmental and ecological sciences, causality enables us, for example, to predict how an ecosystem would respond to hypothetical interventions.","A structural causal model is a class of probabilistic graphical models for causality, which, due to its intuitive nature, can be easily understood by experts in multiple fields.","However, certain queries, called unidentifiable, cannot be calculated in an exact and precise manner.","This paper proposes applying a novel and recent technique for bounding unidentifiable queries within the domain of socioecological systems.","Our findings indicate that traditional statistical analysis, including probabilistic graphical models, can identify the influence between variables.","However, such methods do not offer insights into the nature of the relationship, specifically whether it involves necessity or sufficiency.","This is where counterfactual reasoning becomes valuable."],"url":"http://arxiv.org/abs/2401.10101v1","category":"cs.AI"}
{"created":"2024-01-18 16:06:57","title":"Time-optimal state transfer for an open qubit","abstract":"Finding minimal time and establishing the structure of the corresponding optimal controls which can transfer a given initial state of a quantum system into a given target state is a key problem of quantum control. In this work, this problem is solved for a basic component of various quantum technology processes -- a qubit interacting with the environment and experiencing an arbitrary time-dependent coherent driving. We rigorously derive both upper and lower estimates for the minimal steering time. Surprisingly, we discover that the optimal controls have a very special form -- they consist of two impulses, at the beginning and at the end of the control period, which can be assisted by a smooth time-dependent control in between. Moreover, an important for practical applications explicit almost optimal state transfer protocol is provided which only consists of four impulses and gives an almost optimal time of motion. The results can be directly applied to a variety of experimental situations for estimation of the ultimate limits of state control for quantum technologies.","sentences":["Finding minimal time and establishing the structure of the corresponding optimal controls which can transfer a given initial state of a quantum system into a given target state is a key problem of quantum control.","In this work, this problem is solved for a basic component of various quantum technology processes -- a qubit interacting with the environment and experiencing an arbitrary time-dependent coherent driving.","We rigorously derive both upper and lower estimates for the minimal steering time.","Surprisingly, we discover that the optimal controls have a very special form -- they consist of two impulses, at the beginning and at the end of the control period, which can be assisted by a smooth time-dependent control in between.","Moreover, an important for practical applications explicit almost optimal state transfer protocol is provided which only consists of four impulses and gives an almost optimal time of motion.","The results can be directly applied to a variety of experimental situations for estimation of the ultimate limits of state control for quantum technologies."],"url":"http://arxiv.org/abs/2401.10099v1","category":"quant-ph"}
{"created":"2024-01-18 16:06:32","title":"Some simple theories of gravity with propagating nonmetricity","abstract":"We investigate symmetric Metric-Affine Theories of Gravity with a Lagrangian containing all operators of dimension up to four that are relevant to free propagation in flat space. Complementing recent work in the antisymmetric case, we derive the conditions for the existence of a single massive particle with good properties, in addition to the graviton.","sentences":["We investigate symmetric Metric-Affine Theories of Gravity with a Lagrangian containing all operators of dimension up to four that are relevant to free propagation in flat space.","Complementing recent work in the antisymmetric case, we derive the conditions for the existence of a single massive particle with good properties, in addition to the graviton."],"url":"http://arxiv.org/abs/2401.10097v1","category":"gr-qc"}
{"created":"2024-01-18 16:05:00","title":"Learning shallow quantum circuits","abstract":"Despite fundamental interests in learning quantum circuits, the existence of a computationally efficient algorithm for learning shallow quantum circuits remains an open question. Because shallow quantum circuits can generate distributions that are classically hard to sample from, existing learning algorithms do not apply. In this work, we present a polynomial-time classical algorithm for learning the description of any unknown $n$-qubit shallow quantum circuit $U$ (with arbitrary unknown architecture) within a small diamond distance using single-qubit measurement data on the output states of $U$. We also provide a polynomial-time classical algorithm for learning the description of any unknown $n$-qubit state $\\lvert \\psi \\rangle = U \\lvert 0^n \\rangle$ prepared by a shallow quantum circuit $U$ (on a 2D lattice) within a small trace distance using single-qubit measurements on copies of $\\lvert \\psi \\rangle$. Our approach uses a quantum circuit representation based on local inversions and a technique to combine these inversions. This circuit representation yields an optimization landscape that can be efficiently navigated and enables efficient learning of quantum circuits that are classically hard to simulate.","sentences":["Despite fundamental interests in learning quantum circuits, the existence of a computationally efficient algorithm for learning shallow quantum circuits remains an open question.","Because shallow quantum circuits can generate distributions that are classically hard to sample from, existing learning algorithms do not apply.","In this work, we present a polynomial-time classical algorithm for learning the description of any unknown $n$-qubit shallow quantum circuit $U$ (with arbitrary unknown architecture) within a small diamond distance using single-qubit measurement data on the output states of $U$. We also provide a polynomial-time classical algorithm for learning the description of any unknown $n$-qubit state $\\lvert \\psi \\rangle = U \\lvert 0^n \\rangle$ prepared by a shallow quantum circuit $U$ (on a 2D lattice) within a small trace distance using single-qubit measurements on copies of $\\lvert \\psi \\rangle$. Our approach uses a quantum circuit representation based on local inversions and a technique to combine these inversions.","This circuit representation yields an optimization landscape that can be efficiently navigated and enables efficient learning of quantum circuits that are classically hard to simulate."],"url":"http://arxiv.org/abs/2401.10095v1","category":"quant-ph"}
{"created":"2024-01-18 15:48:38","title":"Parity Quantum Computing as YZ-Plane Measurement-Based Quantum Computing","abstract":"We show that universal parity quantum computing employing a recently introduced constant depth decoding procedure is equivalent to measurement-based quantum computation (MBQC) on a bipartite graph using only YZ-plane measurements. We further show that any unitary MBQC using only YZ-plane measurements must occur on a bipartite graph.","sentences":["We show that universal parity quantum computing employing a recently introduced constant depth decoding procedure is equivalent to measurement-based quantum computation (MBQC) on a bipartite graph using only YZ-plane measurements.","We further show that any unitary MBQC using only YZ-plane measurements must occur on a bipartite graph."],"url":"http://arxiv.org/abs/2401.10079v1","category":"quant-ph"}
{"created":"2024-01-18 15:46:00","title":"On the locality of qubit encodings of local fermionic modes","abstract":"Known mappings that encode fermionic modes into a bosonic qubit system are non-local transformations. In this paper we establish that this must necessarily be the case, if the locality graph is complex enough (for example for regular 2$d$ lattices). In particular we show that, in case of exact encodings, a fully local mapping is possible if and only if the locality graph is a tree. If instead we allow ourselves to also consider operators that only act fermionically on a subspace of the qubit Hilbert space, then we show that this subspace must be composed of long range entangled states, if the locality graph contains at least two overlapping cycles. This implies, for instance, that on 2$d$ lattices there exist states that are simple from the fermionic point of view, while in any encoding require a circuit of depth at least proportional to the system size to be prepared.","sentences":["Known mappings that encode fermionic modes into a bosonic qubit system are non-local transformations.","In this paper we establish that this must necessarily be the case, if the locality graph is complex enough (for example for regular 2$d$ lattices).","In particular we show that, in case of exact encodings, a fully local mapping is possible if and only if the locality graph is a tree.","If instead we allow ourselves to also consider operators that only act fermionically on a subspace of the qubit Hilbert space, then we show that this subspace must be composed of long range entangled states, if the locality graph contains at least two overlapping cycles.","This implies, for instance, that on 2$d$ lattices there exist states that are simple from the fermionic point of view, while in any encoding require a circuit of depth at least proportional to the system size to be prepared."],"url":"http://arxiv.org/abs/2401.10077v1","category":"quant-ph"}
{"created":"2024-01-18 14:58:17","title":"Evolutionary Computation in the Era of Large Language Model: Survey and Roadmap","abstract":"Large Language Models (LLMs), built upon Transformer-based architectures with massive pretraining on diverse data, have not only revolutionized natural language processing but also extended their prowess to various domains, marking a significant stride towards artificial general intelligence. The interplay between LLMs and Evolutionary Algorithms (EAs), despite differing in objectives and methodologies, reveals intriguing parallels, especially in their shared optimization nature, black-box characteristics, and proficiency in handling complex problems. Meanwhile, EA can not only provide an optimization framework for LLM's further enhancement under black-box settings but also empower LLM with flexible global search and iterative mechanism in applications. On the other hand, LLM's abundant domain knowledge enables EA to perform smarter searches, while its text processing capability assist in deploying EA across various tasks. Based on their complementary advantages, this paper presents a comprehensive review and forward-looking roadmap, categorizing their mutual inspiration into LLM-enhanced evolutionary optimization and EA-enhanced LLM. Some integrated synergy methods are further introduced to exemplify the amalgamation of LLMs and EAs in various application scenarios, including neural architecture search, code generation, software engineering, and text generation. As the first comprehensive review specifically focused on the EA research in the era of LLMs, this paper provides a foundational stepping stone for understanding and harnessing the collaborative potential of LLMs and EAs. By presenting a comprehensive review, categorization, and critical analysis, we contribute to the ongoing discourse on the cross-disciplinary study of these two powerful paradigms. The identified challenges and future directions offer guidance to unlock the full potential of this innovative collaboration.","sentences":["Large Language Models (LLMs), built upon Transformer-based architectures with massive pretraining on diverse data, have not only revolutionized natural language processing but also extended their prowess to various domains, marking a significant stride towards artificial general intelligence.","The interplay between LLMs and Evolutionary Algorithms (EAs), despite differing in objectives and methodologies, reveals intriguing parallels, especially in their shared optimization nature, black-box characteristics, and proficiency in handling complex problems.","Meanwhile, EA can not only provide an optimization framework for LLM's further enhancement under black-box settings but also empower LLM with flexible global search and iterative mechanism in applications.","On the other hand, LLM's abundant domain knowledge enables EA to perform smarter searches, while its text processing capability assist in deploying EA across various tasks.","Based on their complementary advantages, this paper presents a comprehensive review and forward-looking roadmap, categorizing their mutual inspiration into LLM-enhanced evolutionary optimization and EA-enhanced LLM.","Some integrated synergy methods are further introduced to exemplify the amalgamation of LLMs and EAs in various application scenarios, including neural architecture search, code generation, software engineering, and text generation.","As the first comprehensive review specifically focused on the EA research in the era of LLMs, this paper provides a foundational stepping stone for understanding and harnessing the collaborative potential of LLMs and EAs.","By presenting a comprehensive review, categorization, and critical analysis, we contribute to the ongoing discourse on the cross-disciplinary study of these two powerful paradigms.","The identified challenges and future directions offer guidance to unlock the full potential of this innovative collaboration."],"url":"http://arxiv.org/abs/2401.10034v1","category":"cs.NE"}
{"created":"2024-01-18 14:55:03","title":"Cardiac Digital Twin Pipeline for Virtual Therapy Evaluation","abstract":"Cardiac digital twins are computational tools capturing key functional and anatomical characteristics of patient hearts for investigating disease phenotypes and predicting responses to therapy. When paired with large-scale computational resources and large clinical datasets, digital twin technology can enable virtual clinical trials on virtual cohorts to fast-track therapy development. Here, we present an automated pipeline for personalising ventricular anatomy and electrophysiological function based on routinely acquired cardiac magnetic resonance (CMR) imaging data and the standard 12-lead electrocardiogram (ECG). Using CMR-based anatomical models, a sequential Monte-Carlo approximate Bayesian computational inference method is extended to infer electrical activation and repolarisation characteristics from the ECG. Fast simulations are conducted with a reaction-Eikonal model, including the Purkinje network and biophysically-detailed subcellular ionic current dynamics for repolarisation. For each patient, parameter uncertainty is represented by inferring a population of ventricular models rather than a single one, which means that parameter uncertainty can be propagated to therapy evaluation. Furthermore, we have developed techniques for translating from reaction-Eikonal to monodomain simulations, which allows more realistic simulations of cardiac electrophysiology. The pipeline is demonstrated in a healthy female subject, where our inferred reaction-Eikonal models reproduced the patient's ECG with a Pearson's correlation coefficient of 0.93, and the translated monodomain simulations have a correlation coefficient of 0.89. We then apply the effect of Dofetilide to the monodomain population of models for this subject and show dose-dependent QT and T-peak to T-end prolongations that are in keeping with large population drug response data.","sentences":["Cardiac digital twins are computational tools capturing key functional and anatomical characteristics of patient hearts for investigating disease phenotypes and predicting responses to therapy.","When paired with large-scale computational resources and large clinical datasets, digital twin technology can enable virtual clinical trials on virtual cohorts to fast-track therapy development.","Here, we present an automated pipeline for personalising ventricular anatomy and electrophysiological function based on routinely acquired cardiac magnetic resonance (CMR) imaging data and the standard 12-lead electrocardiogram (ECG).","Using CMR-based anatomical models, a sequential Monte-Carlo approximate Bayesian computational inference method is extended to infer electrical activation and repolarisation characteristics from the ECG.","Fast simulations are conducted with a reaction-Eikonal model, including the Purkinje network and biophysically-detailed subcellular ionic current dynamics for repolarisation.","For each patient, parameter uncertainty is represented by inferring a population of ventricular models rather than a single one, which means that parameter uncertainty can be propagated to therapy evaluation.","Furthermore, we have developed techniques for translating from reaction-Eikonal to monodomain simulations, which allows more realistic simulations of cardiac electrophysiology.","The pipeline is demonstrated in a healthy female subject, where our inferred reaction-Eikonal models reproduced the patient's ECG with a Pearson's correlation coefficient of 0.93, and the translated monodomain simulations have a correlation coefficient of 0.89.","We then apply the effect of Dofetilide to the monodomain population of models for this subject and show dose-dependent QT and T-peak to T-end prolongations that are in keeping with large population drug response data."],"url":"http://arxiv.org/abs/2401.10029v1","category":"cs.CE"}
{"created":"2024-01-18 14:54:36","title":"Network higher-order structure dismantling","abstract":"Diverse higher-order structures, foundational for supporting a network's \"meta-functions\", play a vital role in structure, functionality, and the emergence of complex dynamics. Nevertheless, the problem of dismantling them has been consistently overlooked. In this paper, we introduce the concept of dismantling higher-order structures, with the objective of disrupting not only network connectivity but also eradicating all higher-order structures in each branch, thereby ensuring thorough functional paralysis. Given the diversity and unknown specifics of higher-order structures, identifying and targeting them individually is not practical or even feasible. Fortunately, their close association with k-cores arises from their internal high connectivity. Thus, we transform higher-order structure measurement into measurements on k-cores with corresponding orders. Furthermore, we propose the Belief Propagation-guided High-order Dismantling (BPDH) algorithm, minimizing dismantling costs while achieving maximal disruption to connectivity and higher-order structures, ultimately converting the network into a forest. BPDH exhibits the explosive vulnerability of network higher-order structures, counterintuitively showcasing decreasing dismantling costs with increasing structural complexity. Our findings offer a novel approach for dismantling malignant networks, emphasizing the substantial challenges inherent in safeguarding against such malicious attacks.","sentences":["Diverse higher-order structures, foundational for supporting a network's \"meta-functions\", play a vital role in structure, functionality, and the emergence of complex dynamics.","Nevertheless, the problem of dismantling them has been consistently overlooked.","In this paper, we introduce the concept of dismantling higher-order structures, with the objective of disrupting not only network connectivity but also eradicating all higher-order structures in each branch, thereby ensuring thorough functional paralysis.","Given the diversity and unknown specifics of higher-order structures, identifying and targeting them individually is not practical or even feasible.","Fortunately, their close association with k-cores arises from their internal high connectivity.","Thus, we transform higher-order structure measurement into measurements on k-cores with corresponding orders.","Furthermore, we propose the Belief Propagation-guided High-order Dismantling (BPDH) algorithm, minimizing dismantling costs while achieving maximal disruption to connectivity and higher-order structures, ultimately converting the network into a forest.","BPDH exhibits the explosive vulnerability of network higher-order structures, counterintuitively showcasing decreasing dismantling costs with increasing structural complexity.","Our findings offer a novel approach for dismantling malignant networks, emphasizing the substantial challenges inherent in safeguarding against such malicious attacks."],"url":"http://arxiv.org/abs/2401.10028v1","category":"physics.soc-ph"}
{"created":"2024-01-18 14:50:36","title":"Aspects of regular and singular electromagnetic-generalized-quasitopological-gravities black holes in (2+1) dimensions","abstract":"We investigate quasitopological black holes in $(2+1)$ dimensions in the context of electromagnetic-generalized-quasitopological-gravities (EM-GQT). For three different families of geometries of quasitopological nature, we study the causal structure and their response to a probe scalar field. To linear order, we verify that the scalar field evolves stably, decaying in different towers of quasinormal modes. The studied black holes are either charged geometries (regular and singular) or a regular Ba\\~nados-Teitelboim-Zanelli (BTZ)-like black hole, both coming from the EM-GQT theory characterized by nonminimal coupling parameters between gravity and a background scalar field. We calculate the quasinormal modes applying different numerical methods with convergent results between them. The oscillations demonstrate a very peculiar structure for charged black holes: in the intermediate and near extremal cases, a particular scaling arises, similar to that of the rotating BTZ geometry, with the modes being proportional to the distance between horizons. For the single horizon black hole solution, we identify the presence of different quasinormal families by analyzing the features of that spectrum. In all three considered geometries, no instabilities were found.","sentences":["We investigate quasitopological black holes in $(2+1)$ dimensions in the context of electromagnetic-generalized-quasitopological-gravities (EM-GQT).","For three different families of geometries of quasitopological nature, we study the causal structure and their response to a probe scalar field.","To linear order, we verify that the scalar field evolves stably, decaying in different towers of quasinormal modes.","The studied black holes are either charged geometries (regular and singular) or a regular Ba\\~nados-Teitelboim-Zanelli (BTZ)-like black hole, both coming from the EM-GQT theory characterized by nonminimal coupling parameters between gravity and a background scalar field.","We calculate the quasinormal modes applying different numerical methods with convergent results between them.","The oscillations demonstrate a very peculiar structure for charged black holes: in the intermediate and near extremal cases, a particular scaling arises, similar to that of the rotating BTZ geometry, with the modes being proportional to the distance between horizons.","For the single horizon black hole solution, we identify the presence of different quasinormal families by analyzing the features of that spectrum.","In all three considered geometries, no instabilities were found."],"url":"http://arxiv.org/abs/2401.10025v1","category":"gr-qc"}
{"created":"2024-01-18 14:44:07","title":"Entropy Production of Quantum Reset Models","abstract":"We analyze the entropy production of Quantum Reset Models (QRMs) corresponding to quantum dynamical semigroups driven by Lindbladians motivated by a probabilistic description of dissipation in an external environment. We investigate the strict positivity of entropy production for Lindbladians given as sums of QRMs, when the Hamiltonian of the total Lindbladian is split as an affine combination of Hamiltonians of the individual QRMs. In this setup, we derive conditions on the coefficients of the combination and on the reset states ensuring either positive or zero entropy production. Second, we deal with a tri-partite system subject at its ends to two independent QRMs and a weak coupling Hamiltonian. The latter is split as an affine combination of individual Hamiltonians, and we provide necessary and sufficient conditions ensuring strict positivity of the entropy production to leading order, with the possible exception of one affine combination. We apply these results to a physically motivated model and exhibit explicit expressions for the leading orders steady-state solution, entropy production and entropy fluxes. Moreover, these approximations are numerically shown to hold beyond the expected regimes.","sentences":["We analyze the entropy production of Quantum Reset Models (QRMs) corresponding to quantum dynamical semigroups driven by Lindbladians motivated by a probabilistic description of dissipation in an external environment.","We investigate the strict positivity of entropy production for Lindbladians given as sums of QRMs, when the Hamiltonian of the total Lindbladian is split as an affine combination of Hamiltonians of the individual QRMs.","In this setup, we derive conditions on the coefficients of the combination and on the reset states ensuring either positive or zero entropy production.","Second, we deal with a tri-partite system subject at its ends to two independent QRMs and a weak coupling Hamiltonian.","The latter is split as an affine combination of individual Hamiltonians, and we provide necessary and sufficient conditions ensuring strict positivity of the entropy production to leading order, with the possible exception of one affine combination.","We apply these results to a physically motivated model and exhibit explicit expressions for the leading orders steady-state solution, entropy production and entropy fluxes.","Moreover, these approximations are numerically shown to hold beyond the expected regimes."],"url":"http://arxiv.org/abs/2401.10022v1","category":"math-ph"}
{"created":"2024-01-18 14:31:11","title":"Optimizing Medication Decisions for Patients with Atrial Fibrillation through Path Development Network","abstract":"Atrial fibrillation (AF) is a common cardiac arrhythmia characterized by rapid and irregular contractions of the atria. It significantly elevates the risk of strokes due to slowed blood flow in the atria, especially in the left atrial appendage, which is prone to blood clot formation. Such clots can migrate into cerebral arteries, leading to ischemic stroke. To assess whether AF patients should be prescribed anticoagulants, doctors often use the CHA2DS2-VASc scoring system. However, anticoagulant use must be approached with caution as it can impact clotting functions. This study introduces a machine learning algorithm that predicts whether patients with AF should be recommended anticoagulant therapy using 12-lead ECG data. In this model, we use STOME to enhance time-series data and then process it through a Convolutional Neural Network (CNN). By incorporating a path development layer, the model achieves a specificity of 30.6% under the condition of an NPV of 1. In contrast, LSTM algorithms without path development yield a specificity of only 2.7% under the same NPV condition.","sentences":["Atrial fibrillation (AF) is a common cardiac arrhythmia characterized by rapid and irregular contractions of the atria.","It significantly elevates the risk of strokes due to slowed blood flow in the atria, especially in the left atrial appendage, which is prone to blood clot formation.","Such clots can migrate into cerebral arteries, leading to ischemic stroke.","To assess whether AF patients should be prescribed anticoagulants, doctors often use the CHA2DS2-VASc scoring system.","However, anticoagulant use must be approached with caution as it can impact clotting functions.","This study introduces a machine learning algorithm that predicts whether patients with AF should be recommended anticoagulant therapy using 12-lead ECG data.","In this model, we use STOME to enhance time-series data and then process it through a Convolutional Neural Network (CNN).","By incorporating a path development layer, the model achieves a specificity of 30.6% under the condition of an NPV of 1.","In contrast, LSTM algorithms without path development yield a specificity of only 2.7% under the same NPV condition."],"url":"http://arxiv.org/abs/2401.10014v1","category":"cs.LG"}
{"created":"2024-01-18 14:31:10","title":"Editorial note to Jean-Marie Souriau's \" On the motion of spinning particles in general relativity\"","abstract":"The gravitational interaction of (classical and quantum) spinning bodies is currently the focus of many works using a variety of approaches. This note is a comment on a short paper by Jean-Marie Souriau, now reprinted in the GRG Golden Oldies collection. Souriau's short 1970 note was a pioneering contribution to a symplectic description of the dynamics of spinning particles in general relativity which remained somewhat unnoticed. We explain the specificity of Souriau's approach and emphasize its potential interest within the current flurry of activity on the gravitational interaction of spinning particles.","sentences":["The gravitational interaction of (classical and quantum) spinning bodies is currently the focus of many works using a variety of approaches.","This note is a comment on a short paper by Jean-Marie Souriau, now reprinted in the GRG Golden Oldies collection.","Souriau's short 1970 note was a pioneering contribution to a symplectic description of the dynamics of spinning particles in general relativity which remained somewhat unnoticed.","We explain the specificity of Souriau's approach and emphasize its potential interest within the current flurry of activity on the gravitational interaction of spinning particles."],"url":"http://arxiv.org/abs/2401.10013v1","category":"gr-qc"}
