{"created":"2024-03-07 16:57:24","title":"Designing variational ansatz for quantum-enabled simulation of non-unitary dynamical evolution -- an excursion into Dicke supperradiance","abstract":"Adaptive Variational Quantum Dynamics (AVQD) algorithms offer a promising approach to providing quantum-enabled solutions for systems treated within the purview of open quantum dynamical evolution. In this study, we employ the unrestricted vectorization variant of AVQD to simulate and benchmark various non-unitarily evolving systems. We exemplify how construction of an expressible ansatz unitary and the associated operator pool can be implemented to analyze examples such as the Fenna Matthews Olson complex (FMO) and even the permutational invariant Dicke model of quantum optics. We furthermore show an efficient decomposition scheme for the ansatz used, which can extend its applications to a wide range of other open quantum system scenarios in near future. In all cases the results obtained are in excellent agreement with exact numerical computations which bolsters the effectiveness of this technique. Our successful demonstrations pave the way for utilizing this adaptive variational technique to study complex systems in chemistry and physics, like light harvesting devices, thermal, and opto mechanical switches, to name a few.","sentences":["Adaptive Variational Quantum Dynamics (AVQD) algorithms offer a promising approach to providing quantum-enabled solutions for systems treated within the purview of open quantum dynamical evolution.","In this study, we employ the unrestricted vectorization variant of AVQD to simulate and benchmark various non-unitarily evolving systems.","We exemplify how construction of an expressible ansatz unitary and the associated operator pool can be implemented to analyze examples such as the Fenna Matthews Olson complex (FMO) and even the permutational invariant Dicke model of quantum optics.","We furthermore show an efficient decomposition scheme for the ansatz used, which can extend its applications to a wide range of other open quantum system scenarios in near future.","In all cases the results obtained are in excellent agreement with exact numerical computations which bolsters the effectiveness of this technique.","Our successful demonstrations pave the way for utilizing this adaptive variational technique to study complex systems in chemistry and physics, like light harvesting devices, thermal, and opto mechanical switches, to name a few."],"url":"http://arxiv.org/abs/2403.04653v1","category":"quant-ph"}
{"created":"2024-03-07 18:14:02","title":"QRtree -- Decision Tree dialect specification of QRscript","abstract":"This specification document specifies the syntax and semantics of QRtree, which is a specific dialect of QRscript particularly suited to represent decision trees without chance nodes. The term dialect identifies one of the possible sub-languages that can be encoded inside of an eQR code via QRscript. This specification will describe an intermediate representation of QRtree, made through a language derived by the three-address code. It will then define the transformation rules from the intermediate representation to a binary code. The latter is a binary representation called eQRtreebytecode. These rules can also be applied inversely to transform the eQRtreeBytecode into the intermediate representation. This specification document will pay particular attention to the creation of a compact eQRtreebytecode, as the maximum number of bits that can be stored in a QR code is, at the time of writing, equal to 2953 bytes (in the case of QR code version 40 with a \"low\" error correction level).","sentences":["This specification document specifies the syntax and semantics of QRtree, which is a specific dialect of QRscript particularly suited to represent decision trees without chance nodes.","The term dialect identifies one of the possible sub-languages that can be encoded inside of an eQR code via QRscript.","This specification will describe an intermediate representation of QRtree, made through a language derived by the three-address code.","It will then define the transformation rules from the intermediate representation to a binary code.","The latter is a binary representation called eQRtreebytecode.","These rules can also be applied inversely to transform the eQRtreeBytecode into the intermediate representation.","This specification document will pay particular attention to the creation of a compact eQRtreebytecode, as the maximum number of bits that can be stored in a QR code is, at the time of writing, equal to 2953 bytes (in the case of QR code version 40 with a \"low\" error correction level)."],"url":"http://arxiv.org/abs/2403.04716v1","category":"cs.NI"}
{"created":"2024-03-07 16:03:12","title":"$B$-meson production at forward rapidities in $pp$ collisions at the LHC: Estimating the intrinsic bottom contribution","abstract":"The production of $B$ mesons at forward rapidities is strongly sensitive to the behavior of the gluon and bottom distribution functions for small and large values of the Bjorken-$x$ variable. In this exploratory study, we estimate the cross-section for the $B^{\\pm}$ meson production in the kinematic range probed by the LHCb detector and that will be analyzed by the future Forward Physics Facility (FPF) considering the hybrid formalism, the solution of the running coupling Balitsky-Kovchegov equation and distinct description of the bottom distribution function. We assume an ansatz for the intrinsic bottom component in the proton wave function, and estimate its impact on the transverse momentum, rapidity and Feynman-$x$ distributions. Our results indicate that the presence of an intrinsic bottom strongly modifies the magnitude of the cross-section at ultra-forward rapidities ($y \\ge 6$), which implies an enhancement of the $B^{\\pm}$ production at the FPF. Possible implications on the prompt neutrino flux at ultra-high energies are also briefly discussed.","sentences":["The production of $B$ mesons at forward rapidities is strongly sensitive to the behavior of the gluon and bottom distribution functions for small and large values of the Bjorken-$x$ variable.","In this exploratory study, we estimate the cross-section for the $B^{\\pm}$ meson production in the kinematic range probed by the LHCb detector and that will be analyzed by the future Forward Physics Facility (FPF) considering the hybrid formalism, the solution of the running coupling Balitsky-Kovchegov equation and distinct description of the bottom distribution function.","We assume an ansatz for the intrinsic bottom component in the proton wave function, and estimate its impact on the transverse momentum, rapidity and Feynman-$x$ distributions.","Our results indicate that the presence of an intrinsic bottom strongly modifies the magnitude of the cross-section at ultra-forward rapidities ($y \\ge 6$), which implies an enhancement of the $B^{\\pm}$ production at the FPF.","Possible implications on the prompt neutrino flux at ultra-high energies are also briefly discussed."],"url":"http://arxiv.org/abs/2403.04619v1","category":"hep-ph"}
{"created":"2024-03-07 14:43:24","title":"An Introduction to T-Systems -- with a special Emphasis on Sparse Moment Problems, Sparse Positivstellensätze, and Sparse Nichtnegativstellensätze","abstract":"These are the lecture notes based on [dD23] for the (upcoming) lecture \"T-systems with a special emphasis on sparse moment problems and sparse Positivstellens\\\"atze\" in the summer semester 2024 at the University of Konstanz. The main purpose of this lecture is to prove the sparse Positiv- and Nichtnegativstellens\\\"atze of Samuel Karlin (1963) and to apply them to the algebraic setting. That means given finitely many monomials, e.g. $1, x^2, x^3, x^6, x^7, x^9,$ how do all linear combinations of these look like which are strictly positive or non-negative on some interval $[a,b]$ or $[0,\\infty)$, e.g. describe and even write down all $f(x) = a_0 + a_1 x^2 + a_2 x^3 + a_3 x^6 + a_4 x^7 + a_5 x^9$ with $f(x)>0$ or $f(x)\\geq 0$ on $[a,b]$ or $[0,\\infty)$, respectively. To do this we introduce the theoretical framework in which this question can be answered: T-systems. We study these T-systems to arrive at Karlin's Positiv- and Nichtnegativstellensatz but we also do not hide the limitations of the T-systems approach. The main limitation is the Curtis$-$Mairhuber$-$Sieklucki Theorem which essentially states that every T-system is only one-dimensional and hence we can only apply these results to the univariate polynomial case. This can also be understood as a lesson or even a warning that this approach has been investigated and found to fail, i.e., learning about these results and limitations shall save students and researchers from following old footpaths which lead to a dead end. We took great care finding the correct historical references where the results appeared first but are perfectly aware that like people before we not always succeed.","sentences":["These are the lecture notes based on [dD23] for the (upcoming) lecture \"T-systems with a special emphasis on sparse moment problems and sparse Positivstellens\\\"atze\" in the summer semester 2024 at the University of Konstanz.","The main purpose of this lecture is to prove the sparse Positiv- and Nichtnegativstellens\\\"atze of Samuel Karlin (1963) and to apply them to the algebraic setting.","That means given finitely many monomials, e.g. $1, x^2, x^3, x^6, x^7, x^9,$ how do all linear combinations of these look like which are strictly positive or non-negative on some interval $","[a,b]$ or $[0,\\infty)$, e.g. describe and even write down all $f(x)","= a_0 + a_1 x^2 + a_2 x^3 + a_3 x^6 + a_4 x^7 +","a_5 x^9$ with $f(x)>0$ or $f(x)\\geq 0$ on $[a,b]$ or $[0,\\infty)$, respectively.","To do this we introduce the theoretical framework in which this question can be answered: T-systems.","We study these T-systems to arrive at Karlin's Positiv- and Nichtnegativstellensatz but we also do not hide the limitations of the T-systems approach.","The main limitation is the Curtis$-$Mairhuber$-$Sieklucki Theorem which essentially states that every T-system is only one-dimensional and hence we can only apply these results to the univariate polynomial case.","This can also be understood as a lesson or even a warning that this approach has been investigated and found to fail, i.e., learning about these results and limitations shall save students and researchers from following old footpaths which lead to a dead end.","We took great care finding the correct historical references where the results appeared first but are perfectly aware that like people before we not always succeed."],"url":"http://arxiv.org/abs/2403.04548v1","category":"math.CA"}
{"created":"2024-03-07 15:23:44","title":"A.C.I.D -- An Improved LSD Technique for Accurate Line Profile Retrieval","abstract":"Stellar activity and planetary effects induce radial velocity (RV) offsets and cause temporal distortions in the shape of the stellar line profile. Hence, accurately probing the stellar line profile offers a wealth of information on both the star itself and any orbiting planets. Typically, Cross-Correlation Functions (CCFs) are used as a proxy for the stellar line profile. The shape of CCFs, however, can be distorted by line blending and aliasing limiting the stellar and planetary physics that can be probed from them. Least-squares deconvolution (LSD) offers an alternative that directly fits the mean line profile of the spectrum to produce a high-precision profile. In this paper, we introduce our novel method ACID (Accurate Continuum fItting and Deconvolution) that builds on LSD techniques by simultaneously fitting the spectral continuum and line profile as well as performing LSD in effective optical depth. Tests on model data revealed ACID can accurately identify and correct the spectral continuum to retrieve an injected line profile. ACID was also applied to archival HARPS data obtained during the transit of HD189733b. The application of the Reloaded Rossiter-McLaughlin technique to both ACID profiles and HARPS CCFs shows ACID residual profiles improved the out-of-line RMS by over 5% compared to CCFs. Furthermore, ACID profiles are shown to exhibit a Voigt profile shape that better describes the expected profile shape of the stellar line profile. This improved representation shows that ACID better preserves the stellar and planetary physics encoded in the stellar line profile shape for slow rotating stars.","sentences":["Stellar activity and planetary effects induce radial velocity (RV) offsets and cause temporal distortions in the shape of the stellar line profile.","Hence, accurately probing the stellar line profile offers a wealth of information on both the star itself and any orbiting planets.","Typically, Cross-Correlation Functions (CCFs) are used as a proxy for the stellar line profile.","The shape of CCFs, however, can be distorted by line blending and aliasing limiting the stellar and planetary physics that can be probed from them.","Least-squares deconvolution (LSD) offers an alternative that directly fits the mean line profile of the spectrum to produce a high-precision profile.","In this paper, we introduce our novel method ACID (Accurate Continuum fItting and Deconvolution) that builds on LSD techniques by simultaneously fitting the spectral continuum and line profile as well as performing LSD in effective optical depth.","Tests on model data revealed ACID can accurately identify and correct the spectral continuum to retrieve an injected line profile.","ACID was also applied to archival HARPS data obtained during the transit of HD189733b.","The application of the Reloaded Rossiter-McLaughlin technique to both ACID profiles and HARPS CCFs shows ACID residual profiles improved the out-of-line RMS by over 5% compared to CCFs.","Furthermore, ACID profiles are shown to exhibit a Voigt profile shape that better describes the expected profile shape of the stellar line profile.","This improved representation shows that ACID better preserves the stellar and planetary physics encoded in the stellar line profile shape for slow rotating stars."],"url":"http://arxiv.org/abs/2403.04579v1","category":"astro-ph.EP"}
