{"created":"2024-04-18 17:22:10","title":"Quantum thermophoresis","abstract":"Thermophoresis is the migration of a particle due to a thermal gradient. Here, we theoretically uncover the quantum version of thermophoresis. As a proof of principle, we analytically find a thermophoretic force on a trapped quantum particle having three energy levels in $\\Lambda$ configuration. We then consider a model of N sites, each coupled to its first neighbors and subjected to a local bath at a certain temperature, so as to show numerically how quantum thermophoresis behaves with increasing delocalization of the quantum particle. We discuss how negative thermophoresis and the Dufour effect appear in the quantum regime.","sentences":["Thermophoresis is the migration of a particle due to a thermal gradient.","Here, we theoretically uncover the quantum version of thermophoresis.","As a proof of principle, we analytically find a thermophoretic force on a trapped quantum particle having three energy levels in $\\Lambda$ configuration.","We then consider a model of N sites, each coupled to its first neighbors and subjected to a local bath at a certain temperature, so as to show numerically how quantum thermophoresis behaves with increasing delocalization of the quantum particle.","We discuss how negative thermophoresis and the Dufour effect appear in the quantum regime."],"url":"http://arxiv.org/abs/2404.12346v1","category":"quant-ph"}
{"created":"2024-04-18 16:58:05","title":"A Perspective on Deep Vision Performance with Standard Image and Video Codecs","abstract":"Resource-constrained hardware, such as edge devices or cell phones, often rely on cloud servers to provide the required computational resources for inference in deep vision models. However, transferring image and video data from an edge or mobile device to a cloud server requires coding to deal with network constraints. The use of standardized codecs, such as JPEG or H.264, is prevalent and required to ensure interoperability. This paper aims to examine the implications of employing standardized codecs within deep vision pipelines. We find that using JPEG and H.264 coding significantly deteriorates the accuracy across a broad range of vision tasks and models. For instance, strong compression rates reduce semantic segmentation accuracy by more than 80% in mIoU. In contrast to previous findings, our analysis extends beyond image and action classification to localization and dense prediction tasks, thus providing a more comprehensive perspective.","sentences":["Resource-constrained hardware, such as edge devices or cell phones, often rely on cloud servers to provide the required computational resources for inference in deep vision models.","However, transferring image and video data from an edge or mobile device to a cloud server requires coding to deal with network constraints.","The use of standardized codecs, such as JPEG or H.264, is prevalent and required to ensure interoperability.","This paper aims to examine the implications of employing standardized codecs within deep vision pipelines.","We find that using JPEG and H.264 coding significantly deteriorates the accuracy across a broad range of vision tasks and models.","For instance, strong compression rates reduce semantic segmentation accuracy by more than 80% in mIoU. In contrast to previous findings, our analysis extends beyond image and action classification to localization and dense prediction tasks, thus providing a more comprehensive perspective."],"url":"http://arxiv.org/abs/2404.12330v1","category":"cs.CV"}
{"created":"2024-04-18 16:45:39","title":"Laser excitation of the $^{229}$Th nuclear isomeric transition in a solid-state host","abstract":"LiSrAlF$_6$ crystals doped with $^{229}$Th are used in a laser-based search for the nuclear isomeric transition. Two spectroscopic features near the nuclear transition energy are observed. The first is a broad excitation feature that produces red-shifted fluorescence that decays with a timescale of a few seconds. The second is a narrow, laser-linewidth-limited spectral feature at $148.38219(4)_{\\textrm{stat}}(20)_{\\textrm{sys}}$ nm ($2020407.3(5)_{\\textrm{stat}}(30)_{\\textrm{sys}}$ GHz) that decays with a lifetime of $568(13)_{\\textrm{stat}}(20)_{\\textrm{sys}}$ s. This feature is assigned to the excitation of the $^{229}$Th nuclear isomeric state, whose energy is found to be $8.355733(2)_{\\textrm{stat}}(10)_{\\textrm{sys}}$ eV in $^{229}$Th:\\thor:LiSrAlF$_6$.","sentences":["LiSrAlF$_6$ crystals doped with $^{229}$Th are used in a laser-based search for the nuclear isomeric transition.","Two spectroscopic features near the nuclear transition energy are observed.","The first is a broad excitation feature that produces red-shifted fluorescence that decays with a timescale of a few seconds.","The second is a narrow, laser-linewidth-limited spectral feature at $148.38219(4)_{\\textrm{stat}}(20)_{\\textrm{sys}}$ nm ($2020407.3(5)_{\\textrm{stat}}(30)_{\\textrm{sys}}$ GHz) that decays with a lifetime of $568(13)_{\\textrm{stat}}(20)_{\\textrm{sys}}$ s.","This feature is assigned to the excitation of the $^{229}$Th nuclear isomeric state, whose energy is found to be $8.355733(2)_{\\textrm{stat}}(10)_{\\textrm{sys}}$ eV in $^{229}$Th:\\thor:LiSrAlF$_6$."],"url":"http://arxiv.org/abs/2404.12311v1","category":"physics.atom-ph"}
{"created":"2024-04-18 16:33:01","title":"Switchable Single/Dual Edge Registers for Pipeline Architecture","abstract":"The demand for low power processing is increasing due to mobile and portable devices. In a processor unit, an adder is an important building block since it is used in Floating Point Units (FPU) and Arithmetic Logic Units (ALU). Also, pipeline techniques are used extensively to improve the throughput of the processing unit. To implement a pipeline requires adding a register at each sub-stage that result in increasing the latency. Moreover, designing a low power pipeline adder with low latency has drawn a lot of attention. In a pipelined architecture that uses Dual Edge Triggered (DET) based registers can help in reducing the latency since they can capture input data at both clock edges. However, for high input activity, a DET flip-flop consumes more power than a Single-Edge Triggered (SET) flip-flop. Moreover, it is required to replace each Flip-Flop (FF) in the processor with Dual Edge Triggered (DET) Flip-Flop which will be a considerable area and power overhead. Therefore, it is desirable to have a switchable DET to SET depending on input activity or load condition to reduce the dynamic power consumption. In this paper, we are proposing a new shift register which imitates DET FF based shift register without the need of special DET FF. The proposed shift register improved the latency in a 4-bit pipelined adder by two-fold. Additionally, the power delay product was reduced by 44.16 %.","sentences":["The demand for low power processing is increasing due to mobile and portable devices.","In a processor unit, an adder is an important building block since it is used in Floating Point Units (FPU) and Arithmetic Logic Units (ALU).","Also, pipeline techniques are used extensively to improve the throughput of the processing unit.","To implement a pipeline requires adding a register at each sub-stage that result in increasing the latency.","Moreover, designing a low power pipeline adder with low latency has drawn a lot of attention.","In a pipelined architecture that uses Dual Edge Triggered (DET) based registers can help in reducing the latency since they can capture input data at both clock edges.","However, for high input activity, a DET flip-flop consumes more power than a Single-Edge Triggered (SET) flip-flop.","Moreover, it is required to replace each Flip-Flop (FF) in the processor with Dual Edge Triggered (DET) Flip-Flop which will be a considerable area and power overhead.","Therefore, it is desirable to have a switchable DET to SET depending on input activity or load condition to reduce the dynamic power consumption.","In this paper, we are proposing a new shift register which imitates DET FF based shift register without the need of special DET FF.","The proposed shift register improved the latency in a 4-bit pipelined adder by two-fold.","Additionally, the power delay product was reduced by 44.16 %."],"url":"http://arxiv.org/abs/2404.12306v1","category":"cs.AR"}
{"created":"2024-04-18 15:15:47","title":"Effects of Reduced Interlayer Interactions on the K-point Excitons of MoS$_2$ Nanoscrolls","abstract":"Transition metal dichalcogenide (TMD) nanoscrolls (NS) exhibit significant photoluminescence (PL) signals despite their multilayer structure, which cannot be explained by the strained multilayer description of NS. Here, we investigate the interlayer interactions in NS to address this discrepancy. The reduction of interlayer interactions in NS is attributed to two factors: (1) the symmetry-broken mixed stacking order between neighbouring layers due to misalignment, and (2) the high inhomogeneity in the strain landscape resulting from the unique Archimedean spiral-like geometry with positive eccentricity. These were confirmed through transmission electron microscopy, field emission scanning electron microscopy and atomic force microscopy. To probe the effect of reduction of interlayer interactions in multilayered MoS$_2$ nanoscrolls, low-temperature PL spectroscopy was employed investigating the behaviour of K-point excitons. The effects of reduced interlayer interactions on exciton-phonon coupling (EXPC), exciton energy, and exciton oscillator strength are discussed, providing insights into the unique properties of TMD nanoscrolls.","sentences":["Transition metal dichalcogenide (TMD) nanoscrolls (NS) exhibit significant photoluminescence (PL) signals despite their multilayer structure, which cannot be explained by the strained multilayer description of NS.","Here, we investigate the interlayer interactions in NS to address this discrepancy.","The reduction of interlayer interactions in NS is attributed to two factors: (1) the symmetry-broken mixed stacking order between neighbouring layers due to misalignment, and (2) the high inhomogeneity in the strain landscape resulting from the unique Archimedean spiral-like geometry with positive eccentricity.","These were confirmed through transmission electron microscopy, field emission scanning electron microscopy and atomic force microscopy.","To probe the effect of reduction of interlayer interactions in multilayered MoS$_2$ nanoscrolls, low-temperature PL spectroscopy was employed investigating the behaviour of K-point excitons.","The effects of reduced interlayer interactions on exciton-phonon coupling (EXPC), exciton energy, and exciton oscillator strength are discussed, providing insights into the unique properties of TMD nanoscrolls."],"url":"http://arxiv.org/abs/2404.12250v1","category":"cond-mat.mes-hall"}
{"created":"2024-04-18 14:36:04","title":"Entangled states from arborescent knots","abstract":"In this paper we discuss how to use arborescent knots to construct entangled multi-qubit states. We show that Bell-states, GHZ-states and cluster states can be constructed from such knots. The latter are particularly interesting since they form a base for the measurement-based quantum computers.","sentences":["In this paper we discuss how to use arborescent knots to construct entangled multi-qubit states.","We show that Bell-states, GHZ-states and cluster states can be constructed from such knots.","The latter are particularly interesting since they form a base for the measurement-based quantum computers."],"url":"http://arxiv.org/abs/2404.12222v1","category":"hep-th"}
{"created":"2024-04-18 13:10:57","title":"The 2018 outburst of MAXI J1820+070 as seen by Insight-HXMT","abstract":"We present an analysis of the whole 2018 outburst of the black hole X-ray binary MAXI J1820+070 with Insight-HXMT data. We focus our study on the temporal evolution of the parameters of the source. We employ two different models to fit the thermal spectrum of the disk: the Newtonian model DISKBB and the relativistic model NKBB. These two models provide different pictures of the source in the soft state. With DISKBB, we find that the inner edge of the disk is close to the innermost stable circular orbit of a fast-rotating black hole and the corona changes geometry from the hard to the soft state, probably becoming compact and close to the black hole. With NKBB, we find that the disk is truncated in the soft state and that the coronal geometry does not change significantly during the whole outburst. However, we find that the model with NKBB can predict an untruncated disk around a fast-rotating black hole if we assume that the inclination angle of the disk is around 30 degrees (instead of 60 degrees, which is the inclination angle of the jet and is usually adopted as the inclination angle of the disk in the literature) and we employ a high-density reflection model. In such a case, we measure a high value of the black hole spin parameter with observations in the soft state, in agreement with the high spin value found from the analysis of the reflection features and in disagreement with the low spin value found by previous continuum-fitting method measurements with the inclination angle of the disk set to the value of the inclination angle of the jet.","sentences":["We present an analysis of the whole 2018 outburst of the black hole X-ray binary MAXI J1820+070 with Insight-HXMT data.","We focus our study on the temporal evolution of the parameters of the source.","We employ two different models to fit the thermal spectrum of the disk: the Newtonian model DISKBB and the relativistic model NKBB.","These two models provide different pictures of the source in the soft state.","With DISKBB, we find that the inner edge of the disk is close to the innermost stable circular orbit of a fast-rotating black hole and the corona changes geometry from the hard to the soft state, probably becoming compact and close to the black hole.","With NKBB, we find that the disk is truncated in the soft state and that the coronal geometry does not change significantly during the whole outburst.","However, we find that the model with NKBB can predict an untruncated disk around a fast-rotating black hole if we assume that the inclination angle of the disk is around 30 degrees (instead of 60 degrees, which is the inclination angle of the jet and is usually adopted as the inclination angle of the disk in the literature) and we employ a high-density reflection model.","In such a case, we measure a high value of the black hole spin parameter with observations in the soft state, in agreement with the high spin value found from the analysis of the reflection features and in disagreement with the low spin value found by previous continuum-fitting method measurements with the inclination angle of the disk set to the value of the inclination angle of the jet."],"url":"http://arxiv.org/abs/2404.12161v1","category":"astro-ph.HE"}
{"created":"2024-04-18 13:05:17","title":"Euclid preparation. Improving cosmological constraints using a new multi-tracer method with the spectroscopic and photometric samples","abstract":"Future data provided by the \\Euclid mission will allow us to better understand the cosmic history of the Universe. A metric of its performance is the figure-of-merit (FoM) of dark energy, usually estimated with Fisher forecasts. The expected FoM has previously been estimated taking into account the two main probes of \\Euclid, namely the three-dimensional clustering of the spectroscopic galaxy sample, and the so-called 3$\\times$2\\,pt signal from the photometric sample (i.e., the weak lensing signal, the galaxy clustering, and their cross-correlation). So far, these two probes have been treated as independent. In this paper, we introduce a new observable given by the ratio of the (angular) two-point correlation function of galaxies from the two surveys. For identical (normalised) selection functions, this observable is unaffected by sampling noise, and its variance is solely controlled by Poisson noise. We present forecasts for \\Euclid where this multi-tracer method is applied and is particularly relevant because the two surveys will cover the same area of the sky. This method allows for the exploitation of the combination of the spectroscopic and photometric samples. When the correlation between this new observable and the other probes is not taken into account, a significant gain is obtained in the FoM, as well as in the constraints on other cosmological parameters. The benefit is more pronounced for a commonly investigated modified gravity model, namely the $\\gamma$ parametrisation of the growth factor. However, the correlation between the different probes is found to be significant and hence the actual gain is uncertain. We present various strategies for circumventing this issue and still extract useful information from the new observable.","sentences":["Future data provided by the \\Euclid mission will allow us to better understand the cosmic history of the Universe.","A metric of its performance is the figure-of-merit (FoM) of dark energy, usually estimated with Fisher forecasts.","The expected FoM has previously been estimated taking into account the two main probes of \\Euclid, namely the three-dimensional clustering of the spectroscopic galaxy sample, and the so-called 3$\\times$2\\,pt signal from the photometric sample (i.e., the weak lensing signal, the galaxy clustering, and their cross-correlation).","So far, these two probes have been treated as independent.","In this paper, we introduce a new observable given by the ratio of the (angular) two-point correlation function of galaxies from the two surveys.","For identical (normalised) selection functions, this observable is unaffected by sampling noise, and its variance is solely controlled by Poisson noise.","We present forecasts for \\Euclid where this multi-tracer method is applied and is particularly relevant because the two surveys will cover the same area of the sky.","This method allows for the exploitation of the combination of the spectroscopic and photometric samples.","When the correlation between this new observable and the other probes is not taken into account, a significant gain is obtained in the FoM, as well as in the constraints on other cosmological parameters.","The benefit is more pronounced for a commonly investigated modified gravity model, namely the $\\gamma$ parametrisation of the growth factor.","However, the correlation between the different probes is found to be significant and hence the actual gain is uncertain.","We present various strategies for circumventing this issue and still extract useful information from the new observable."],"url":"http://arxiv.org/abs/2404.12157v1","category":"astro-ph.CO"}
{"created":"2024-04-18 13:00:36","title":"The birth of StatPhys: The 1949 Florence conference at the juncture of post-WWII reconstruction of national and international physics","abstract":"In spring 1949 about 70 physicists from eight countries met in Florence to discuss recent trends in statistical mechanics. This scientific gathering, co-organized by the Commission on Thermodynamics and Statistical Mechanics of the International Union of Pure and Applied Physics (IUPAP) and the Italian Physical Society (SIF), initiated a tradition of IUPAP-sponsored international conferences on statistical mechanics that lasts to this day. In 1977, when this conference series took the name of StatPhys, the foundational role of the Florence conference was recognized by retrospectively naming it StatPhys1. This paper examines the dual scientific and social significance of the conference, situating it in the broader contexts of the post-World War II reconstruction in Italian physics and of the revitalization of the international science organization. Through an analysis of IUPAP archives and Italian records, we illustrate how the event's success hinged on the aligned objectives of its organizers. Internationally, it was instrumental in defining the scientific and organizational foundations for the activities of IUPAP commissions during a critical phase of IUPAP's history, when the Union was resurging on the international stage post-interwar period inactivity. Nationally, the conference served as a cornerstone in SIF's strategy to re-establish Italian physics' international stature and to aid the domestic revitalization of physics through the internationalization of its activities, notably of its flagship journal, \\textit{Il Nuovo Cimento}. This analysis not only sheds light on the conference's impact but also informs recent discussions in the history of science about the multiple roles of international scientific conferences.","sentences":["In spring 1949 about 70 physicists from eight countries met in Florence to discuss recent trends in statistical mechanics.","This scientific gathering, co-organized by the Commission on Thermodynamics and Statistical Mechanics of the International Union of Pure and Applied Physics (IUPAP) and the Italian Physical Society (SIF), initiated a tradition of IUPAP-sponsored international conferences on statistical mechanics that lasts to this day.","In 1977, when this conference series took the name of StatPhys, the foundational role of the Florence conference was recognized by retrospectively naming it StatPhys1.","This paper examines the dual scientific and social significance of the conference, situating it in the broader contexts of the post-World War II reconstruction in Italian physics and of the revitalization of the international science organization.","Through an analysis of IUPAP archives and Italian records, we illustrate how the event's success hinged on the aligned objectives of its organizers.","Internationally, it was instrumental in defining the scientific and organizational foundations for the activities of IUPAP commissions during a critical phase of IUPAP's history, when the Union was resurging on the international stage post-interwar period inactivity.","Nationally, the conference served as a cornerstone in SIF's strategy to re-establish Italian physics' international stature and to aid the domestic revitalization of physics through the internationalization of its activities, notably of its flagship journal, \\textit{Il Nuovo Cimento}.","This analysis not only sheds light on the conference's impact but also informs recent discussions in the history of science about the multiple roles of international scientific conferences."],"url":"http://arxiv.org/abs/2404.12156v1","category":"physics.hist-ph"}
{"created":"2024-04-18 12:49:14","title":"Strong decays of the $P_{cs}(4338)$ and its high isospin cousin via the QCD sum rules","abstract":"In the present work, the strong decays of the newly observed $P_{cs}(4338)$ as well as its high isospin cousin $P_{cs}(4460)$ are studied via the QCD sum rules. According to conservation of isospin, spin and parity, the hadronic coupling constants in four decay channels are obtained, then the partial decay widths are obtained. The total width of the $P_{cs}(4338)$ coincides with the experimental data nicely, while the predictions for the $P_{cs}(4460)$ can be testified in the future experiment, and shed light on the nature of the $P_{cs}(4338)$.","sentences":["In the present work, the strong decays of the newly observed $P_{cs}(4338)$ as well as its high isospin cousin $P_{cs}(4460)$ are studied via the QCD sum rules.","According to conservation of isospin, spin and parity, the hadronic coupling constants in four decay channels are obtained, then the partial decay widths are obtained.","The total width of the $P_{cs}(4338)$ coincides with the experimental data nicely, while the predictions for the $P_{cs}(4460)$ can be testified in the future experiment, and shed light on the nature of the $P_{cs}(4338)$."],"url":"http://arxiv.org/abs/2404.12146v1","category":"hep-ph"}
{"created":"2024-04-18 12:11:58","title":"Controlling 4f antiferromagnetic dynamics via itinerant electronic susceptibility","abstract":"Optical manipulation of magnetism holds promise for future ultrafast spintronics, especially with lanthanides and their huge, localized 4f magnetic moments. These moments interact indirectly via the conduction electrons (RKKY exchange), influenced by interatomic orbital overlap, and the conduction electron susceptibility. Here, we study this influence in a series of 4f antiferromagnets, GdT2Si2 (T=Co, Rh, Ir), using ultrafast resonant X-ray diffraction. We observe a twofold increase in ultrafast angular momentum transfer between the materials, originating from modifications in the conduction electron susceptibility, as confirmed by first-principles calculations.","sentences":["Optical manipulation of magnetism holds promise for future ultrafast spintronics, especially with lanthanides and their huge, localized 4f magnetic moments.","These moments interact indirectly via the conduction electrons (RKKY exchange), influenced by interatomic orbital overlap, and the conduction electron susceptibility.","Here, we study this influence in a series of 4f antiferromagnets, GdT2Si2 (T=Co, Rh, Ir), using ultrafast resonant X-ray diffraction.","We observe a twofold increase in ultrafast angular momentum transfer between the materials, originating from modifications in the conduction electron susceptibility, as confirmed by first-principles calculations."],"url":"http://arxiv.org/abs/2404.12119v1","category":"cond-mat.mtrl-sci"}
{"created":"2024-04-18 11:31:28","title":"Higgs Inflation in Unimodular Gravity","abstract":"The discovery of Higgs mechanism within the context of spontaneous symmetry breaking has offered a new perspective on the early time cosmic inflation and also on the relationship between elementary particles and dark energy, believed to drive the universe's accelerating expansion. We suggest an inflation scenario driven by the Higgs boson within the framework of unimodular gravity, where the Higgs field acts as the inflaton and has a significant non-minimal coupling to the gravity. We present a detailed analysis of the problem in the Jordan and then Einstein frame for a unimodular Higgs inflation, followed by a comparison of our findings with the Cosmic Microwave Background observations made by the Planck Collaboration and other joint data sets. Therefore, new constraints are imposed on the non-minimal coupling parameter, $\\xi$, by determining the magnitudes required for effective cosmic inflation. We demonstrate that a substantial non-minimal coupling of order $\\xi\\sim 10^{2}-10^{4}$ is required for this model to match with the observed primordial spectrum.","sentences":["The discovery of Higgs mechanism within the context of spontaneous symmetry breaking has offered a new perspective on the early time cosmic inflation and also on the relationship between elementary particles and dark energy, believed to drive the universe's accelerating expansion.","We suggest an inflation scenario driven by the Higgs boson within the framework of unimodular gravity, where the Higgs field acts as the inflaton and has a significant non-minimal coupling to the gravity.","We present a detailed analysis of the problem in the Jordan and then Einstein frame for a unimodular Higgs inflation, followed by a comparison of our findings with the Cosmic Microwave Background observations made by the Planck Collaboration and other joint data sets.","Therefore, new constraints are imposed on the non-minimal coupling parameter, $\\xi$, by determining the magnitudes required for effective cosmic inflation.","We demonstrate that a substantial non-minimal coupling of order $\\xi\\sim 10^{2}-10^{4}$ is required for this model to match with the observed primordial spectrum."],"url":"http://arxiv.org/abs/2404.12099v1","category":"hep-th"}
{"created":"2024-04-18 10:27:03","title":"Solitonic ground state in supersymmetric theory in background","abstract":"A solitonic ground state called a chiral soliton lattice (CSL) is realized in a supersymmetric theory with background magnetic field and finite chemical potential. To this end, we construct, in the superfield formalism, a supersymmetric chiral sine-Gordon model as a neutral pion sector of a supersymmetric two-flavor chiral Lagrangian with a Wess-Zumino-Witten term. The CSL ground state appears in the presence of either a strong magnetic field and/or large chemical potential, or a background fermionic condensate in the form of a fermion bilinear consisting of the gaugino and a superpartner of a baryon gauge field.","sentences":["A solitonic ground state called a chiral soliton lattice (CSL) is realized in a supersymmetric theory with background magnetic field and finite chemical potential.","To this end, we construct, in the superfield formalism, a supersymmetric chiral sine-Gordon model as a neutral pion sector of a supersymmetric two-flavor chiral Lagrangian with a Wess-Zumino-Witten term.","The CSL ground state appears in the presence of either a strong magnetic field and/or large chemical potential, or a background fermionic condensate in the form of a fermion bilinear consisting of the gaugino and a superpartner of a baryon gauge field."],"url":"http://arxiv.org/abs/2404.12066v1","category":"hep-th"}
{"created":"2024-04-18 09:59:50","title":"tt+X measurements by CMS and ATLAS","abstract":"These proceedings present the observation of the 4-top production process and the latest results of the production of top-quark pairs associated with W and $\\gamma$ bosons ($t\\bar{t}W$ and $t\\bar{t}\\gamma$) and b jets ($t\\bar{t}b\\bar{b}$) at a collision energy of 13 TeV carried out by the CMS and ATLAS Collaborations.","sentences":["These proceedings present the observation of the 4-top production process and the latest results of the production of top-quark pairs associated with W and $\\gamma$ bosons ($t\\bar{t}W$ and $t\\bar{t}\\gamma$) and b jets ($t\\bar{t}b\\bar{b}$) at a collision energy of 13 TeV carried out by the CMS and ATLAS Collaborations."],"url":"http://arxiv.org/abs/2404.12046v1","category":"hep-ex"}
{"created":"2024-04-18 09:46:25","title":"Uncovering Safety Risks in Open-source LLMs through Concept Activation Vector","abstract":"Current open-source large language models (LLMs) are often undergone careful safety alignment before public release. Some attack methods have also been proposed that help check for safety vulnerabilities in LLMs to ensure alignment robustness. However, many of these methods have moderate attack success rates. Even when successful, the harmfulness of their outputs cannot be guaranteed, leading to suspicions that these methods have not accurately identified the safety vulnerabilities of LLMs. In this paper, we introduce a LLM attack method utilizing concept-based model explanation, where we extract safety concept activation vectors (SCAVs) from LLMs' activation space, enabling efficient attacks on well-aligned LLMs like LLaMA-2, achieving near 100% attack success rate as if LLMs are completely unaligned. This suggests that LLMs, even after thorough safety alignment, could still pose potential risks to society upon public release. To evaluate the harmfulness of outputs resulting with various attack methods, we propose a comprehensive evaluation method that reduces the potential inaccuracies of existing evaluations, and further validate that our method causes more harmful content. Additionally, we discover that the SCAVs show some transferability across different open-source LLMs.","sentences":["Current open-source large language models (LLMs) are often undergone careful safety alignment before public release.","Some attack methods have also been proposed that help check for safety vulnerabilities in LLMs to ensure alignment robustness.","However, many of these methods have moderate attack success rates.","Even when successful, the harmfulness of their outputs cannot be guaranteed, leading to suspicions that these methods have not accurately identified the safety vulnerabilities of LLMs.","In this paper, we introduce a LLM attack method utilizing concept-based model explanation, where we extract safety concept activation vectors (SCAVs) from LLMs' activation space, enabling efficient attacks on well-aligned LLMs like LLaMA-2, achieving near 100% attack success rate as if LLMs are completely unaligned.","This suggests that LLMs, even after thorough safety alignment, could still pose potential risks to society upon public release.","To evaluate the harmfulness of outputs resulting with various attack methods, we propose a comprehensive evaluation method that reduces the potential inaccuracies of existing evaluations, and further validate that our method causes more harmful content.","Additionally, we discover that the SCAVs show some transferability across different open-source LLMs."],"url":"http://arxiv.org/abs/2404.12038v1","category":"cs.CL"}
{"created":"2024-04-18 08:55:45","title":"First-principles study of phase transition in cadmium titanate by molecular dynamics incorporating nuclear quantum effects","abstract":"First-principles molecular dynamics (FPMD) simulations were applied for the paraelectric-ferroelectric phase transition in the perovskite-type cadmium titanate, CdTiO3. Since the phase transition is reported to occur at the low temperature around 80 K, the quantum thermal bath (QTB) method was utilized in this study, which incorporates the nuclear quantum effects (NQEs). The structural evolutions in the QTB-FPMD simulations are in reasonable agreement with the experimental results, by contrast in the conventional FPMD simulations using the classical thermal bath (CTB-FPMD). According to our phonon calculations, volume expansion is the key in the stabilization of the ferroelectric phase at low temperatures, which was well reproduced in the QTB-FPMD with the NQEs. Thus, the NQEs are of importance in phase transitions at low temperatures, particularly below the room temperature, and the QTB is useful in that it incorporates the NQEs in MD simulations with low computational costs comparable to the conventional CTB.","sentences":["First-principles molecular dynamics (FPMD) simulations were applied for the paraelectric-ferroelectric phase transition in the perovskite-type cadmium titanate, CdTiO3.","Since the phase transition is reported to occur at the low temperature around 80 K, the quantum thermal bath (QTB) method was utilized in this study, which incorporates the nuclear quantum effects (NQEs).","The structural evolutions in the QTB-FPMD simulations are in reasonable agreement with the experimental results, by contrast in the conventional FPMD simulations using the classical thermal bath (CTB-FPMD).","According to our phonon calculations, volume expansion is the key in the stabilization of the ferroelectric phase at low temperatures, which was well reproduced in the QTB-FPMD with the NQEs.","Thus, the NQEs are of importance in phase transitions at low temperatures, particularly below the room temperature, and the QTB is useful in that it incorporates the NQEs in MD simulations with low computational costs comparable to the conventional CTB."],"url":"http://arxiv.org/abs/2404.12004v1","category":"cond-mat.mtrl-sci"}
{"created":"2024-04-18 08:52:22","title":"Comparing the three-dimensional morphological asymmetries in the ejecta of Kepler and Tycho in X-rays","abstract":"Recent simulations have shown that asymmetries in the ejecta distribution of supernova remnants (SNRs) may be a reflection of asymmetries left over from the initial supernova explosion. Thus, SNR studies provide a vital means for testing and constraining model predictions in relation to the distribution of heavy elements, which are key to improving our understanding of the explosion mechanisms in Type Ia supernovae.   The use of a novel blind source separation method applied to the megasecond X-ray observations of the historic Kepler and Tycho supernova remnants has revealed maps of the ejecta distribution. These maps are endowed with an unprecedented level of detail and clear separations from the continuum emission. Our method also provides a three-dimensional (3D) view of the ejecta by individually disentangling red- and blueshifted spectral components associated with images of the Si, S, Ar, Ca, and Fe emission. This approach provides insights into the morphology of the ejecta distribution in those two remnants.   Those mappings have allowed us to thoroughly investigate the asymmetries in the intermediate-mass elements and Fe distribution in two Type Ia supernova remnants. We also compared the results with the core-collapse Cassiopeia A remnant, which we had studied previously. The images obtained confirm, as expected for Type Ia SNRs, that the Fe distribution is mostly closer to the core than that of intermediate-mass elements. They also highlight peculiar features in the ejecta distribution, such as the Fe-rich southeastern knot in Tycho.","sentences":["Recent simulations have shown that asymmetries in the ejecta distribution of supernova remnants (SNRs) may be a reflection of asymmetries left over from the initial supernova explosion.","Thus, SNR studies provide a vital means for testing and constraining model predictions in relation to the distribution of heavy elements, which are key to improving our understanding of the explosion mechanisms in Type Ia supernovae.   ","The use of a novel blind source separation method applied to the megasecond X-ray observations of the historic Kepler and Tycho supernova remnants has revealed maps of the ejecta distribution.","These maps are endowed with an unprecedented level of detail and clear separations from the continuum emission.","Our method also provides a three-dimensional (3D) view of the ejecta by individually disentangling red- and blueshifted spectral components associated with images of the Si, S, Ar, Ca, and Fe emission.","This approach provides insights into the morphology of the ejecta distribution in those two remnants.   ","Those mappings have allowed us to thoroughly investigate the asymmetries in the intermediate-mass elements and Fe distribution in two Type Ia supernova remnants.","We also compared the results with the core-collapse Cassiopeia A remnant, which we had studied previously.","The images obtained confirm, as expected for Type Ia SNRs, that the Fe distribution is mostly closer to the core than that of intermediate-mass elements.","They also highlight peculiar features in the ejecta distribution, such as the Fe-rich southeastern knot in Tycho."],"url":"http://arxiv.org/abs/2404.12002v1","category":"astro-ph.HE"}
{"created":"2024-04-18 08:36:21","title":"Single-channel, single-energy partial-wave analysis with continuity improved through minimal phase constraints","abstract":"Single-energy partial-wave analysis has often been applied as a way to fit data with minimal model dependence. However, remaining unconstrained, partial waves at neighboring energies will vary discontinuously because the overall amplitude phase cannot be determined through single-channel measurements. This problem can be mitigated through the use of a constraining penalty function based on an associated energy-dependent fit. However, the weight given to this constraint results in a biased fit to the data. In this paper, for the first time, we explore a constraining function which does not influence the fit to data. The constraint comes from the overall phase found in multi-channel fits which, in the present study, are the Bonn-Gatchina and J\\\"ulich-Bonn multi-channel analyses. The data are well reproduced and weighting of the penalty function does not influence the result. The method is applied to $K \\Lambda$ photoproduction data and all observables can be maximally well reproduced. While the employed multi-channel analyses display very different multipole amplitudes, we show that the major difference between two sets of multipoles can be related to the different overall phases.","sentences":["Single-energy partial-wave analysis has often been applied as a way to fit data with minimal model dependence.","However, remaining unconstrained, partial waves at neighboring energies will vary discontinuously because the overall amplitude phase cannot be determined through single-channel measurements.","This problem can be mitigated through the use of a constraining penalty function based on an associated energy-dependent fit.","However, the weight given to this constraint results in a biased fit to the data.","In this paper, for the first time, we explore a constraining function which does not influence the fit to data.","The constraint comes from the overall phase found in multi-channel fits which, in the present study, are the Bonn-Gatchina and J\\\"ulich-Bonn multi-channel analyses.","The data are well reproduced and weighting of the penalty function does not influence the result.","The method is applied to $K \\Lambda$ photoproduction data and all observables can be maximally well reproduced.","While the employed multi-channel analyses display very different multipole amplitudes, we show that the major difference between two sets of multipoles can be related to the different overall phases."],"url":"http://arxiv.org/abs/2404.11990v1","category":"nucl-th"}
{"created":"2024-04-18 07:13:30","title":"Generation of Ultrarelativistic Vortex Leptons with Large Orbital Angular Momenta","abstract":"Ultrarelativistic vortex leptons with intrinsic orbital angular momenta (OAM) have important applications in high energy particle physics, nuclear physics, astrophysics, etc. However, unfortunately, their generation still poses a great challenge. Here, we put forward a novel method for generating ultrarelativistic vortex positrons and electrons through nonlinear Breit-Wheeler (NBW) scattering of vortex $\\gamma$ photons. For the first time, a complete angular momentum-resolved scattering theory has been formulated, introducing the angular momentum of laser photons and vortex particles into the conventional NBW scattering framework. We find that vortex positron (electron) can be produced when the outgoing electron (positron) is generated along the collision axis. By unveiling the angular momentum transfer mechanism, we clarify that OAM of the $\\gamma$ photon and angular momenta of multiple laser photons are entirely transferred to the generated pairs, leading to the production of ultrarelativistic vortex positrons or electrons with large OAM. Furthermore, we find that the cone opening angle and superposition state of the vortex $\\gamma$ photon, distinct characteristics aside from its intrinsic OAM, can be determined via the angular distribution of created pairs in NBW processes. Our method paves the way for investigating strong-field quantum electrodynamics processes concerning the generation and detection of vortex particle beams in intense lasers.","sentences":["Ultrarelativistic vortex leptons with intrinsic orbital angular momenta (OAM) have important applications in high energy particle physics, nuclear physics, astrophysics, etc.","However, unfortunately, their generation still poses a great challenge.","Here, we put forward a novel method for generating ultrarelativistic vortex positrons and electrons through nonlinear Breit-Wheeler (NBW) scattering of vortex $\\gamma$ photons.","For the first time, a complete angular momentum-resolved scattering theory has been formulated, introducing the angular momentum of laser photons and vortex particles into the conventional NBW scattering framework.","We find that vortex positron (electron) can be produced when the outgoing electron (positron) is generated along the collision axis.","By unveiling the angular momentum transfer mechanism, we clarify that OAM of the $\\gamma$ photon and angular momenta of multiple laser photons are entirely transferred to the generated pairs, leading to the production of ultrarelativistic vortex positrons or electrons with large OAM.","Furthermore, we find that the cone opening angle and superposition state of the vortex $\\gamma$ photon, distinct characteristics aside from its intrinsic OAM, can be determined via the angular distribution of created pairs in NBW processes.","Our method paves the way for investigating strong-field quantum electrodynamics processes concerning the generation and detection of vortex particle beams in intense lasers."],"url":"http://arxiv.org/abs/2404.11952v1","category":"hep-ph"}
{"created":"2024-04-18 07:10:20","title":"Pair density waves in the strong-coupling two-dimensional Holstein-Hubbard model: a variational Monte Carlo study","abstract":"A robust theory of the mechanism of pair density wave (PDW) superconductivity (i.e. where Cooper pairs have nonzero center of mass momentum) remains elusive. Here we explore the triangular lattice $t$-$J$-$V$ model, a low-energy effective theory derived from the strong-coupling limit of the Holstein-Hubbard model, by large-scale variational Monte Carlo simulations. When the electron density is sufficiently low, the favored ground state is an s-wave PDW, consistent with results obtained from previous studies in this limit. Additionally, a PDW ground state with nematic d-wave pairing emerges in intermediate range of electron densities and phonon frequencies. For these s-wave and d-wave PDWs arising in states with spontaneous breaking of time-reversal and inversion symmetries, PDW formation derives from valley-polarization and intra-pocket pairing.","sentences":["A robust theory of the mechanism of pair density wave (PDW) superconductivity (i.e. where Cooper pairs have nonzero center of mass momentum) remains elusive.","Here we explore the triangular lattice $t$-$J$-$V$ model, a low-energy effective theory derived from the strong-coupling limit of the Holstein-Hubbard model, by large-scale variational Monte Carlo simulations.","When the electron density is sufficiently low, the favored ground state is an s-wave PDW, consistent with results obtained from previous studies in this limit.","Additionally, a PDW ground state with nematic d-wave pairing emerges in intermediate range of electron densities and phonon frequencies.","For these s-wave and d-wave PDWs arising in states with spontaneous breaking of time-reversal and inversion symmetries, PDW formation derives from valley-polarization and intra-pocket pairing."],"url":"http://arxiv.org/abs/2404.11950v1","category":"cond-mat.str-el"}
{"created":"2024-04-18 07:02:57","title":"Coherent Inverse Compton Scattering in Fast Radio Bursts Revisited","abstract":"Growing observations of temporal, spectral, and polarization properties of fast radio bursts (FRBs) indicate that the radio emission of the majority of bursts is likely produced inside the magnetosphere of its central engine, likely a magnetar. We revisit the idea that FRBs are generated via coherent inverse Compton scattering (ICS) off low-frequency X-mode electromagnetic waves (fast magnetosonic waves) by bunches at a distance of a few hundred times of the magnetar radius. Following findings are revealed: 1. Crustal oscillations during a flaring event would excite kHz Alfv\\'en waves. Fast magnetosonic waves with the same frequency can be generated directly or be converted from Alfv\\'en waves at a large radius, with an amplitude large enough to power FRBs via the ICS process. 2. The cross section increases rapidly with radius and significant ICS can occur at $r \\gtrsim 100 R_\\star$ with emission power much greater than the curvature radiation power but still in the linear scattering regime. 3. The low-frequency fast magnetosonic waves naturally redistribute a fluctuating relativistic plasma in the charge-depleted region to form bunches with the right size to power FRBs. 4. The required bunch net charge density can be sub-Goldreich-Julian, which allows a strong parallel electric field to accelerate the charges, maintain the bunches, and continuously power FRB emission. 5. This model can account for a wide range of observed properties of repeating FRB bursts, including high degrees of linear and circular polarization and narrow spectra as observed in many bursts from repeating FRB sources.","sentences":["Growing observations of temporal, spectral, and polarization properties of fast radio bursts (FRBs) indicate that the radio emission of the majority of bursts is likely produced inside the magnetosphere of its central engine, likely a magnetar.","We revisit the idea that FRBs are generated via coherent inverse Compton scattering (ICS) off low-frequency X-mode electromagnetic waves (fast magnetosonic waves) by bunches at a distance of a few hundred times of the magnetar radius.","Following findings are revealed: 1.","Crustal oscillations during a flaring event would excite kHz Alfv\\'en waves.","Fast magnetosonic waves with the same frequency can be generated directly or be converted from Alfv\\'en waves at a large radius, with an amplitude large enough to power FRBs via the ICS process.","2.","The cross section increases rapidly with radius and significant ICS can occur at $r \\gtrsim 100 R_\\star$ with emission power much greater than the curvature radiation power but still in the linear scattering regime.","3.","The low-frequency fast magnetosonic waves naturally redistribute a fluctuating relativistic plasma in the charge-depleted region to form bunches with the right size to power FRBs.","4.","The required bunch net charge density can be sub-Goldreich-Julian, which allows a strong parallel electric field to accelerate the charges, maintain the bunches, and continuously power FRB emission.","5.","This model can account for a wide range of observed properties of repeating FRB bursts, including high degrees of linear and circular polarization and narrow spectra as observed in many bursts from repeating FRB sources."],"url":"http://arxiv.org/abs/2404.11948v1","category":"astro-ph.HE"}
{"created":"2024-04-18 06:21:10","title":"Cosmological Inflation and Dark Sector from 11D Supergravity","abstract":"We explore compactifications of the form of three tori and one circle in the framework of 11D supergravity. By imposing suitable gauge conditions and boundary conditions, we find that the four-dimensional FRW universe emerges as a solution representing cosmological D3-branes in the eleven-dimensional bulk. These specific compactification methods can produce cosmological inflation that aligns with the observational constraints set by the 2021 BICEP/Keck and Planck 2018 results. In the cosmological inflation models we construct, the inflaton can be interpreted as the conformal vibrations of extra dimensions with a size around 10^5 times the reduced Planck length. Additionally, we offer the theoretical predictions for the mass of the inflaton, and the tree-level Newton's gravity law between two massive point particles surrounded by a spherically symmetric distribution of the inflaton, which can reproduce the Tully-Fisher relation and explain the flat rotation curves of galaxies.","sentences":["We explore compactifications of the form of three tori and one circle in the framework of 11D supergravity.","By imposing suitable gauge conditions and boundary conditions, we find that the four-dimensional FRW universe emerges as a solution representing cosmological D3-branes in the eleven-dimensional bulk.","These specific compactification methods can produce cosmological inflation that aligns with the observational constraints set by the 2021 BICEP/Keck and Planck 2018 results.","In the cosmological inflation models we construct, the inflaton can be interpreted as the conformal vibrations of extra dimensions with a size around 10^5 times the reduced Planck length.","Additionally, we offer the theoretical predictions for the mass of the inflaton, and the tree-level Newton's gravity law between two massive point particles surrounded by a spherically symmetric distribution of the inflaton, which can reproduce the Tully-Fisher relation and explain the flat rotation curves of galaxies."],"url":"http://arxiv.org/abs/2404.11933v1","category":"hep-th"}
{"created":"2024-04-18 06:19:33","title":"Study of structure of deuteron from analysis of bremsstrahlung emission in proton-deuteron scattering in cluster models","abstract":"Purpose: In this paper we investigated emission of bremsstrahlung photons in the scattering of protons off deuterons within the microscopic cluster models in a wide region of the beam energy from low energies up to 1.5 GeV. Methods: Three-cluster model of bremsstrahlung is constructed for such a reaction. Formalism of the model includes form factor of deuteron which characterizes dependence of bremsstrahlung cross sections on structure of deuteron. This gives possibility to investigate the structure of nuclei from analysis of bremsstrahlung cross sections. Results: We studied dependence of the bremsstrahlung cross section on the structure of deuteron. We use three different shapes of the deuteron wave functions. Besides, we also calculate the cross section by neglecting internal structure of deuteron. Analysis of dependence of the cross section on such a parameter shows the following. (1) At beam energies 145 and 195 MeV used in experiments bremsstrahlung cross section is not sensitive visibly on variations of the shape of the deuteron wave functions. (2) Stable difference between cross sections calculated with and without internal structure of deuteron is observed at higher energy of beam (larger 500 MeV). (3) The spectrum is increased as we pass from structureless deuteron (the oscillator length $b=0$) to the deuteron discribed by the shell-model wave function (the realistic oscillator length) inside the full energy region of the emitted photons. Conclusion: Our cluster model is a suitable tool to study the structure of deuteron with high enough precision from bremsstrahlung analysis. We propose new experiments for such an investigation.","sentences":["Purpose: In this paper we investigated emission of bremsstrahlung photons in the scattering of protons off deuterons within the microscopic cluster models in a wide region of the beam energy from low energies up to 1.5 GeV. Methods: Three-cluster model of bremsstrahlung is constructed for such a reaction.","Formalism of the model includes form factor of deuteron which characterizes dependence of bremsstrahlung cross sections on structure of deuteron.","This gives possibility to investigate the structure of nuclei from analysis of bremsstrahlung cross sections.","Results:","We studied dependence of the bremsstrahlung cross section on the structure of deuteron.","We use three different shapes of the deuteron wave functions.","Besides, we also calculate the cross section by neglecting internal structure of deuteron.","Analysis of dependence of the cross section on such a parameter shows the following.","(1) At beam energies 145 and 195 MeV used in experiments bremsstrahlung cross section is not sensitive visibly on variations of the shape of the deuteron wave functions.","(2) Stable difference between cross sections calculated with and without internal structure of deuteron is observed at higher energy of beam (larger 500 MeV).","(3) The spectrum is increased as we pass from structureless deuteron (the oscillator length $b=0$) to the deuteron discribed by the shell-model wave function (the realistic oscillator length) inside the full energy region of the emitted photons.","Conclusion: Our cluster model is a suitable tool to study the structure of deuteron with high enough precision from bremsstrahlung analysis.","We propose new experiments for such an investigation."],"url":"http://arxiv.org/abs/2404.11930v1","category":"nucl-th"}
{"created":"2024-04-18 05:31:23","title":"Time Flow and Flavor Mixing in the Flavor Spin Theory","abstract":"We show that in the flavor spin theories (theories with non-Euclidean signature of the kinematic quadratic term of the Lagrangian) for physical mass eigenstates the transition from the interaction to the mass eigenstate basis is constrained. In the corresponding modification of the SM the constraints result in the experimentally observed textures of both lepton and quark flavor mixing matrices. Furthermore, the number of real mixing parameters is reduced by one for each of the quark and lepton sectors. In addition some pairs of elements of V_CKM and separately U_PMNS must have the same absolute values. The equalities are observed experimentally within the error bounds. Apart from its imprint on the flavor mixing the modified SM is identical to the SM.","sentences":["We show that in the flavor spin theories (theories with non-Euclidean signature of the kinematic quadratic term of the Lagrangian) for physical mass eigenstates the transition from the interaction to the mass eigenstate basis is constrained.","In the corresponding modification of the SM the constraints result in the experimentally observed textures of both lepton and quark flavor mixing matrices.","Furthermore, the number of real mixing parameters is reduced by one for each of the quark and lepton sectors.","In addition some pairs of elements of V_CKM and separately U_PMNS must have the same absolute values.","The equalities are observed experimentally within the error bounds.","Apart from its imprint on the flavor mixing the modified SM is identical to the SM."],"url":"http://arxiv.org/abs/2404.11914v1","category":"hep-ph"}
{"created":"2024-04-18 05:26:14","title":"General Relativity from Intersection Theory","abstract":"This paper combines the post-Minkowskian expansion of general relativity with the language of intersection theory. Due to the nature of the soft limit inherent to the post-Minkowskian expansion, the intersection-based approach is of enhanced utility in that theory compared to a generic QFT. In the language of intersection theory, Feynman integrals are rephrased in terms of twisted cocycles. The intersection number is a pairing between two such cocycles and its existence allows for the direct projection onto a basis of master integrals. In this paper we use this approach to compute the 2PM contribution to the scattering of two compact astronomical objects, getting results in agreement with previous findings.","sentences":["This paper combines the post-Minkowskian expansion of general relativity with the language of intersection theory.","Due to the nature of the soft limit inherent to the post-Minkowskian expansion, the intersection-based approach is of enhanced utility in that theory compared to a generic QFT.","In the language of intersection theory, Feynman integrals are rephrased in terms of twisted cocycles.","The intersection number is a pairing between two such cocycles and its existence allows for the direct projection onto a basis of master integrals.","In this paper we use this approach to compute the 2PM contribution to the scattering of two compact astronomical objects, getting results in agreement with previous findings."],"url":"http://arxiv.org/abs/2404.11913v1","category":"gr-qc"}
{"created":"2024-04-18 04:51:35","title":"Systematic shell-model analysis of $2νββ$ decay of $^{76}$Ge and $^{96}$Zr to the ground and excited states of $^{76}$Se and $^{96}$Mo","abstract":"In this work, we have studied the $2\\nu\\beta\\beta$ decay of $^{76}$Ge and $^{96}$Zr isotopes utilizing large-scale shell-model calculations. The GWBXG effective interaction has been employed in the calculation of $2\\nu\\beta\\beta$-decay nuclear matrix elements (NMEs). We have tested the effective interaction by comparing the predicted spectroscopic properties, such as energy spectra and transition probabilities, with the available experimental data. The variation of cumulative NMEs with respect to the $1^+$ state energies of the intermediate nucleus is also studied, corresponding to $0^+_{\\rm g.s}\\rightarrow0^+_{\\rm g.s}$, $0^+_{\\rm g.s}\\rightarrow0^+_{2}$, and $0^+_{\\rm g.s}\\rightarrow2^+_{1}$ transitions between the parent and granddaughter nuclei. The extracted half-lives using the shell-model predicted NMEs show good agreement with the recent experimental data. The comparison of the shell-model predicted NMEs with previous NMEs available in the literature is discussed. Also, the computed branching ratios for the $2\\nu\\beta\\beta$ decay of $^{76}$Ge and both the $2\\nu\\beta\\beta$ and single-$\\beta$ decay of $^{96}$Zr are reported.","sentences":["In this work, we have studied the $2\\nu\\beta\\beta$ decay of $^{76}$Ge and $^{96}$Zr isotopes utilizing large-scale shell-model calculations.","The GWBXG effective interaction has been employed in the calculation of $2\\nu\\beta\\beta$-decay nuclear matrix elements (NMEs).","We have tested the effective interaction by comparing the predicted spectroscopic properties, such as energy spectra and transition probabilities, with the available experimental data.","The variation of cumulative NMEs with respect to the $1^+$ state energies of the intermediate nucleus is also studied, corresponding to $0^+_{\\rm g.s}\\rightarrow0^+_{\\rm g.s}$, $0^+_{\\rm g.s}\\rightarrow0^+_{2}$, and $0^+_{\\rm g.s}\\rightarrow2^+_{1}$ transitions between the parent and granddaughter nuclei.","The extracted half-lives using the shell-model predicted NMEs show good agreement with the recent experimental data.","The comparison of the shell-model predicted NMEs with previous NMEs available in the literature is discussed.","Also, the computed branching ratios for the $2\\nu\\beta\\beta$ decay of $^{76}$Ge and both the $2\\nu\\beta\\beta$ and single-$\\beta$ decay of $^{96}$Zr are reported."],"url":"http://arxiv.org/abs/2404.11896v1","category":"nucl-th"}
{"created":"2024-04-18 04:36:56","title":"Dark supernova remnant buried in the Galactic-Centre \"Brick\" G0.253+0.016 revealed by an expanding CO-line bubble","abstract":"We performed a $^{12}$CO- and $^{13}$CO($J=1-0$)-line study of the \"Brick\" (G0.253+0.016) in the Galactic Centre (GC) by analyzing the archival data obtained with the Nobeyama 45-m telescope. We present kinematics and molecular gas distributions in the longitude-velocity diagrams, and suggest that the Brick is located along the GC Arm I in the central molecular zone (CMZ) in front of the GC, which yields a distance of 8 kpc and GC radius 0.2 kpc. The major and minor-axis diameters of the Brick are $D_x\\times D_y=8.4 \\ {\\rm pc} \\times 4.1 \\ {\\rm pc}$, and the scale radius is $r_{\\rm bri}=\\sqrt{D_x D_y}=2.96$ pc. The molecular mass inferred from the CO-line integrated intensity is $M_{\\rm brixco} \\sim 5.1\\times 10^4 M_\\odot$ for a conversion factor $X_{\\rm gc}=1.0\\times 10^{20}$ H$_2$ cm$^{-2}$ [K km s$^{-1}$]$^{-1}$, while the Virial mass for the velocity dispersion of $\\sigma_v=10.0 $ km s $^{-1}$ is calculated to be $M_{\\rm brivir}\\sim 6.8 \\times 10^4 \\ M_\\odot$, which yields a new conversion factor of $X_{\\rm bri} =1.3\\times 10^{20}$ H$_2$ cm$^{-2}$ [K km s$^{-1}$]$^{-1}$. No thermal radio emission indicative of HII region and star formation is found in radio-continuum archive. The Brick's center has a cavity surrounded by a spherical molecular bubble of radius $r_{\\rm bub}=1.85$ pc and mass $\\sim 1.7\\times 10^4 M_\\odot$ expanding at $v_{\\rm exp}=10$ km s$^{-1}$ with kinetic energy of $E_0\\sim 1.7\\times 10^{49}$ erg. If the bubble is approximated by an adiabatic spherical shock wave, its age is $t\\sim 2/5 r_{\\rm bub}/v_{\\rm exp}\\sim 7.2\\times 10^4$ y. We suggest that the bubble will be a dark supernova remnant buried in the dense molecular cloud. The Brick, therefore, experienced massive-star formation followed by a supernova explosion more than $\\sim 10^5$ y ago.","sentences":["We performed a $^{12}$CO- and $^{13}$CO($J=1-0$)-line study of the \"Brick\" (G0.253+0.016) in the Galactic Centre (GC) by analyzing the archival data obtained with the Nobeyama 45-m telescope.","We present kinematics and molecular gas distributions in the longitude-velocity diagrams, and suggest that the Brick is located along the GC Arm I in the central molecular zone (CMZ) in front of the GC, which yields a distance of 8 kpc and GC radius 0.2 kpc.","The major and minor-axis diameters of the Brick are $D_x\\times D_y=8.4 \\ {\\rm pc} \\times 4.1 \\ {\\rm pc}$, and the scale radius is $r_{\\rm bri}=\\sqrt{D_x D_y}=2.96$ pc.","The molecular mass inferred from the CO-line integrated intensity is $M_{\\rm brixco} \\sim 5.1\\times 10^4 M_\\odot$ for a conversion factor $X_{\\rm gc}=1.0\\times 10^{20}$ H$_2$ cm$^{-2}$","[K km s$^{-1}$]$^{-1}$, while the Virial mass for the velocity dispersion of $\\sigma_v=10.0 $ km s $^{-1}$ is calculated to be $M_{\\rm brivir}\\sim 6.8 \\times 10^4 \\ M_\\odot$, which yields a new conversion factor of $X_{\\rm bri} =1.3\\times 10^{20}$ H$_2$ cm$^{-2}$","[K km s$^{-1}$]$^{-1}$. No thermal radio emission indicative of HII region and star formation is found in radio-continuum archive.","The Brick's center has a cavity surrounded by a spherical molecular bubble of radius $r_{\\rm bub}=1.85$ pc and mass $\\sim 1.7\\times 10","^4 M_\\odot$ expanding at $v_{\\rm exp}=10$ km s$^{-1}$ with kinetic energy of $E_0\\sim 1.7\\times 10^{49}$ erg.","If the bubble is approximated by an adiabatic spherical shock wave, its age is $t\\sim 2/5 r_{\\rm bub}/v_{\\rm exp}\\sim 7.2\\times 10^4$ y. We suggest that the bubble will be a dark supernova remnant buried in the dense molecular cloud.","The Brick, therefore, experienced massive-star formation followed by a supernova explosion more than $\\sim 10^5$ y ago."],"url":"http://arxiv.org/abs/2404.11892v1","category":"astro-ph.GA"}
{"created":"2024-04-18 02:52:05","title":"Gravitational waves from nonradial oscillations of stochastically accreting neutron stars","abstract":"Oscillating neutron stars are sources of continuous gravitational waves. We study analytically the excitation of stellar oscillations by the mechanical impact on the stellar surface of ''clumps'' of stochastically accreted matter. We calculate the waveform and spectrum of the gravitational wave signal emitted by the accretion-driven pulsations. Results are generated for an idealised model of a nonrotating, unmagnetised, one-component star with uniform polytropic index $n_{\\rm poly}$ assuming Newtonian gravity and the Cowling approximation. We find that the excited mode amplitudes grow with increasing $n_{\\rm poly}$ and mode order $n$. The gravitational wave signal forms a sequence of amplitude-modulated packets for $n_{\\rm poly}=1$, lasting $\\sim 10^{-3}$s after each impact. The gravitational wave strain increases with increasing $n_{\\rm poly}$, but decreases with increasing $n$ and increasing multipole order $l$ for $n_{\\rm poly}=1$. In the observing band of current long-baseline interferometers, $g$-modes emit higher, narrower peaks in the amplitude spectral density than $f$- and $p$-modes, with the highest peaks reaching $\\sim 10^{-26}$Hz$^{-1/2}$ for modes with damping time $\\tau_{nl} \\sim 10^{8}$yr. The root-mean-square strain $h_{\\text{rms}}$, calculated by summing over modes with $2\\leq l\\leq4$ and $\\tau_{nl} \\leq 10^{8}$yr, spans the range $10^{-33} \\leq h_{\\text{rms}} \\leq 10^{-32}$ for $1\\leq n_{\\text{poly}}\\leq 2$.","sentences":["Oscillating neutron stars are sources of continuous gravitational waves.","We study analytically the excitation of stellar oscillations by the mechanical impact on the stellar surface of ''clumps'' of stochastically accreted matter.","We calculate the waveform and spectrum of the gravitational wave signal emitted by the accretion-driven pulsations.","Results are generated for an idealised model of a nonrotating, unmagnetised, one-component star with uniform polytropic index $n_{\\rm poly}$ assuming Newtonian gravity and the Cowling approximation.","We find that the excited mode amplitudes grow with increasing $n_{\\rm poly}$ and mode order $n$. The gravitational wave signal forms a sequence of amplitude-modulated packets for $n_{\\rm poly}=1$, lasting $\\sim 10^{-3}$s after each impact.","The gravitational wave strain increases with increasing $n_{\\rm poly}$, but decreases with increasing $n$ and increasing multipole order $l$ for $n_{\\rm poly}=1$.","In the observing band of current long-baseline interferometers, $g$-modes emit higher, narrower peaks in the amplitude spectral density than $f$- and $p$-modes, with the highest peaks reaching $\\sim 10^{-26}$Hz$^{-1/2}$ for modes with damping time $\\tau_{nl} \\sim 10^{8}$yr.","The root-mean-square strain $h_{\\text{rms}}$, calculated by summing over modes with $2\\leq l\\leq4$ and $\\tau_{nl} \\leq 10^{8}$yr, spans the range $10^{-33} \\leq h_{\\text{rms}} \\leq 10^{-32}$ for $1\\leq n_{\\text{poly}}\\leq 2$."],"url":"http://arxiv.org/abs/2404.11866v1","category":"astro-ph.HE"}
{"created":"2024-04-18 01:24:48","title":"Evidence for a nearly orthogonal rotator in GX 301--2 with phase-resolved cyclotron resonant scattering features","abstract":"Cyclotron resonant scattering features (CRSFs) are the absorption features in the X-ray spectra of strongly magnetized accretion neutron stars (NSs), which are probably the most reliable probe to the surface magnetic fields of NSs. The high mass X-ray binary GX 301--2 exhibits a very wide, variable and complicated CRSF in the average spectra, which should be two absorption lines based on NuStar and Insight-HXMT observations. With the Insight-HXMT frequent observations, we performed the phase-resolved spectroscopy and confirmed two cyclotron absorption lines in the phase-resolved spectra, with their centroid energy ratio $\\sim 1.6-1.7$ in the super-critical luminosity case. A major hindrance in understanding those CRSFs is the very poorly constrained magnetic inclination angle, which is also a fundamental property of a NS and key to understanding the emission characteristics of a pulsar. Comparing the phase-resolved CRSF with simulated X-ray spectra, the magnetic inclination angle is found to be $\\gtrsim 70^{\\circ}$, i.e., nearly orthogonal between the NS's spin and magnetic axies. The implications of an orthogonal rotator and magnetic structure evolution in the accreting X-ray binary are also discussed.","sentences":["Cyclotron resonant scattering features (CRSFs) are the absorption features in the X-ray spectra of strongly magnetized accretion neutron stars (NSs), which are probably the most reliable probe to the surface magnetic fields of NSs.","The high mass X-ray binary GX 301--2 exhibits a very wide, variable and complicated CRSF in the average spectra, which should be two absorption lines based on NuStar and Insight-HXMT observations.","With the Insight-HXMT frequent observations, we performed the phase-resolved spectroscopy and confirmed two cyclotron absorption lines in the phase-resolved spectra, with their centroid energy ratio $\\sim 1.6-1.7$ in the super-critical luminosity case.","A major hindrance in understanding those CRSFs is the very poorly constrained magnetic inclination angle, which is also a fundamental property of a NS and key to understanding the emission characteristics of a pulsar.","Comparing the phase-resolved CRSF with simulated X-ray spectra, the magnetic inclination angle is found to be $\\gtrsim 70^{\\circ}$, i.e., nearly orthogonal between the NS's spin and magnetic axies.","The implications of an orthogonal rotator and magnetic structure evolution in the accreting X-ray binary are also discussed."],"url":"http://arxiv.org/abs/2404.11829v1","category":"astro-ph.HE"}
{"created":"2024-04-18 00:58:44","title":"An analogue of non-interacting quantum field theory in Riemannian signature","abstract":"In this paper, we define a model of non-interacting quantum fields satisfying $(\\Delta_g-\\lambda^2)\\phi=0$ on a Riemannian scattering space $(M,g)$ with two boundary components, i.e. a manifold with two asymptotically conic ends (meaning asymptotic to the \"large end\" of a cone). Our main result describes a canonical construction of two-point functions satisfying a version of the Hadamard condition.","sentences":["In this paper, we define a model of non-interacting quantum fields satisfying $(\\Delta_g-\\lambda^2)\\phi=0$ on a Riemannian scattering space $(M,g)$ with two boundary components, i.e. a manifold with two asymptotically conic ends (meaning asymptotic to the \"large end\" of a cone).","Our main result describes a canonical construction of two-point functions satisfying a version of the Hadamard condition."],"url":"http://arxiv.org/abs/2404.11821v1","category":"hep-th"}
