{"created":"2024-03-03 02:05:17","title":"A Closer Look at Wav2Vec2 Embeddings for On-Device Single-Channel Speech Enhancement","abstract":"Self-supervised learned models have been found to be very effective for certain speech tasks such as automatic speech recognition, speaker identification, keyword spotting and others. While the features are undeniably useful in speech recognition and associated tasks, their utility in speech enhancement systems is yet to be firmly established, and perhaps not properly understood. In this paper, we investigate the uses of SSL representations for single-channel speech enhancement in challenging conditions and find that they add very little value for the enhancement task. Our constraints are designed around on-device real-time speech enhancement -- model is causal, the compute footprint is small. Additionally, we focus on low SNR conditions where such models struggle to provide good enhancement. In order to systematically examine how SSL representations impact performance of such enhancement models, we propose a variety of techniques to utilize these embeddings which include different forms of knowledge-distillation and pre-training.","sentences":["Self-supervised learned models have been found to be very effective for certain speech tasks such as automatic speech recognition, speaker identification, keyword spotting and others.","While the features are undeniably useful in speech recognition and associated tasks, their utility in speech enhancement systems is yet to be firmly established, and perhaps not properly understood.","In this paper, we investigate the uses of SSL representations for single-channel speech enhancement in challenging conditions and find that they add very little value for the enhancement task.","Our constraints are designed around on-device real-time speech enhancement -- model is causal, the compute footprint is small.","Additionally, we focus on low SNR conditions where such models struggle to provide good enhancement.","In order to systematically examine how SSL representations impact performance of such enhancement models, we propose a variety of techniques to utilize these embeddings which include different forms of knowledge-distillation and pre-training."],"url":"http://arxiv.org/abs/2403.01369v1","category":"eess.AS"}
{"created":"2024-03-03 01:58:45","title":"Improving Convolutional Neural Networks for Cosmological Fields with Random Permutation","abstract":"Convolutional Neural Networks (CNNs) have recently been applied to cosmological fields -- weak lensing mass maps and galaxy maps. However, cosmological maps differ in several ways from the vast majority of images that CNNs have been tested on: they are stochastic, typically low signal-to-noise per pixel, and with correlations on all scales. Further, the cosmology goal is a regression problem aimed at inferring posteriors on parameters that must be unbiased. We explore simple CNN architectures and present a novel approach of regularization and data augmentation to improve its performance for lensing mass maps. We find robust improvement by using a mixture of pooling and shuffling of the pixels in the deep layers. The random permutation regularizes the network in the low signal-to-noise regime and effectively augments the existing data. We use simulation-based inference (SBI) to show that the model outperforms CNN designs in the literature. We find a 30% improvement in the constraints of the $S_8$ parameter for simulated Stage-III surveys, including systematic uncertainties such as intrinsic alignments. We explore various statistical errors corresponding to next-generation surveys and find comparable improvements. We expect that our approach will have applications to other cosmological fields as well, such as galaxy maps or 21-cm maps.","sentences":["Convolutional Neural Networks (CNNs) have recently been applied to cosmological fields -- weak lensing mass maps and galaxy maps.","However, cosmological maps differ in several ways from the vast majority of images that CNNs have been tested on: they are stochastic, typically low signal-to-noise per pixel, and with correlations on all scales.","Further, the cosmology goal is a regression problem aimed at inferring posteriors on parameters that must be unbiased.","We explore simple CNN architectures and present a novel approach of regularization and data augmentation to improve its performance for lensing mass maps.","We find robust improvement by using a mixture of pooling and shuffling of the pixels in the deep layers.","The random permutation regularizes the network in the low signal-to-noise regime and effectively augments the existing data.","We use simulation-based inference (SBI) to show that the model outperforms CNN designs in the literature.","We find a 30% improvement in the constraints of the $S_8$ parameter for simulated Stage-III surveys, including systematic uncertainties such as intrinsic alignments.","We explore various statistical errors corresponding to next-generation surveys and find comparable improvements.","We expect that our approach will have applications to other cosmological fields as well, such as galaxy maps or 21-cm maps."],"url":"http://arxiv.org/abs/2403.01368v1","category":"astro-ph.CO"}
{"created":"2024-03-03 01:48:15","title":"Relativistic and nonrelativistic Landau levels for Dirac fermions in the cosmic string spacetime in the context of rainbow gravity","abstract":"In this paper, we study the relativistic and nonrelativistic Landau levels for Dirac fermions in the cosmic string spacetime in the context of rainbow gravity in $(3+1)$-dimensions, where we work with the curved Dirac equation with minimal coupling in cylindrical coordinates. Using the tetrads formalism of General Relativity, we obtain a second-order differential equation. Solving this differential equation, we obtain a generalized Laguerre equation as well as the relativistic Landau levels for the fermion and antifermion, where such energy levels are quantized in terms of the quantum numbers $n$, $m_j$ and $m_s$, and explicitly depends on the rainbow functions $f(\\varepsilon)$ and $g(\\varepsilon)$, charge parameter $\\sigma$, cyclotron frequency $\\omega_c$, curvature parameter $\\alpha$, and on the square rest energy $m^2_0$ and square $z$-momentum $k^2_z$, respectively. Posteriorly, we study the nonrelativistic limit of the system, where we obtain the nonrelativistic Landau levels. In both cases (relativistic and nonrelativistic), we graphically analyze the behavior of Landau levels for the three rainbow gravity scenarios as a function of the magnetic field $B$ and of the curvature parameter $\\alpha$. In addition, we also compared our problem with other works, where we verified that our results generalize several particular cases in the literature.","sentences":["In this paper, we study the relativistic and nonrelativistic Landau levels for Dirac fermions in the cosmic string spacetime in the context of rainbow gravity in $(3+1)$-dimensions, where we work with the curved Dirac equation with minimal coupling in cylindrical coordinates.","Using the tetrads formalism of General Relativity, we obtain a second-order differential equation.","Solving this differential equation, we obtain a generalized Laguerre equation as well as the relativistic Landau levels for the fermion and antifermion, where such energy levels are quantized in terms of the quantum numbers $n$, $m_j$ and $m_s$, and explicitly depends on the rainbow functions $f(\\varepsilon)$ and $g(\\varepsilon)$, charge parameter $\\sigma$, cyclotron frequency $\\omega_c$, curvature parameter $\\alpha$, and on the square rest energy $m^2_0$ and square $z$-momentum $k^2_z$, respectively.","Posteriorly, we study the nonrelativistic limit of the system, where we obtain the nonrelativistic Landau levels.","In both cases (relativistic and nonrelativistic), we graphically analyze the behavior of Landau levels for the three rainbow gravity scenarios as a function of the magnetic field $B$ and of the curvature parameter $\\alpha$. In addition, we also compared our problem with other works, where we verified that our results generalize several particular cases in the literature."],"url":"http://arxiv.org/abs/2403.01366v1","category":"gr-qc"}
{"created":"2024-03-03 01:48:01","title":"AI-Powered Reminders for Collaborative Tasks: Experiences and Futures","abstract":"Email continues to serve as a central medium for managing collaborations. While unstructured email messaging is lightweight and conducive to coordination, it is easy to overlook commitments and requests for collaborations that are embedded in the text of free-flowing communications. Twenty-one years ago, Bellotti et al. proposed TaskMaster with the goal of redesigning the email interface to have explicit task management capabilities. Recently, AI-based task recognition and reminder services have been introduced in major email systems as one approach to managing asynchronous collaborations. While these services have been provided to millions of people around the world, there is little understanding of how people interact with and benefit from them. We explore knowledge workers' experiences with Microsoft's Viva Daily Briefing Email to better understand how AI-powered reminders can support asynchronous collaborations. Through semi-structured interviews and surveys, we shed light on how AI-powered reminders are incorporated into workflows to support asynchronous collaborations. We identify what knowledge workers prefer AI-powered reminders to remind them about and how they would like to interact with these reminders. Using mixed methods and a self-assessment methodology, we investigate the relationship between information workers' work styles and the perceived value of the Viva Daily Briefing Email to identify users who are more likely to benefit from AI-powered reminders for asynchronous collaborations. We conclude by discussing the experiences and futures of AI-powered reminders for collaborative tasks and asynchronous collaborations.","sentences":["Email continues to serve as a central medium for managing collaborations.","While unstructured email messaging is lightweight and conducive to coordination, it is easy to overlook commitments and requests for collaborations that are embedded in the text of free-flowing communications.","Twenty-one years ago, Bellotti et al. proposed TaskMaster with the goal of redesigning the email interface to have explicit task management capabilities.","Recently, AI-based task recognition and reminder services have been introduced in major email systems as one approach to managing asynchronous collaborations.","While these services have been provided to millions of people around the world, there is little understanding of how people interact with and benefit from them.","We explore knowledge workers' experiences with Microsoft's Viva Daily Briefing Email to better understand how AI-powered reminders can support asynchronous collaborations.","Through semi-structured interviews and surveys, we shed light on how AI-powered reminders are incorporated into workflows to support asynchronous collaborations.","We identify what knowledge workers prefer AI-powered reminders to remind them about and how they would like to interact with these reminders.","Using mixed methods and a self-assessment methodology, we investigate the relationship between information workers' work styles and the perceived value of the Viva Daily Briefing Email to identify users who are more likely to benefit from AI-powered reminders for asynchronous collaborations.","We conclude by discussing the experiences and futures of AI-powered reminders for collaborative tasks and asynchronous collaborations."],"url":"http://arxiv.org/abs/2403.01365v1","category":"cs.HC"}
{"created":"2024-03-03 01:47:52","title":"Improving Cross-lingual Representation for Semantic Retrieval with Code-switching","abstract":"Semantic Retrieval (SR) has become an indispensable part of the FAQ system in the task-oriented question-answering (QA) dialogue scenario. The demands for a cross-lingual smart-customer-service system for an e-commerce platform or some particular business conditions have been increasing recently. Most previous studies exploit cross-lingual pre-trained models (PTMs) for multi-lingual knowledge retrieval directly, while some others also leverage the continual pre-training before fine-tuning PTMs on the downstream tasks. However, no matter which schema is used, the previous work ignores to inform PTMs of some features of the downstream task, i.e. train their PTMs without providing any signals related to SR. To this end, in this work, we propose an Alternative Cross-lingual PTM for SR via code-switching. We are the first to utilize the code-switching approach for cross-lingual SR. Besides, we introduce the novel code-switched continual pre-training instead of directly using the PTMs on the SR tasks. The experimental results show that our proposed approach consistently outperforms the previous SOTA methods on SR and semantic textual similarity (STS) tasks with three business corpora and four open datasets in 20+ languages.","sentences":["Semantic Retrieval (SR) has become an indispensable part of the FAQ system in the task-oriented question-answering (QA) dialogue scenario.","The demands for a cross-lingual smart-customer-service system for an e-commerce platform or some particular business conditions have been increasing recently.","Most previous studies exploit cross-lingual pre-trained models (PTMs) for multi-lingual knowledge retrieval directly, while some others also leverage the continual pre-training before fine-tuning PTMs on the downstream tasks.","However, no matter which schema is used, the previous work ignores to inform PTMs of some features of the downstream task, i.e. train their PTMs without providing any signals related to SR.","To this end, in this work, we propose an Alternative Cross-lingual PTM for SR via code-switching.","We are the first to utilize the code-switching approach for cross-lingual SR.","Besides, we introduce the novel code-switched continual pre-training instead of directly using the PTMs on the SR tasks.","The experimental results show that our proposed approach consistently outperforms the previous SOTA methods on SR and semantic textual similarity (STS) tasks with three business corpora and four open datasets in 20+ languages."],"url":"http://arxiv.org/abs/2403.01364v1","category":"cs.CL"}
{"created":"2024-03-03 01:45:24","title":"On smooth adic spaces over $\\mathbb{B}_{\\mathrm{dR}}^+$ and sheafified $p$-adic Riemann--Hilbert correspondence","abstract":"Inspired by Heuer's paper, we consider adic spaces over a de Rham period ring of a perfectoid Tate--Huber ring and their sheafified Riemann--Hilbert correspondence. We will prove that for any smooth adic space $X$ over $\\mathbb{B}_{\\mathrm{dR},\\alpha}^+(K,K^+)$, there is a canonical sheaf isomorphism $$R^1\\nu_*\\left(\\mathrm{GL}_r({\\mathbb{B}_{\\mathrm{dR}}^+}_{,\\bar{X}}/t^\\alpha)\\right)\\cong t-\\mathrm{MIC}_r(X).$$ Moreover, we will define $v$-prestacks of $\\mathbb{B}_{\\mathrm{dR}}^+$-local systems and $t$-connections, and prove that they are small $v$-stacks.","sentences":["Inspired by Heuer's paper, we consider adic spaces over a de Rham period ring of a perfectoid Tate--Huber ring and their sheafified Riemann--Hilbert correspondence.","We will prove that for any smooth adic space $X$ over $\\mathbb{B}_{\\mathrm{dR},\\alpha}^+(K,K^+)$, there is a canonical sheaf isomorphism $$R^1\\nu_*\\left(\\mathrm{GL}_r({\\mathbb{B}_{\\mathrm{dR}}^+}_{,\\bar{X}}/t^\\alpha)\\right)\\cong t-\\mathrm{MIC}_r(X).$$","Moreover, we will define $v$-prestacks of $\\mathbb{B}_{\\mathrm{dR}}^+$-local systems and $t$-connections, and prove that they are small $v$-stacks."],"url":"http://arxiv.org/abs/2403.01363v1","category":"math.AG"}
{"created":"2024-03-03 01:50:11","title":"Optimization decision model of vegetable stock and pricing based on TCN-Attention and genetic algorithm","abstract":"With the expansion of operational scale of supermarkets in China, the vegetable market has grown considerably. The decision-making related to procurement costs and allocation quantities of vegetables has become a pivotal factor in determining the profitability of supermarkets. This paper analyzes the relationship between pricing and allocation faced by supermarkets in vegetable operations. Optimization algorithms are employed to determine replenishment and pricing strategies. Linear regression is utilized to model the historical data of various products, establishing the relationship between sale prices and sales volumes for 61 products. By integrating historical data on vegetable costs with time information based on the 24 solar terms, a cost prediction model is trained using TCN-Attention. The Topis evaluation model identifies the 32 most market-demanded products. A genetic algorithm is then used to search for the globally optimized vegetable product allocation-pricing decision.","sentences":["With the expansion of operational scale of supermarkets in China, the vegetable market has grown considerably.","The decision-making related to procurement costs and allocation quantities of vegetables has become a pivotal factor in determining the profitability of supermarkets.","This paper analyzes the relationship between pricing and allocation faced by supermarkets in vegetable operations.","Optimization algorithms are employed to determine replenishment and pricing strategies.","Linear regression is utilized to model the historical data of various products, establishing the relationship between sale prices and sales volumes for 61 products.","By integrating historical data on vegetable costs with time information based on the 24 solar terms, a cost prediction model is trained using TCN-Attention.","The Topis evaluation model identifies the 32 most market-demanded products.","A genetic algorithm is then used to search for the globally optimized vegetable product allocation-pricing decision."],"url":"http://arxiv.org/abs/2403.01367v1","category":"cs.CE"}
