{"created":"2024-03-28 10:38:13","title":"Post Quantum Cryptography and its Comparison with Classical Cryptography","abstract":"Cryptography plays a pivotal role in safeguarding sensitive information and facilitating secure communication. Classical cryptography relies on mathematical computations, whereas quantum cryptography operates on the principles of quantum mechanics, offering a new frontier in secure communication. Quantum cryptographic systems introduce novel dimensions to security, capable of detecting and thwarting eavesdropping attempts. By contrasting quantum cryptography with its classical counterpart, it becomes evident how quantum mechanics revolutionizes the landscape of secure communication.","sentences":["Cryptography plays a pivotal role in safeguarding sensitive information and facilitating secure communication.","Classical cryptography relies on mathematical computations, whereas quantum cryptography operates on the principles of quantum mechanics, offering a new frontier in secure communication.","Quantum cryptographic systems introduce novel dimensions to security, capable of detecting and thwarting eavesdropping attempts.","By contrasting quantum cryptography with its classical counterpart, it becomes evident how quantum mechanics revolutionizes the landscape of secure communication."],"url":"http://arxiv.org/abs/2403.19299v1","category":"cs.CR"}
{"created":"2024-03-28 12:08:16","title":"The SNO+ Journey to $0νββ$","abstract":"SNO+ is a large multipurpose experiment with the ultimate goal of searching for the neutrinoless double beta decay in $^{130}\\mathrm{Te}$. After a commissioning phase with water as the target medium, during which acquired data allowed for measurements of solar neutrinos and the detection of reactor antineutrinos, SNO+ is now filled with 780 tonnes of liquid scintillator. The higher light yield of the scintillator enhances the physics capabilities of the experiment, and a physics program including reactor, geo and solar neutrinos is currently underway. The water and unloaded scintillator phases provide crucial commissioning milestones in preparation for the tellurium loading, such as calibrating the detector and making extensive background constraint measurements as components of the final scintillator cocktail are gradually added. In a first phase, 3900~kg of natural tellurium (0.5%) will be added to the scintillator for a predicted sensitivity of about $2\\times20^{26}$ years (90% CL) with 3 years of livetime. Higher tellurium loading will follow for predicted sensitivities above $1\\times10^{27}$ years (3% loading).","sentences":["SNO+ is a large multipurpose experiment with the ultimate goal of searching for the neutrinoless double beta decay in $^{130}\\mathrm{Te}$. After a commissioning phase with water as the target medium, during which acquired data allowed for measurements of solar neutrinos and the detection of reactor antineutrinos, SNO+ is now filled with 780 tonnes of liquid scintillator.","The higher light yield of the scintillator enhances the physics capabilities of the experiment, and a physics program including reactor, geo and solar neutrinos is currently underway.","The water and unloaded scintillator phases provide crucial commissioning milestones in preparation for the tellurium loading, such as calibrating the detector and making extensive background constraint measurements as components of the final scintillator cocktail are gradually added.","In a first phase, 3900~kg of natural tellurium (0.5%) will be added to the scintillator for a predicted sensitivity of about $2\\times20^{26}$ years (90% CL) with 3 years of livetime.","Higher tellurium loading will follow for predicted sensitivities above $1\\times10^{27}$ years (3% loading)."],"url":"http://arxiv.org/abs/2403.19351v1","category":"hep-ex"}
{"created":"2024-03-28 07:22:18","title":"Single-Crystal Growth and Characterization of Cuprate Superconductor (Hg,Re)Ba$_2$Ca$_2$Cu$_3$O$_{8+δ}$","abstract":"We grew (Hg,Re)Ba$_2$Ca$_2$Cu$_3$O$_{8+\\delta}$ ((Hg,Re)1223) single crystals with good reproducibility via the single-step flux method using monoxides as raw materials. A double-sealing method using a thick-walled quartz tube and a stainless-steel container was adopted for explosion protection. The maximum crystal size was approximately 1 mm x 1 mm in the ab plane and 0.04 mm in thickness. The crystal was square-shaped, reflecting the tetragonal crystal structure of (Hg,Re)1223. Magnetic susceptibility measurements indicated a critical temperature of 130 K. The in-plane resistivity exhibited a linear temperature dependence, indicating that the sample was close to optimal doping level. The out-of-plane resistivity was also measured, and the anisotropy parameter was 250-650 at 300 K.","sentences":["We grew (Hg,Re)Ba$_2$Ca$_2$Cu$_3$O$_{8+\\delta}$ ((Hg,Re)1223) single crystals with good reproducibility via the single-step flux method using monoxides as raw materials.","A double-sealing method using a thick-walled quartz tube and a stainless-steel container was adopted for explosion protection.","The maximum crystal size was approximately 1 mm x 1 mm in the ab plane and 0.04 mm in thickness.","The crystal was square-shaped, reflecting the tetragonal crystal structure of (Hg,Re)1223.","Magnetic susceptibility measurements indicated a critical temperature of 130 K. The in-plane resistivity exhibited a linear temperature dependence, indicating that the sample was close to optimal doping level.","The out-of-plane resistivity was also measured, and the anisotropy parameter was 250-650 at 300 K."],"url":"http://arxiv.org/abs/2403.19182v1","category":"cond-mat.supr-con"}
