{"created":"2024-04-15 12:46:07","title":"Electric potential during tokamak disruptions and steady-state current drive","abstract":"A Helmholtz decomposition separates the electric field in a plasma into the sum of a divergence-free, $\\vec{E}_B$, and a curl-free, $\\vec{E}_q$, part. The uniqueness of the separation can be shown using the time dependence of the magnetic helicity, which also shows there is a steady-state loop voltage $V_{ss}$, when the electric potential is not constant on the chamber walls. The divergence-free part of $\\vec{E}$ determines the evolution of the magnetic field. The curl-free part enforces quasi-neutrality, $\\vec{E}_q=-\\vec{\\nabla}\\Phi_q$. The quasi-neutrality potential is approximated by $T_e/e$, the electron temperature divided by the elementary charge. During tokamak disruptions, the magnetic surfaces are broken creating large regions of chaotic magnetic field lines. In each chaotic region, the parallel current density divided by $B$ relaxes toward a spatial constant by shear Alfv\\'en waves. The potential $\\Phi_q$ produces both a diffusion coefficient that is Bohm-like, $D_q\\approx T_e/eB$, and a large scale flow $\\approx T_e/eB a_T$ across the magnetic field lines, where $a_T$ is the scale of the large scale difference in temperature. This diffusion and flow are important for sweeping impurities into the core of a disrupting tokamak plasma.","sentences":["A Helmholtz decomposition separates the electric field in a plasma into the sum of a divergence-free, $\\vec{E}_B$, and a curl-free, $\\vec{E}_q$, part.","The uniqueness of the separation can be shown using the time dependence of the magnetic helicity, which also shows there is a steady-state loop voltage $V_{ss}$, when the electric potential is not constant on the chamber walls.","The divergence-free part of $\\vec{E}$ determines the evolution of the magnetic field.","The curl-free part enforces quasi-neutrality, $\\vec{E}_q=-\\vec{\\nabla}\\Phi_q$. The quasi-neutrality potential is approximated by $T_e/e$, the electron temperature divided by the elementary charge.","During tokamak disruptions, the magnetic surfaces are broken creating large regions of chaotic magnetic field lines.","In each chaotic region, the parallel current density divided by $B$ relaxes toward a spatial constant by shear Alfv\\'en waves.","The potential $\\Phi_q$ produces both a diffusion coefficient that is Bohm-like, $D_q\\approx T_e/eB$, and a large scale flow $\\approx T_e/eB a_T$ across the magnetic field lines, where $a_T$ is the scale of the large scale difference in temperature.","This diffusion and flow are important for sweeping impurities into the core of a disrupting tokamak plasma."],"url":"http://arxiv.org/abs/2404.09744v1","category":"physics.plasm-ph"}
{"created":"2024-04-15 12:30:47","title":"Nuclear spatial resolution in near-encounter UPC dijet photoproduction","abstract":"We present next-to-leading order perturbative QCD predictions for inclusive dijet photoproduction in ultra-peripheral nucleus-nucleus collisions (UPCs) within the impact-parameter dependent equivalent photon approximation. Taking into account the finite size of both the photon-emitting and the target nucleus, we show that this process is sensitive to the transverse-plane geometry of the UPC events. We show that this leads to a sizeable, 20-40% effect for large values of the $z_\\gamma$ variable in the dijet photoproduction cross section in lead-lead UPCs at 5.02 TeV compared to the widely-used pointlike approximation where the nuclear radius is accounted only as a sharp cut-off in the photon flux calculation. This resolution of the spatial degrees of freedom is a result of having high-transverse-momentum jets in the final state, which at the large-$z_\\gamma$ kinematics requires a highly energetic photon in the initial state, thus biasing the collisions to small impact-parameter ''near-encounter'' configurations. We further discuss the role of the forward-neutron event-class selection in isolating the photonuclear cross section in the nucleus-nucleus collisions, and employ the needed electromagnetic breakup survival factor in our predictions.","sentences":["We present next-to-leading order perturbative QCD predictions for inclusive dijet photoproduction in ultra-peripheral nucleus-nucleus collisions (UPCs) within the impact-parameter dependent equivalent photon approximation.","Taking into account the finite size of both the photon-emitting and the target nucleus, we show that this process is sensitive to the transverse-plane geometry of the UPC events.","We show that this leads to a sizeable, 20-40% effect for large values of the $z_\\gamma$ variable in the dijet photoproduction cross section in lead-lead UPCs at 5.02 TeV compared to the widely-used pointlike approximation where the nuclear radius is accounted only as a sharp cut-off in the photon flux calculation.","This resolution of the spatial degrees of freedom is a result of having high-transverse-momentum jets in the final state, which at the large-$z_\\gamma$ kinematics requires a highly energetic photon in the initial state, thus biasing the collisions to small impact-parameter ''near-encounter'' configurations.","We further discuss the role of the forward-neutron event-class selection in isolating the photonuclear cross section in the nucleus-nucleus collisions, and employ the needed electromagnetic breakup survival factor in our predictions."],"url":"http://arxiv.org/abs/2404.09731v1","category":"hep-ph"}
{"created":"2024-04-15 12:28:27","title":"Using Micromegas detectors for direct dark matter searches: challenges and perspectives","abstract":"Gas time projection chambers (TPCs) with Micromegas pixelated readouts are being used in dark matter searches and other rare event searches, due to their potential in terms of low background levels, energy and spatial resolution, gain, and operational stability. Moreover, these detectors can provide precious features,such as topological information, allowing for event directionality and powerful signal-background discrimination. The Micromegas technology of the microbulk type is particularly suited to low-background applications and is being exploited by detectors for CAST and IAXO (solar axions) and TREX-DM (low-mass WIMPs) experiments. Challenges for the future include reducing intrinsic background levels, reaching lower energy detection levels, and technical issues such as robustness of detector, new design choices, novel gas mixtures and operation points, scaling up to larger detector sizes, handling large readout granularity, etc. We report on the status and prospects of the development ongoing in the context of IAXO and TREX-DM experiments, pointing to promising perspectives for the use of Micromegas detectors in directdark matter searches","sentences":["Gas time projection chambers (TPCs) with Micromegas pixelated readouts are being used in dark matter searches and other rare event searches, due to their potential in terms of low background levels, energy and spatial resolution, gain, and operational stability.","Moreover, these detectors can provide precious features,such as topological information, allowing for event directionality and powerful signal-background discrimination.","The Micromegas technology of the microbulk type is particularly suited to low-background applications and is being exploited by detectors for CAST and IAXO (solar axions) and TREX-DM (low-mass WIMPs) experiments.","Challenges for the future include reducing intrinsic background levels, reaching lower energy detection levels, and technical issues such as robustness of detector, new design choices, novel gas mixtures and operation points, scaling up to larger detector sizes, handling large readout granularity, etc.","We report on the status and prospects of the development ongoing in the context of IAXO and TREX-DM experiments, pointing to promising perspectives for the use of Micromegas detectors in directdark matter searches"],"url":"http://arxiv.org/abs/2404.09727v1","category":"physics.ins-det"}
{"created":"2024-04-15 11:35:15","title":"An Empirical Study of Open Edge Computing Platforms: Ecosystem, Usage, and Security Risks","abstract":"Emerging in recent years, open edge computing platforms (OECPs) claim large-scale edge nodes, the extensive usage and adoption, as well as the openness to any third parties to join as edge nodes. For instance, OneThingCloud, a major OECP operated in China, advertises 5 million edge nodes, 70TB bandwidth, and 1,500PB storage. However, little information is publicly available for such OECPs with regards to their technical mechanisms and involvement in edge computing activities. Furthermore, different from known edge computing paradigms, OECPs feature an open ecosystem wherein any third party can participate as edge nodes and earn revenue for the contribution of computing and bandwidth resources, which, however, can introduce byzantine or even malicious edge nodes and thus break the traditional threat model for edge computing. In this study, we conduct the first empirical study on two representative OECPs, which is made possible through the deployment of edge nodes across locations, the efficient and semi-automatic analysis of edge traffic as well as the carefully designed security experiments. As the results, a set of novel findings and insights have been distilled with regards to their technical mechanisms, the landscape of edge nodes, the usage and adoption, and the practical security/privacy risks. Particularly, millions of daily active edge nodes have been observed, which feature a wide distribution in the network space and the extensive adoption in content delivery towards end users of 16 popular Internet services. Also, multiple practical and concerning security risks have been identified along with acknowledgements received from relevant parties, e.g., the exposure of long-term and cross-edge-node credentials, the co-location with malicious activities of diverse categories, the failures of TLS certificate verification, the extensive information leakage against end users, etc.","sentences":["Emerging in recent years, open edge computing platforms (OECPs) claim large-scale edge nodes, the extensive usage and adoption, as well as the openness to any third parties to join as edge nodes.","For instance, OneThingCloud, a major OECP operated in China, advertises 5 million edge nodes, 70TB bandwidth, and 1,500PB storage.","However, little information is publicly available for such OECPs with regards to their technical mechanisms and involvement in edge computing activities.","Furthermore, different from known edge computing paradigms, OECPs feature an open ecosystem wherein any third party can participate as edge nodes and earn revenue for the contribution of computing and bandwidth resources, which, however, can introduce byzantine or even malicious edge nodes and thus break the traditional threat model for edge computing.","In this study, we conduct the first empirical study on two representative OECPs, which is made possible through the deployment of edge nodes across locations, the efficient and semi-automatic analysis of edge traffic as well as the carefully designed security experiments.","As the results, a set of novel findings and insights have been distilled with regards to their technical mechanisms, the landscape of edge nodes, the usage and adoption, and the practical security/privacy risks.","Particularly, millions of daily active edge nodes have been observed, which feature a wide distribution in the network space and the extensive adoption in content delivery towards end users of 16 popular Internet services.","Also, multiple practical and concerning security risks have been identified along with acknowledgements received from relevant parties, e.g., the exposure of long-term and cross-edge-node credentials, the co-location with malicious activities of diverse categories, the failures of TLS certificate verification, the extensive information leakage against end users, etc."],"url":"http://arxiv.org/abs/2404.09681v1","category":"cs.CR"}
{"created":"2024-04-15 11:12:36","title":"Multiwavelength Modeling for the Shallow Decay Phase of Gamma-Ray Burst Afterglows","abstract":"We simulate the emission in the shallow decay phase of gamma-ray burst afterglows using a time-dependent code. We test four models: the energy injection model, evolving the injection efficiency of non-thermal electrons, evolving the amplification of the magnetic field, and the wind model with a relatively low bulk Lorentz factor. All of the four models can reproduce the typical X-ray afterglow lightcurve. The spectral shape depends on not only the parameter values at the time corresponding to the observer time but also the past evolution of the parameters. The model differences appear in the evolution of the broadband spectrum, especially in the inverse Compton component. Future gamma-ray observations with imaging atmospheric Cherenkov telescopes such as CTA will reveal the mechanism of the shallow decay phase.","sentences":["We simulate the emission in the shallow decay phase of gamma-ray burst afterglows using a time-dependent code.","We test four models: the energy injection model, evolving the injection efficiency of non-thermal electrons, evolving the amplification of the magnetic field, and the wind model with a relatively low bulk Lorentz factor.","All of the four models can reproduce the typical X-ray afterglow lightcurve.","The spectral shape depends on not only the parameter values at the time corresponding to the observer time but also the past evolution of the parameters.","The model differences appear in the evolution of the broadband spectrum, especially in the inverse Compton component.","Future gamma-ray observations with imaging atmospheric Cherenkov telescopes such as CTA will reveal the mechanism of the shallow decay phase."],"url":"http://arxiv.org/abs/2404.09675v1","category":"astro-ph.HE"}
{"created":"2024-04-15 10:46:49","title":"Scattering on the supermembrane","abstract":"We compute the one-loop $2 \\rightarrow 2$ scattering amplitude of massless scalars on the world volume of an infinite $D = 11$ supermembrane quantized in the static gauge. The resulting expression is manifestly finite and turns out to be much simpler than in the bosonic membrane case in arXiv:2308.12189 being simply proportional to the tree-level scattering amplitude. We also consider the case of $\\mathbb{R}^{1,1} \\times S^1$ membrane with one dimension compactified on a circle of radius R and demonstrate how the supermembrane scattering amplitude reduces to the one on an infinite $D = 10$ Green-Schwarz superstring in the limit of R $\\rightarrow 0$.","sentences":["We compute the one-loop $2 \\rightarrow 2$ scattering amplitude of massless scalars on the world volume of an infinite $D = 11$ supermembrane quantized in the static gauge.","The resulting expression is manifestly finite and turns out to be much simpler than in the bosonic membrane case in arXiv:2308.12189 being simply proportional to the tree-level scattering amplitude.","We also consider the case of $\\mathbb{R}^{1,1} \\times S^1$ membrane with one dimension compactified on a circle of radius R and demonstrate how the supermembrane scattering amplitude reduces to the one on an infinite $D = 10$ Green-Schwarz superstring in the limit of R $\\rightarrow 0$."],"url":"http://arxiv.org/abs/2404.09658v1","category":"hep-th"}
{"created":"2024-04-15 10:43:53","title":"An $S^3\\times S^3$ bundle over $S^4$ and new supergravity solutions","abstract":"The metric of $S^7$ can be written as an $SU(2)$-instanton bundle over $S^4$. It is also possible to write it differently as an anti-instanton bundle. We use this observation to construct an instanton--anti-instanton, $SU(2)\\times SU(2)$, bundle over $S^4$. We show that this 10d manifold admits two Einstein metrics. We then rewrite the metric to isolate two $U(1)$ directions of the fibre and dimensionally reduce along them to get an eight dimensional metric describing an $S^2\\times S^2$ bundle over $S^4$. This metric allows a harmonic 4-form which we use to derive new supergravity solutions in eleven and ten dimensions as $AdS_3\\times M_8$ and $AdS_2\\times M_8$, respectively.","sentences":["The metric of $S^7$ can be written as an $SU(2)$-instanton bundle over $S^4$. It is also possible to write it differently as an anti-instanton bundle.","We use this observation to construct an instanton--anti-instanton, $SU(2)\\times SU(2)$, bundle over $S^4$. We show that this 10d manifold admits two Einstein metrics.","We then rewrite the metric to isolate two $U(1)$ directions of the fibre and dimensionally reduce along them to get an eight dimensional metric describing an $S^2\\times S^2$ bundle over $S^4$. This metric allows a harmonic 4-form which we use to derive new supergravity solutions in eleven and ten dimensions as $AdS_3\\times M_8$ and $AdS_2\\times M_8$, respectively."],"url":"http://arxiv.org/abs/2404.09655v1","category":"hep-th"}
{"created":"2024-04-15 10:22:30","title":"Spectro-polarimetric study of a newly discovered Galactic transient Swift J151857.0-572147 using IXPE and NuSTAR observations","abstract":"We study the spectro-polarimetric properties of a newly discovered black hole X-ray binary Swift\\,J151857.0-572147 jointly using {\\it IXPE} and {\\it NuSTAR} observations during March 2024. The analysis of {\\it IXPE} data reports mode-independent polarization degree (PD) $1.34\\pm0.27$ and polarization angle (PA) $-13.69^\\circ\\pm5.85^\\circ$, while the model-dependent analysis gives PD $1.18\\pm0.23$ and PA $-14.01^\\circ\\pm5.80^\\circ$. The joint spectral analysis of the broadband data constrains the average mass of the central black hole $\\sim 8.5\\pm1.3 M_\\odot$ and a moderate spin parameter of $\\sim0.6\\pm0.1$ with disk inclination $\\sim 31^\\circ\\pm8^\\circ$. The power-law photon index and cutoff energy are $2.4\\pm0.1$ and $\\sim 50\\pm9-60\\pm8$ keV, suggesting a transition to the soft spectral state of the source during the observation period. Additionally, the best-fitted halo mass accretion is less compared to the disk mass accretion rate and a relatively lower corona size of 10 r$_g$ might be indicative of the same spectral state. The mass outflow rate was also low ($<2$\\% $\\dot M_{\\rm Edd}$) during these epochs. The hydrogen column density obtained from the fit is relatively high $\\sim 5.2\\pm0.1\\times 10^{22}$ cm$^{-2}$.","sentences":["We study the spectro-polarimetric properties of a newly discovered black hole X-ray binary Swift\\,J151857.0-572147 jointly using {\\it IXPE} and {\\it NuSTAR} observations during March 2024.","The analysis of {\\it IXPE} data reports mode-independent polarization degree (PD) $1.34\\pm0.27$ and polarization angle (PA) $-13.69^\\circ\\pm5.85^\\circ$, while the model-dependent analysis gives PD $1.18\\pm0.23$ and PA $-14.01^\\circ\\pm5.80^\\circ$. The joint spectral analysis of the broadband data constrains the average mass of the central black hole $\\sim 8.5\\pm1.3 M_\\odot$ and a moderate spin parameter of $\\sim0.6\\pm0.1$ with disk inclination $\\sim 31^\\circ\\pm8^\\circ$. The power-law photon index and cutoff energy are $2.4\\pm0.1$ and $\\sim 50\\pm9-60\\pm8$ keV, suggesting a transition to the soft spectral state of the source during the observation period.","Additionally, the best-fitted halo mass accretion is less compared to the disk mass accretion rate and a relatively lower corona size of 10 r$_g$ might be indicative of the same spectral state.","The mass outflow rate was also low ($<2$\\% $\\dot M_{\\rm Edd}$) during these epochs.","The hydrogen column density obtained from the fit is relatively high $\\sim 5.2\\pm0.1\\times 10^{22}$ cm$^{-2}$."],"url":"http://arxiv.org/abs/2404.09643v1","category":"astro-ph.HE"}
{"created":"2024-04-15 09:46:14","title":"On the experimental properties of the TS defect in 4H-SiC","abstract":"When annealing a 4H silicon carbide (SiC) crystal, a sequence of optically active defect centers occurs among which the TS center is a prominent example. Here, we present low-temperature photoluminescence analyses on the single defect level. They reveal that the three occurring spectral signatures TS1, TS2 and TS3 originate from one single defect. Their polarization dependences expose three different crystallographic orientations in the basal plane, which relate to the projections of the nearest neighbor directions. Accordingly, we find a three-fold level-splitting in ensemble studies, when applying mechanical strain. This dependency is quantitatively calibrated. A complementary electrical measurement, deep level transient spectroscopy, reveals a charge transition level of the TS defect at 0.6 eV above the valence band. For a future identification, this accurate characterization of its optical and electronic properties along with their response to mechanical strain is a milestone.","sentences":["When annealing a 4H silicon carbide (SiC) crystal, a sequence of optically active defect centers occurs among which the TS center is a prominent example.","Here, we present low-temperature photoluminescence analyses on the single defect level.","They reveal that the three occurring spectral signatures TS1, TS2 and TS3 originate from one single defect.","Their polarization dependences expose three different crystallographic orientations in the basal plane, which relate to the projections of the nearest neighbor directions.","Accordingly, we find a three-fold level-splitting in ensemble studies, when applying mechanical strain.","This dependency is quantitatively calibrated.","A complementary electrical measurement, deep level transient spectroscopy, reveals a charge transition level of the TS defect at 0.6 eV above the valence band.","For a future identification, this accurate characterization of its optical and electronic properties along with their response to mechanical strain is a milestone."],"url":"http://arxiv.org/abs/2404.09618v1","category":"physics.app-ph"}
{"created":"2024-04-15 09:30:41","title":"Neutrino dipole portal at a high energy $μ-$collider","abstract":"We study the phenomenology of $d=6$ dipole portal operators connecting active and sterile neutrinos at a futuristic muon collider. These operators can be the dominant portal between the Standard Model and the New Physics sector in scenarios in which the active-sterile mixing is suppressed. We identify two production modes for sterile neutrinos: one proceeding through the exchange of an $s-$channel electroweak boson and one arising from the fusion of an electroweak boson with a Standard Model lepton. We study the expected reach on the operators suppression scale for these different production mechanisms, showing that the latter offers the best sensitivity and allowing to test a New Physics scale in the $\\sim 10\\;$TeV range.","sentences":["We study the phenomenology of $d=6$ dipole portal operators connecting active and sterile neutrinos at a futuristic muon collider.","These operators can be the dominant portal between the Standard Model and the New Physics sector in scenarios in which the active-sterile mixing is suppressed.","We identify two production modes for sterile neutrinos:","one proceeding through the exchange of an $s-$channel electroweak boson and one arising from the fusion of an electroweak boson with a Standard Model lepton.","We study the expected reach on the operators suppression scale for these different production mechanisms, showing that the latter offers the best sensitivity and allowing to test a New Physics scale in the $\\sim 10\\;$TeV range."],"url":"http://arxiv.org/abs/2404.09609v1","category":"hep-ph"}
{"created":"2024-04-15 09:00:10","title":"Large deviation principle at speed $n^d$ for the random metric in first-passage percolation","abstract":"We consider the standard first passage percolation model on $\\mathbb Z^d$ with bounded and bounded away from zero weights. We show that the rescaled passage time $\\widetilde{\\mathbf T}_{n,X}$ restricted to a compact set $X$ satisfies a large deviation principle (LDP) at speed $n^d$ in a space of geodesic metrics, i.e. an estimation of the form $\\mathbb P\\left( \\widetilde {\\mathbf T}_{n,X } \\approx D \\right)\\approx\\exp\\left(-I(D)n^d \\right)$ for any metric $D$. Moreover, $I(D)$ can be written as the integral over $X$ of an elementary cost. Consequences include LDPs at speed $n^d$ for the point--point passage time, the face--face passage time and the random ball of radius $n$. Our strategy consists in proving the existence of $\\lim_{n\\to\\infty}-\\frac{1}{n^d}\\log \\mathbb P \\left(\\widetilde{\\mathbf T}_{n,[0,1]^d} \\approx g \\right)$ for any norm $g$ with a multidimensional subaddivity argument, then using this result as an elementary building block to estimate $\\mathbb P \\left( \\widetilde{\\mathbf T}_{n,X} \\approx D \\right) $ for any metric $D$.","sentences":["We consider the standard first passage percolation model on $\\mathbb Z^d$ with bounded and bounded away from zero weights.","We show that the rescaled passage time $\\widetilde{\\mathbf T}_{n,X}$ restricted to a compact set $X$ satisfies a large deviation principle (LDP) at speed $n^d$ in a space of geodesic metrics, i.e. an estimation of the form $\\mathbb P\\left( \\widetilde {\\mathbf T}_{n,X } \\approx D \\right)\\approx\\exp\\left(-I(D)n^d \\right)$ for any metric $D$. Moreover, $I(D)$ can be written as the integral over $X$ of an elementary cost.","Consequences include LDPs at speed $n^d$ for the point--point passage time, the face--face passage time and the random ball of radius $n$. Our strategy consists in proving the existence of $\\lim_{n\\to\\infty}-\\frac{1}{n^d}\\log \\mathbb P \\left(\\widetilde{\\mathbf T}_{n,[0,1]^d} \\approx g \\right)$ for any norm $g$ with a multidimensional subaddivity argument, then using this result as an elementary building block to estimate $\\mathbb P \\left( \\widetilde{\\mathbf T}_{n,X} \\approx D \\right) $ for any metric $D$."],"url":"http://arxiv.org/abs/2404.09589v1","category":"math.PR"}
{"created":"2024-04-15 07:18:52","title":"Eruption of a million-Kelvin warm magnetic flux rope on the Sun","abstract":"Solar magnetic flux rope (MFR) plays a central role in the physics of coronal mass ejections (CMEs). It mainly includes a cold filament at typical chromospheric temperatures (10000 K) and a hot channel at high coronal temperatures (10 MK). The warm MFR at quiescent coronal temperatures of a million Kelvin is, however, rarely reported. In this study, using multiwavelength images from Atmospheric Imaging Assembly (AIA) on board the Solar Dynamic Observatory (SDO) and Extreme Ultraviolet Imager (EUVI) on board the Solar Terrestrial Relations Observatory-A (STEREO-A), we present an eruption of a warm channel, that represents an MFR with quiescent coronal temperatures (0.6-2.5 MK). On 2022 May 8, we observed the failed eruption of a hot channel, with the average temperature and emission measure (EM) of 10 MK and 1.1*1028 cm^-5, using AIA high-temperature images in active region (AR) 13007. This failed eruption was associated with a C8.2 flare, with no CME. Subsequently, we observed a warm channel that appeared in AIA and EUVI low-temperature images, rather than AIA high-temperature images. It then erupted, and transformed toward a semi-circular shape. An associated C2.1 flare, along with the signatures of magnetic reconnection in AIA high-temperature images, were identified. Additionally, we observed a CME associated with this event. Compared with the hot channel, the warm channel is cooler and rarer with the average temperature and EM of 1.7 (1.6) MK and 2.0*1026 (2.3*1026) cm^-5. All the results suggest an unambiguous observation of the million-Kelvin warm MFR, that erupted as a CME, and fill a gap in the temperature domain of coronal MFRs.","sentences":["Solar magnetic flux rope (MFR) plays a central role in the physics of coronal mass ejections (CMEs).","It mainly includes a cold filament at typical chromospheric temperatures (10000 K) and a hot channel at high coronal temperatures (10 MK).","The warm MFR at quiescent coronal temperatures of a million Kelvin is, however, rarely reported.","In this study, using multiwavelength images from Atmospheric Imaging Assembly (AIA) on board the Solar Dynamic Observatory (SDO) and Extreme Ultraviolet Imager (EUVI) on board the Solar Terrestrial Relations Observatory-A (STEREO-A), we present an eruption of a warm channel, that represents an MFR with quiescent coronal temperatures (0.6-2.5 MK).","On 2022 May 8, we observed the failed eruption of a hot channel, with the average temperature and emission measure (EM) of 10 MK and 1.1*1028 cm^-5, using AIA high-temperature images in active region (AR) 13007.","This failed eruption was associated with a C8.2 flare, with no CME.","Subsequently, we observed a warm channel that appeared in AIA and EUVI low-temperature images, rather than AIA high-temperature images.","It then erupted, and transformed toward a semi-circular shape.","An associated C2.1 flare, along with the signatures of magnetic reconnection in AIA high-temperature images, were identified.","Additionally, we observed a CME associated with this event.","Compared with the hot channel, the warm channel is cooler and rarer with the average temperature and EM of 1.7 (1.6) MK and 2.0*1026 (2.3*1026) cm^-5.","All the results suggest an unambiguous observation of the million-Kelvin warm MFR, that erupted as a CME, and fill a gap in the temperature domain of coronal MFRs."],"url":"http://arxiv.org/abs/2404.09514v1","category":"astro-ph.SR"}
{"created":"2024-04-15 07:10:50","title":"Bayesian inference of neutron-skin thickness and neutron-star observables based on effective nuclear interactions","abstract":"We have obtained the constraints on the density dependence of the symmetry energy from neutron-skin thickness data by parity-violating electron scatterings and neutron-star observables using a Bayesian approach, based on the standard Skyrme-Hartree-Fock (SHF) model and its extension as well as the relativistic mean-field (RMF) model. While the neutron-skin thickness data (neutron-star observables) mostly constrain the symmetry energy at subsaturation (suprasaturation) densities, they may more or less constrain the behavior of the symmetry energy at suprasaturation (subsaturation) densities, depending on the energy-density functional form. Besides showing the final posterior density dependence of the symmetry energy, we also compare the slope parameters of the symmetry energy at 0.10 fm$^{-3}$ as well as the values of the symmetry energy at twice saturation density from three effective nuclear interactions. The present work serves as a comparison study based on relativistic and nonrelativistic energy-density functionals for constraining the nuclear symmetry energy from low to high densities using a Bayesian approach.","sentences":["We have obtained the constraints on the density dependence of the symmetry energy from neutron-skin thickness data by parity-violating electron scatterings and neutron-star observables using a Bayesian approach, based on the standard Skyrme-Hartree-Fock (SHF) model and its extension as well as the relativistic mean-field (RMF) model.","While the neutron-skin thickness data (neutron-star observables) mostly constrain the symmetry energy at subsaturation (suprasaturation) densities, they may more or less constrain the behavior of the symmetry energy at suprasaturation (subsaturation) densities, depending on the energy-density functional form.","Besides showing the final posterior density dependence of the symmetry energy, we also compare the slope parameters of the symmetry energy at 0.10 fm$^{-3}$ as well as the values of the symmetry energy at twice saturation density from three effective nuclear interactions.","The present work serves as a comparison study based on relativistic and nonrelativistic energy-density functionals for constraining the nuclear symmetry energy from low to high densities using a Bayesian approach."],"url":"http://arxiv.org/abs/2404.09511v1","category":"nucl-th"}
{"created":"2024-04-15 06:05:15","title":"On anomalous dimension in 3D ABJM model","abstract":"Anomalous dimension of the shortest single-trace operator is calculated in a simple form for the fishnet limit of the twisted ABJM model in 3D.","sentences":["Anomalous dimension of the shortest single-trace operator is calculated in a simple form for the fishnet limit of the twisted ABJM model in 3D."],"url":"http://arxiv.org/abs/2404.09478v1","category":"hep-th"}
{"created":"2024-04-15 04:46:36","title":"High-performance magnesium/sodium hybrid ion battery based on sodium vanadate oxide for reversible storage of Na+ and Mg2+","abstract":"Magnesium ion batteries (MIBs) are a potential field for the energy storage of the future but are restricted by insufficient rate capability and rapid capacity degradation. Magnesium-sodium hybrid ion batteries (MSHBs) are an effective way to address these problems. Here, we report a new type of MSHBs that use layered sodium vanadate ((Na, Mn)V8O20 5H2O, Mn-NVO) cathodes coupled with an organic 3,4,9,10-perylenetetracarboxylic diimide (PTCDI) anode in Mg2+/Na+ hybrid electrolytes. During electrochemical cycling, Mg2+ and Na+ co-participate in the cathode reactions, and the introduction of Na+ promotes the structural stability of the Mn-NVO cathode, as cleared by several ex-situ characterizations. Consequently, the Mn-NVO cathode presents great specific capacity (249.9 mAh g-1 at 300 mA g-1) and cycling (1500 cycles at 1500 mA g-1) in the Mg2+/Na+ hybrid electrolytes. Besides, full battery displays long lifespan with 10,000 cycles at 1000 mA g-1. The rate performance and cycling stability of MSHBs have been improved by an economical and scalable method, and the mechanism for these improvements was discussed.","sentences":["Magnesium ion batteries (MIBs) are a potential field for the energy storage of the future but are restricted by insufficient rate capability and rapid capacity degradation.","Magnesium-sodium hybrid ion batteries (MSHBs) are an effective way to address these problems.","Here, we report a new type of MSHBs that use layered sodium vanadate ((Na, Mn)V8O20 5H2O, Mn-NVO) cathodes coupled with an organic 3,4,9,10-perylenetetracarboxylic diimide (PTCDI) anode in Mg2+/Na+ hybrid electrolytes.","During electrochemical cycling, Mg2+ and Na+ co-participate in the cathode reactions, and the introduction of Na+ promotes the structural stability of the Mn-NVO cathode, as cleared by several ex-situ characterizations.","Consequently, the Mn-NVO cathode presents great specific capacity (249.9 mAh g-1 at 300 mA g-1) and cycling (1500 cycles at 1500 mA g-1) in the Mg2+/Na+ hybrid electrolytes.","Besides, full battery displays long lifespan with 10,000 cycles at 1000 mA g-1.","The rate performance and cycling stability of MSHBs have been improved by an economical and scalable method, and the mechanism for these improvements was discussed."],"url":"http://arxiv.org/abs/2404.09457v1","category":"cond-mat.mtrl-sci"}
{"created":"2024-04-15 00:58:29","title":"Systematic Effects in Galaxy-Galaxy Lensing with DESI","abstract":"The Dark Energy Spectroscopic Instrument (DESI) survey will measure spectroscopic redshifts for millions of galaxies across roughly $14,000 \\, \\mathrm{deg}^2$ of the sky. Cross-correlating targets in the DESI survey with complementary imaging surveys allows us to measure and analyze shear distortions caused by gravitational lensing in unprecedented detail. In this work, we analyze a series of mock catalogs with ray-traced gravitational lensing and increasing sophistication to estimate systematic effects on galaxy-galaxy lensing estimators such as the tangential shear $\\gamma_{\\mathrm{t}}$ and the excess surface density $\\Delta\\Sigma$. We employ mock catalogs tailored to the specific imaging surveys overlapping with the DESI survey: the Dark Energy Survey (DES), the Hyper Suprime-Cam (HSC) survey, and the Kilo-Degree Survey (KiDS). Among others, we find that fiber incompleteness can have significant effects on galaxy-galaxy lensing estimators but can be corrected effectively by up-weighting DESI targets with fibers by the inverse of the fiber assignment probability. Similarly, we show that intrinsic alignment and lens magnification are expected to be statistically significant given the precision forecasted for the DESI year-1 data set. Our study informs several analysis choices for upcoming cross-correlation studies of DESI with DES, HSC, and KiDS.","sentences":["The Dark Energy Spectroscopic Instrument (DESI) survey will measure spectroscopic redshifts for millions of galaxies across roughly $14,000 \\, \\mathrm{deg}^2$ of the sky.","Cross-correlating targets in the DESI survey with complementary imaging surveys allows us to measure and analyze shear distortions caused by gravitational lensing in unprecedented detail.","In this work, we analyze a series of mock catalogs with ray-traced gravitational lensing and increasing sophistication to estimate systematic effects on galaxy-galaxy lensing estimators such as the tangential shear $\\gamma_{\\mathrm{t}}$ and the excess surface density $\\Delta\\Sigma$. We employ mock catalogs tailored to the specific imaging surveys overlapping with the DESI survey: the Dark Energy Survey (DES), the Hyper Suprime-Cam (HSC) survey, and the Kilo-Degree Survey (KiDS).","Among others, we find that fiber incompleteness can have significant effects on galaxy-galaxy lensing estimators but can be corrected effectively by up-weighting DESI targets with fibers by the inverse of the fiber assignment probability.","Similarly, we show that intrinsic alignment and lens magnification are expected to be statistically significant given the precision forecasted for the DESI year-1 data set.","Our study informs several analysis choices for upcoming cross-correlation studies of DESI with DES, HSC, and KiDS."],"url":"http://arxiv.org/abs/2404.09397v1","category":"astro-ph.CO"}
{"created":"2024-04-14 19:57:29","title":"Blue quantum emitter in hexagonal boron nitride and carbon chain tetramer: proposition of identification","abstract":"Single photon emitters in hexagonal boron nitride offer a gateway to the future of quantum technologies, yet their identification remains challenging and subject to ongoing debate. We demonstrate through ab initio calculations that the optical properties of a carbon chain tetramer are in excellent agreement with the characteristics of a blue quantum emitter in hexagonal boron nitride emitting at 435 nm. Its calculated zero-phonon line energy (2.77 eV) and radiative lifetime (1.6 ns) perfectly align with experimental observations. The relatively weak electron--phonon coupling (Huang-Rhys factor of 1.5) indicates intense emission at the zero-phonon line. Despite the absence of an inversion center in the carbon tetramer, we demonstrate that it exhibits a negligible linear Stark effect, consistent with experimental findings. Additionally, our hypothesis explains the experimental observation that the formation of blue emitters is only possible in samples containing numerous ultraviolet emitters, which are likely identical to carbon dimers.","sentences":["Single photon emitters in hexagonal boron nitride offer a gateway to the future of quantum technologies, yet their identification remains challenging and subject to ongoing debate.","We demonstrate through ab initio calculations that the optical properties of a carbon chain tetramer are in excellent agreement with the characteristics of a blue quantum emitter in hexagonal boron nitride emitting at 435 nm.","Its calculated zero-phonon line energy (2.77 eV) and radiative lifetime (1.6 ns) perfectly align with experimental observations.","The relatively weak electron--phonon coupling (Huang-Rhys factor of 1.5) indicates intense emission at the zero-phonon line.","Despite the absence of an inversion center in the carbon tetramer, we demonstrate that it exhibits a negligible linear Stark effect, consistent with experimental findings.","Additionally, our hypothesis explains the experimental observation that the formation of blue emitters is only possible in samples containing numerous ultraviolet emitters, which are likely identical to carbon dimers."],"url":"http://arxiv.org/abs/2404.09345v1","category":"cond-mat.mtrl-sci"}
{"created":"2024-04-14 19:47:52","title":"Nitrogen-monovacancy (VN) Hexagonal Boron Nitride 2D Monolayer Material as an Efficient Electrocatalyst for CO2 Reduction Reaction","abstract":"The conversion of waste carbon dioxide (CO2) gas into valuable products and fuels through an electrocatalytic CO2 reduction reaction (CO2RR) is a promising approach. The sluggish kinetics of the CO2RR require the development of novel strategies for electrocatalyst design. Two-dimensional (2D) materials emerge as promising candidates for CO2RR due to their distinctive electronic and structural properties. This study follows the first principles based DFT-D method to examine the electrocatalytic competences of the defective two-dimensional boron nitride monolayer (d-BN) material towards CO2RR. Introducing a particular defect with nitrogen vacancies in the 2D single layer pristine hexagonal boron nitride (VN_d-BN) can efficiently activate the CO2 molecules for hydrogenation by reducing the electronic band gap of the pristine hBN from 6.23 eV to 3.0 eV. Therefore, VN_d-BN material can act as a large band gap semiconductor. Our findings demonstrate that the defective regions in the 2D monolayer VN_d-BN serve as active sites (Boron) for both the adsorption and activation of CO2. The subsequent hydrogenation steps occur sequentially once the CO2 molecule is adsorbed on the catalytic surface. Our results indicate that the OCHO* path is the most favorable for CH4 production. Hence, the 2D monolayer VN_d-BN material holds a great promise as a cost-effective catalyst for CO2RR, and it presents a viable alternative to expensive platinum (Pt) catalysts.","sentences":["The conversion of waste carbon dioxide (CO2) gas into valuable products and fuels through an electrocatalytic CO2 reduction reaction (CO2RR) is a promising approach.","The sluggish kinetics of the CO2RR require the development of novel strategies for electrocatalyst design.","Two-dimensional (2D) materials emerge as promising candidates for CO2RR due to their distinctive electronic and structural properties.","This study follows the first principles based DFT-D method to examine the electrocatalytic competences of the defective two-dimensional boron nitride monolayer (d-BN) material towards CO2RR.","Introducing a particular defect with nitrogen vacancies in the 2D single layer pristine hexagonal boron nitride (VN_d-BN) can efficiently activate the CO2 molecules for hydrogenation by reducing the electronic band gap of the pristine hBN from 6.23 eV to 3.0 eV. Therefore, VN_d-BN material can act as a large band gap semiconductor.","Our findings demonstrate that the defective regions in the 2D monolayer VN_d-BN serve as active sites (Boron) for both the adsorption and activation of CO2.","The subsequent hydrogenation steps occur sequentially once the CO2 molecule is adsorbed on the catalytic surface.","Our results indicate that the OCHO* path is the most favorable for CH4 production.","Hence, the 2D monolayer VN_d-BN material holds a great promise as a cost-effective catalyst for CO2RR, and it presents a viable alternative to expensive platinum (Pt) catalysts."],"url":"http://arxiv.org/abs/2404.09340v1","category":"cond-mat.mtrl-sci"}
{"created":"2024-04-14 15:01:34","title":"Upper Bound of Barrow Entropy Index from Black Hole Fragmentation","abstract":"Both classical and quantum arguments suggest that if Barrow entropy is correct, its index $\\delta$ must be energy dependent, which would affect the very early universe. Based on thermodynamic stability that sufficiently large black holes should not fragment, we argue that Barrow entropy correction must be small except possibly at the Planckian regime. Furthermore, the fact that a solar mass black hole does not fragment implies an upper bound $\\delta \\lesssim O(10^{-3})$, which surprisingly lies in the same range as the bound obtained from some cosmological considerations assuming fixed $\\delta$. This indicates that allowing $\\delta$ to run does not raise its allowed value. We briefly comment on the case of Kaniadakis entropy.","sentences":["Both classical and quantum arguments suggest that if Barrow entropy is correct, its index $\\delta$ must be energy dependent, which would affect the very early universe.","Based on thermodynamic stability that sufficiently large black holes should not fragment, we argue that Barrow entropy correction must be small except possibly at the Planckian regime.","Furthermore, the fact that a solar mass black hole does not fragment implies an upper bound $\\delta \\lesssim O(10^{-3})$, which surprisingly lies in the same range as the bound obtained from some cosmological considerations assuming fixed $\\delta$. This indicates that allowing $\\delta$ to run does not raise its allowed value.","We briefly comment on the case of Kaniadakis entropy."],"url":"http://arxiv.org/abs/2404.09278v1","category":"gr-qc"}
{"created":"2024-04-14 14:24:45","title":"The Next Generation of MeV Energy X-ray Sources for use in the Inspection of Additively Manufactured Parts for Industry","abstract":"For the first time, we demonstrate the application of an inverse Compton scattering X-ray Source, driven by a laser-plasma accelerator, to image an additively manufactured component. X-rays with a mean energy of 380 keV were produced and used to image an additively manufactured part made of an Inconel (Nickel 718) alloy. Because inverse Compton scattering driven by laser-plasma acceleration produces high-energy X-rays while maintaining a focal spot size on the order of a micron, the source can provide several benefits over conventional X-ray production methods, particularly when imaging superalloy parts, with the potential to revolutionise what can be inspected.","sentences":["For the first time, we demonstrate the application of an inverse Compton scattering X-ray Source, driven by a laser-plasma accelerator, to image an additively manufactured component.","X-rays with a mean energy of 380 keV were produced and used to image an additively manufactured part made of an Inconel (Nickel 718) alloy.","Because inverse Compton scattering driven by laser-plasma acceleration produces high-energy X-rays while maintaining a focal spot size on the order of a micron, the source can provide several benefits over conventional X-ray production methods, particularly when imaging superalloy parts, with the potential to revolutionise what can be inspected."],"url":"http://arxiv.org/abs/2404.09270v1","category":"physics.acc-ph"}
{"created":"2024-04-14 13:29:34","title":"Inertial range of magnetorotational turbulence","abstract":"Accretion disks around compact stars are formed due to turbulence driven by magnetorotational instability. Despite over thirty years of numerous computational studies on magnetorotational turbulence, the properties of fluctuations in the inertial range -- where cross-scale energy transfer dominates over energy injection -- have remained elusive, primarily due to insufficient numerical resolution. Here, we report the highest-resolution simulation of magnetorotational turbulence ever conducted. Our simulations reveal a constant cross-scale energy flux, a hallmark of the inertial range. We found that as the cascade proceeds to smaller scales in the inertial range, the kinetic and magnetic energies tend toward equipartitioning with the same spectral slope, and slow-magnetosonic fluctuations dominate over Alfv\\'enic fluctuations, possessing twice the energy. These findings align remarkably with the theoretical expectations from the reduced magnetohydrodynamic model, which assumes a near-azimuthal mean magnetic field. Our results provide important implications for interpreting the radio observations by the Event Horizon Telescope.","sentences":["Accretion disks around compact stars are formed due to turbulence driven by magnetorotational instability.","Despite over thirty years of numerous computational studies on magnetorotational turbulence, the properties of fluctuations in the inertial range -- where cross-scale energy transfer dominates over energy injection -- have remained elusive, primarily due to insufficient numerical resolution.","Here, we report the highest-resolution simulation of magnetorotational turbulence ever conducted.","Our simulations reveal a constant cross-scale energy flux, a hallmark of the inertial range.","We found that as the cascade proceeds to smaller scales in the inertial range, the kinetic and magnetic energies tend toward equipartitioning with the same spectral slope, and slow-magnetosonic fluctuations dominate over Alfv\\'enic fluctuations, possessing twice the energy.","These findings align remarkably with the theoretical expectations from the reduced magnetohydrodynamic model, which assumes a near-azimuthal mean magnetic field.","Our results provide important implications for interpreting the radio observations by the Event Horizon Telescope."],"url":"http://arxiv.org/abs/2404.09252v1","category":"physics.plasm-ph"}
{"created":"2024-04-14 11:30:28","title":"Observation of $D \\to a_{0}(980)π$ in the decays $D^{0} \\rightarrow π^{+}π^{-}η$ and $D^{+} \\rightarrow π^{+}π^{0}η$","abstract":"We report the first amplitude analysis of the decays $D^{0} \\to \\pi^{+} \\pi^{-} \\eta$ and $D^{+} \\rightarrow \\pi^{+}\\pi^{0}\\eta$ using a data sample taken with the BESIII detector at the center-of-mass energy of 3.773 GeV, corresponding to an integrated luminosity of 7.9 ${\\rm fb}^{-1}$. The contribution from the process $D^{0(+)} \\to a_{0}(980)^{+} \\pi^{-(0)}$ is significantly larger than the $D^{0(+)} \\to a_{0}(980)^{-(0)} \\pi^{+}$ contribution. The ratios $\\mathcal{B}(D^{0} \\rightarrow a_{0}(980)^{+}\\pi^{-})/\\mathcal{B}(D^{0} \\rightarrow a_{0}(980)^{-}\\pi^{+})$ and $\\mathcal{B}(D^{+} \\rightarrow a_{0}(980)^{+}\\pi^{0})/\\mathcal{B}(D^{+} \\rightarrow a_{0}(980)^{0}\\pi^{+})$ are measured to be $7.5^{+2.5}_{-0.8\\,\\mathrm{stat.}}\\pm1.7_{\\mathrm{syst.}}$ and $2.6\\pm0.6_{\\mathrm{stat.}}\\pm0.3_{\\mathrm{syst.}}$, respectively. The measured $D^{0}$ ratio disagrees with the theoretical predictions by orders of magnitudes, thus implying a substantial contribution from final-state interactions.","sentences":["We report the first amplitude analysis of the decays $D^{0} \\to \\pi^{+} \\pi^{-} \\eta$ and $D^{+} \\rightarrow \\pi^{+}\\pi^{0}\\eta$ using a data sample taken with the BESIII detector at the center-of-mass energy of 3.773 GeV, corresponding to an integrated luminosity of 7.9 ${\\rm fb}^{-1}$. The contribution from the process $D^{0(+)} \\to a_{0}(980)^{+} \\pi^{-(0)}$ is significantly larger than the $D^{0(+)} \\to a_{0}(980)^{-(0)} \\pi^{+}$ contribution.","The ratios $\\mathcal{B}(D^{0} \\rightarrow a_{0}(980)^{+}\\pi^{-})/\\mathcal{B}(D^{0} \\rightarrow a_{0}(980)^{-}\\pi^{+})$ and $\\mathcal{B}(D^{+} \\rightarrow a_{0}(980)^{+}\\pi^{0})/\\mathcal{B}(D^{+} \\rightarrow a_{0}(980)^{0}\\pi^{+})$ are measured to be $7.5^{+2.5}_{-0.8\\,\\mathrm{stat.}}\\pm1.7_{\\mathrm{syst.}}$ and $2.6\\pm0.6_{\\mathrm{stat.}}\\pm0.3_{\\mathrm{syst.}}$, respectively.","The measured $D^{0}$ ratio disagrees with the theoretical predictions by orders of magnitudes, thus implying a substantial contribution from final-state interactions."],"url":"http://arxiv.org/abs/2404.09219v1","category":"hep-ex"}
{"created":"2024-04-14 09:52:56","title":"Apparent violation of causality in relativistic quantum mechanics","abstract":"In relativistic theories the principle of microscopic causality states that ``information cannot travel faster than the speed of light'' \\cite{kaku}. In the present work we show that the time evolution of relativistic wave functions violates this principle. We consider here the wave functions of massless and massive particles. In the case of massless particles the wave functions which violate the microscopic causality have an analytic form while in the case of massive particles we have to rely on numerical calculations. In both cases the wave functions which are strictly localized at $t=0$, at later times do not vanish {\\it outside} the future light cone. \\end{abstract}","sentences":["In relativistic theories the principle of microscopic causality states that ``information cannot travel faster than the speed of light'' \\cite{kaku}.","In the present work we show that the time evolution of relativistic wave functions violates this principle.","We consider here the wave functions of massless and massive particles.","In the case of massless particles the wave functions which violate the microscopic causality have an analytic form while in the case of massive particles we have to rely on numerical calculations.","In both cases the wave functions which are strictly localized at $t=0$, at later times do not vanish {\\it outside} the future light cone.","\\end{abstract}"],"url":"http://arxiv.org/abs/2404.09205v1","category":"quant-ph"}
{"created":"2024-04-14 09:14:14","title":"Surfactant-laden bubble bursting: dynamics of capillary waves and Worthington jet at large Bond number","abstract":"We present a numerical study of the main sub-stages preceding aerosol formation via bursting bubbles: capillary wave propagation along the bubble, convergence at the bubble's apex, the ascent of a Worthington jet and its break-up to release liquid drops. We focus on two crucial yet overlooked aspects of the system: the presence of surface-active agents and dynamics driven by non-negligible gravitational effects, quantified by the Bond number. Our results propose, for the first time, a mechanism explaining capillary wave retardation in the presence of surfactants, involving the transition from bi- to uni-directional Marangoni stresses, which pull the interface upwards, countering the motion of the waves. We also quantitatively elucidate the variable nature of the waves' velocity with various surfactant parameters, including surfactant solubility and elasticity, a departure from the constant behaviour well-documented in clean interfaces.","sentences":["We present a numerical study of the main sub-stages preceding aerosol formation via bursting bubbles: capillary wave propagation along the bubble, convergence at the bubble's apex, the ascent of a Worthington jet and its break-up to release liquid drops.","We focus on two crucial yet overlooked aspects of the system: the presence of surface-active agents and dynamics driven by non-negligible gravitational effects, quantified by the Bond number.","Our results propose, for the first time, a mechanism explaining capillary wave retardation in the presence of surfactants, involving the transition from bi- to uni-directional Marangoni stresses, which pull the interface upwards, countering the motion of the waves.","We also quantitatively elucidate the variable nature of the waves' velocity with various surfactant parameters, including surfactant solubility and elasticity, a departure from the constant behaviour well-documented in clean interfaces."],"url":"http://arxiv.org/abs/2404.09196v1","category":"physics.flu-dyn"}
{"created":"2024-04-14 08:51:27","title":"The enigmatic exponent koppa and the story of finite-size scaling above the upper critical dimension","abstract":"Scaling, hyperscaling and finite-size scaling were long considered problematic in theories of critical phenomena in high dimensions. The scaling relations themselves form a model-independent structure that any model-specific theory must adhere to, and they are accounted for by the simple principle of homogeneity. Finite-size scaling is similarly founded on the fundamental idea that only two length scales enter the game -- namely system length and correlation length. While all scaling relations are quite satisfactory for multitudes of physical systems in low dimensions, one fails in high dimensions...","sentences":["Scaling, hyperscaling and finite-size scaling were long considered problematic in theories of critical phenomena in high dimensions.","The scaling relations themselves form a model-independent structure that any model-specific theory must adhere to, and they are accounted for by the simple principle of homogeneity.","Finite-size scaling is similarly founded on the fundamental idea that only two length scales enter the game -- namely system length and correlation length.","While all scaling relations are quite satisfactory for multitudes of physical systems in low dimensions, one fails in high dimensions..."],"url":"http://arxiv.org/abs/2404.09191v1","category":"cond-mat.stat-mech"}
{"created":"2024-04-14 08:38:41","title":"Stable Acceleration of a LHe-Free Nb3Sn demo SRF e-linac Based on Conduction Cooling","abstract":"The design, construction, and commissioning of a conduction-cooled Nb3Sn demonstration superconducting radio frequency (SRF) electron accelerator at the Institute of Modern Physics of the Chinese Academy of Sciences (IMP, CAS) will be presented. In the context of engineering application planning for Nb3Sn thin-film SRF cavities within the CiADS project, a 650MHz 5-cell elliptical cavity was coated using the vapor diffusion method for electron beam acceleration. Through high-precision collaborative control of 10 GM cryocooler, slow cooldown of the cavity crossing 18K is achieved accompanied by obviously characteristic magnetic flux expulsion. The horizontal test results of the liquid helium-free (LHe-free) cryomodule show that the cavity can operate steadily at Epk=6.02MV/m in continuous wave (CW) mode, and at Epk=14.90MV/m in 40% duty cycle pulse mode. The beam acceleration experiment indicates that the maximum average current of the electron beam in the macropulse after acceleration exceeds 200mA, with a maximum energy gain of 4.6MeV. The results provide a principle validation for the engineering application of Nb3Sn thin-film SRF cavities, highlighting the promising industrial application prospects of a small-scale compact Nb3Sn SRF accelerator driven by commercial cryocoolers.","sentences":["The design, construction, and commissioning of a conduction-cooled Nb3Sn demonstration superconducting radio frequency (SRF) electron accelerator at the Institute of Modern Physics of the Chinese Academy of Sciences (IMP, CAS) will be presented.","In the context of engineering application planning for Nb3Sn thin-film SRF cavities within the CiADS project, a 650MHz 5-cell elliptical cavity was coated using the vapor diffusion method for electron beam acceleration.","Through high-precision collaborative control of 10 GM cryocooler, slow cooldown of the cavity crossing 18K is achieved accompanied by obviously characteristic magnetic flux expulsion.","The horizontal test results of the liquid helium-free (LHe-free) cryomodule show that the cavity can operate steadily at Epk=6.02MV/m in continuous wave (CW) mode, and at Epk=14.90MV/m in 40% duty cycle pulse mode.","The beam acceleration experiment indicates that the maximum average current of the electron beam in the macropulse after acceleration exceeds 200mA, with a maximum energy gain of 4.6MeV. The results provide a principle validation for the engineering application of Nb3Sn thin-film SRF cavities, highlighting the promising industrial application prospects of a small-scale compact Nb3Sn SRF accelerator driven by commercial cryocoolers."],"url":"http://arxiv.org/abs/2404.09187v1","category":"physics.acc-ph"}
{"created":"2024-04-14 08:15:03","title":"Coexistence of interacting charge density waves in a layered semiconductor","abstract":"Coexisting orders are key features of strongly correlated materials and underlie many intriguing phenomena from unconventional superconductivity to topological orders. Here, we report the coexistence of two interacting charge-density-wave (CDW) orders in EuTe4, a layered crystal that has drawn considerable attention owing to its anomalous thermal hysteresis and a semiconducting CDW state despite the absence of perfect FS nesting. By accessing unoccupied conduction bands with time- and angle-resolved photoemission measurements, we find that mono- and bi-layers of Te in the unit cell host different CDWs that are associated with distinct energy gaps. The two gaps display dichotomous evolutions following photoexcitation, where the larger bilayer CDW gap exhibits less renormalization and faster recovery. Surprisingly, the CDW in the Te monolayer displays an additional momentum-dependent gap renormalization that cannot be captured by density-functional theory calculations. This phenomenon is attributed to interlayer interactions between the two CDW orders, which account for the semiconducting nature of the equilibrium state. Our findings not only offer microscopic insights into the correlated ground state of EuTe4 but also provide a general non-equilibrium approach to understand coexisting, layer-dependent orders in a complex system.","sentences":["Coexisting orders are key features of strongly correlated materials and underlie many intriguing phenomena from unconventional superconductivity to topological orders.","Here, we report the coexistence of two interacting charge-density-wave (CDW) orders in EuTe4, a layered crystal that has drawn considerable attention owing to its anomalous thermal hysteresis and a semiconducting CDW state despite the absence of perfect FS nesting.","By accessing unoccupied conduction bands with time- and angle-resolved photoemission measurements, we find that mono- and bi-layers of Te in the unit cell host different CDWs that are associated with distinct energy gaps.","The two gaps display dichotomous evolutions following photoexcitation, where the larger bilayer CDW gap exhibits less renormalization and faster recovery.","Surprisingly, the CDW in the Te monolayer displays an additional momentum-dependent gap renormalization that cannot be captured by density-functional theory calculations.","This phenomenon is attributed to interlayer interactions between the two CDW orders, which account for the semiconducting nature of the equilibrium state.","Our findings not only offer microscopic insights into the correlated ground state of EuTe4 but also provide a general non-equilibrium approach to understand coexisting, layer-dependent orders in a complex system."],"url":"http://arxiv.org/abs/2404.09182v1","category":"cond-mat.str-el"}
{"created":"2024-04-14 06:27:47","title":"Topological rainbow trapping and broadband piezoelectric energy harvesting of acoustic waves in gradient phononic crystals with coupled interfaces","abstract":"Topological phononic crystals (PCs) offer a novel approach to control the behavior of acoustic or elastic waves. In this paper, we design the gradient PC structures with coupled interfaces to realize topological rainbow trapping and broadband acoustic energy harvesting. Based on the geometric symmetry of PC unit cells, we construct the coupled topological interfaces by amalgamating two PCs with distinct topological phases. Also, the gradient modulation of structural parameters along the coupled interfaces is employed for the generation of rainbow trapping. Subsequently, a polyvinylidene fluoride (PVDF) film is mounted along the coupled interfaces of the gradient PC structures, facilitating the conversion of acoustic energy into electrical energy. The numerical and experimental results show that the acoustic waves at different frequencies stop and are amplified at different positions of the coupled interfaces. Compared with the harvester in a bare structure, the topological PC energy harvester significantly enhances the output power at different excited frequencies. In the experiments, the maximum amplification ratio of the output power reaches 91. Besides, it is demonstrated that the topological rainbow trapping of acoustic waves exhibits robustness against random structural disorders. Notably, the coupled interfaces have broadband and multi-mode features, which are promising for other applications such as selective filtering and sensing enhancement.","sentences":["Topological phononic crystals (PCs) offer a novel approach to control the behavior of acoustic or elastic waves.","In this paper, we design the gradient PC structures with coupled interfaces to realize topological rainbow trapping and broadband acoustic energy harvesting.","Based on the geometric symmetry of PC unit cells, we construct the coupled topological interfaces by amalgamating two PCs with distinct topological phases.","Also, the gradient modulation of structural parameters along the coupled interfaces is employed for the generation of rainbow trapping.","Subsequently, a polyvinylidene fluoride (PVDF) film is mounted along the coupled interfaces of the gradient PC structures, facilitating the conversion of acoustic energy into electrical energy.","The numerical and experimental results show that the acoustic waves at different frequencies stop and are amplified at different positions of the coupled interfaces.","Compared with the harvester in a bare structure, the topological PC energy harvester significantly enhances the output power at different excited frequencies.","In the experiments, the maximum amplification ratio of the output power reaches 91.","Besides, it is demonstrated that the topological rainbow trapping of acoustic waves exhibits robustness against random structural disorders.","Notably, the coupled interfaces have broadband and multi-mode features, which are promising for other applications such as selective filtering and sensing enhancement."],"url":"http://arxiv.org/abs/2404.09160v1","category":"physics.app-ph"}
{"created":"2024-04-14 06:20:58","title":"Heavy Particle Towers and Nonlocal QFT","abstract":"A number of gravitation-motivated theories, as well as theories with new coloured fermions predict heavy particle towers with spectral densities $\\rho(m^2)$ growing faster than $e^{m}$, a characteristic of nonlocalizable theories. It is shown that if a light scalar, like the Higgs boson, interacts strongly with a heavy scalar particle tower with exponentially rising degeneracy, then the local low-energy theory is equivalent to an effective nonlocal scalar QFT. For energies approaching the nonlocality scale $p^2\\simeq\\Lambda_{NL}^2$, the scalar propagator and scattering amplitudes are modified by nonlocal factors of the form $e^{p^2/\\Lambda^2_{NL}}$. The double-Higgs production measurement at the LHC is proposed as a highly sensitive probe of nonlocality at the electroweak scale.","sentences":["A number of gravitation-motivated theories, as well as theories with new coloured fermions predict heavy particle towers with spectral densities $\\rho(m^2)$ growing faster than $e^{m}$, a characteristic of nonlocalizable theories.","It is shown that if a light scalar, like the Higgs boson, interacts strongly with a heavy scalar particle tower with exponentially rising degeneracy, then the local low-energy theory is equivalent to an effective nonlocal scalar QFT.","For energies approaching the nonlocality scale $p^2\\simeq\\Lambda_{NL}^2$, the scalar propagator and scattering amplitudes are modified by nonlocal factors of the form $e^{p^2/\\Lambda^2_{NL}}$. The double-Higgs production measurement at the LHC is proposed as a highly sensitive probe of nonlocality at the electroweak scale."],"url":"http://arxiv.org/abs/2404.09159v1","category":"hep-ph"}
{"created":"2024-04-14 06:18:16","title":"Statistics of Extremes for Neuroscience","abstract":"This chapter illustrates how tools from univariate and multivariate statistics of extremes can complement classical methods used to study brain signals and enhance the understanding of brain activity and connectivity during specific cognitive tasks or abnormal episodes, such as an epileptic seizure.","sentences":["This chapter illustrates how tools from univariate and multivariate statistics of extremes can complement classical methods used to study brain signals and enhance the understanding of brain activity and connectivity during specific cognitive tasks or abnormal episodes, such as an epileptic seizure."],"url":"http://arxiv.org/abs/2404.09157v1","category":"stat.AP"}
{"created":"2024-04-14 05:38:22","title":"Tuning the thermal conductivity of Si membrane using nanopillars: from crystalline to amorphous pillars","abstract":"Tuning thermal transport in nanostructures is essential for many applications, such as thermal management and thermoelectrics. Nanophononic metamaterials (NPM) have shown great potential for reducing thermal conductivity by introducing local resonant hybridization. In this work, the thermal conductivity of NPM with crystalline Si (c-Si) pillar, crystalline Ge (c-Ge) pillar and amorphous Si (a-Si) pillar are systematically investigated by molecular dynamics method. The analyses of phonon dispersion and spectral energy density show that phonon dispersions of Si membrane are flattened due to local resonant hybridization induced by both crystalline and amorphous pillar. In addition, a-Si pillar can cause larger reduction of thermal conductivity compared with c-Si pillar. Specifically, when increasing the atomic mass of atoms in pillars, the thermal conductivity of NPMs with crystalline pillar is increased because of the weakened phonon hybridization, however, the thermal conductivity of NPMs with amorphous pillar is almost unchanged, which indicates that the phonon transports are mainly affected by the scatterings at the interface between amorphous pillar and Si membrane. The results of this work can provide meaningful insights on controlling thermal transport in NPMs by choosing the materials and atomic mass of pillars for specific applications.","sentences":["Tuning thermal transport in nanostructures is essential for many applications, such as thermal management and thermoelectrics.","Nanophononic metamaterials (NPM) have shown great potential for reducing thermal conductivity by introducing local resonant hybridization.","In this work, the thermal conductivity of NPM with crystalline Si (c-Si) pillar, crystalline Ge (c-Ge) pillar and amorphous Si (a-Si) pillar are systematically investigated by molecular dynamics method.","The analyses of phonon dispersion and spectral energy density show that phonon dispersions of Si membrane are flattened due to local resonant hybridization induced by both crystalline and amorphous pillar.","In addition, a-Si pillar can cause larger reduction of thermal conductivity compared with c-Si pillar.","Specifically, when increasing the atomic mass of atoms in pillars, the thermal conductivity of NPMs with crystalline pillar is increased because of the weakened phonon hybridization, however, the thermal conductivity of NPMs with amorphous pillar is almost unchanged, which indicates that the phonon transports are mainly affected by the scatterings at the interface between amorphous pillar and Si membrane.","The results of this work can provide meaningful insights on controlling thermal transport in NPMs by choosing the materials and atomic mass of pillars for specific applications."],"url":"http://arxiv.org/abs/2404.09148v1","category":"cond-mat.mtrl-sci"}
{"created":"2024-04-14 04:24:40","title":"Gamma-ray variability and multi-wavelength insights into the unprecedented outburst from 4C 31.03","abstract":"The blazar 4C 31.03 recently underwent a major gamma-ray outburst at the beginning of 2023 after a prolonged quiescent phase. Fermi-LAT reported a daily average flux of 5x10^-6 phs cm^-2 s^-1, which is about 60 times its average value. We investigated this extraordinary outbreak through temporal and multi-wavelength analysis. From the statistical analysis of the gamma-ray lightcurves using Bayesian blocks, we identified 3 epochs of prominent flares. The fastest flux decay during this major outburst was observed within 5.5 +/- 0.7 hours. The highest energy of gamma-ray photons found from the source during the active phase is ~ 82 GeV. Using the transparency of gamma-rays against pair production and light crossing time argument, we could obtain the minimum jet Doppler factor as 17 corresponding to the flaring state.The broadband spectral energy distribution study performed using synchrotron, SSC and EC emission processes supports the external Compton scattering of IR photons as the likely mechanism for the gamma-ray emission from the source. The results of this study suggest the scenario of the emission region in 4C 31.03, being located beyond the Broad-line region from the central blackhole. Long-term gamma-ray flux distribution of 4C 31.03 depicts a double log-normal variability, indicating that two distinct flux states are active in this energy band. The index distribution also reveals a two distinct variability patterns, suggesting that the gamma-ray spectrum can be more precisely described by two photon indices.","sentences":["The blazar 4C 31.03 recently underwent a major gamma-ray outburst at the beginning of 2023 after a prolonged quiescent phase.","Fermi-LAT reported a daily average flux of 5x10^-6 phs cm^-2 s^-1, which is about 60 times its average value.","We investigated this extraordinary outbreak through temporal and multi-wavelength analysis.","From the statistical analysis of the gamma-ray lightcurves using Bayesian blocks, we identified 3 epochs of prominent flares.","The fastest flux decay during this major outburst was observed within 5.5 +/- 0.7 hours.","The highest energy of gamma-ray photons found from the source during the active phase is ~ 82 GeV. Using the transparency of gamma-rays against pair production and light crossing time argument, we could obtain the minimum jet Doppler factor as 17 corresponding to the flaring state.","The broadband spectral energy distribution study performed using synchrotron, SSC and EC emission processes supports the external Compton scattering of IR photons as the likely mechanism for the gamma-ray emission from the source.","The results of this study suggest the scenario of the emission region in 4C 31.03, being located beyond the Broad-line region from the central blackhole.","Long-term gamma-ray flux distribution of 4C 31.03 depicts a double log-normal variability, indicating that two distinct flux states are active in this energy band.","The index distribution also reveals a two distinct variability patterns, suggesting that the gamma-ray spectrum can be more precisely described by two photon indices."],"url":"http://arxiv.org/abs/2404.09137v1","category":"astro-ph.HE"}
{"created":"2024-04-14 02:35:23","title":"Treatment Effect Heterogeneity and Importance Measures for Multivariate Continuous Treatments","abstract":"Estimating the joint effect of a multivariate, continuous exposure is crucial, particularly in environmental health where interest lies in simultaneously evaluating the impact of multiple environmental pollutants on health. We develop novel methodology that addresses two key issues for estimation of treatment effects of multivariate, continuous exposures. We use nonparametric Bayesian methodology that is flexible to ensure our approach can capture a wide range of data generating processes. Additionally, we allow the effect of the exposures to be heterogeneous with respect to covariates. Treatment effect heterogeneity has not been well explored in the causal inference literature for multivariate, continuous exposures, and therefore we introduce novel estimands that summarize the nature and extent of the heterogeneity, and propose estimation procedures for new estimands related to treatment effect heterogeneity. We provide theoretical support for the proposed models in the form of posterior contraction rates and show that it works well in simulated examples both with and without heterogeneity. We apply our approach to a study of the health effects of simultaneous exposure to the components of PM$_{2.5}$ and find that the negative health effects of exposure to these environmental pollutants is exacerbated by low socioeconomic status and age.","sentences":["Estimating the joint effect of a multivariate, continuous exposure is crucial, particularly in environmental health where interest lies in simultaneously evaluating the impact of multiple environmental pollutants on health.","We develop novel methodology that addresses two key issues for estimation of treatment effects of multivariate, continuous exposures.","We use nonparametric Bayesian methodology that is flexible to ensure our approach can capture a wide range of data generating processes.","Additionally, we allow the effect of the exposures to be heterogeneous with respect to covariates.","Treatment effect heterogeneity has not been well explored in the causal inference literature for multivariate, continuous exposures, and therefore we introduce novel estimands that summarize the nature and extent of the heterogeneity, and propose estimation procedures for new estimands related to treatment effect heterogeneity.","We provide theoretical support for the proposed models in the form of posterior contraction rates and show that it works well in simulated examples both with and without heterogeneity.","We apply our approach to a study of the health effects of simultaneous exposure to the components of PM$_{2.5}$ and find that the negative health effects of exposure to these environmental pollutants is exacerbated by low socioeconomic status and age."],"url":"http://arxiv.org/abs/2404.09126v1","category":"stat.ME"}
{"created":"2024-04-14 02:09:26","title":"Interfacial reaction boosts thermal conductance of room-temperature integrated semiconductor interfaces stable up to 1100 C","abstract":"Overheating has emerged as a primary challenge constraining the reliability and performance of next-generation high-performance electronics, such as chiplets and (ultra)wide bandgap electronics. Advanced heterogeneous integration not only constitutes a pivotal technique for fabricating these electronics but also offers potential solutions for thermal management. This study presents the integration of high thermal conductivity semiconductors, specifically, 3C-SiC thin films and diamond substrates, through a room-temperature surface-activated bonding technique. Notably, the thermal conductivity of the 3C-SiC films is among the highest for all semiconductor films which can be integrated near room temperature with similar thicknesses. Furthermore, following annealing, the interfaces between 3C-SiC and diamond demonstrate a remarkable enhancement in thermal boundary conductance (TBC), reaching up to approximately 300%, surpassing all other grown and bonded heterointerfaces. This enhancement is attributed to interfacial reactions, specifically the transformation of amorphous silicon into SiC upon interaction with diamond, which is further corroborated by picosecond ultrasonics measurements. Subsequent to annealing at 1100 C, the achieved TBC (150 MW/m2-K) is record-high among all bonded diamond interfaces. Additionally, the visualization of large-area TBC, facilitated by femtosecond laser-based time-domain thermoreflectance measurements, shows the uniformity of the interfaces which are capable of withstanding temperatures as high as 1100 C. Our research marks a significant advancement in the realm of thermally conductive heterogeneous integration, which is promising for enhanced cooling of next-generation electronics.","sentences":["Overheating has emerged as a primary challenge constraining the reliability and performance of next-generation high-performance electronics, such as chiplets and (ultra)wide bandgap electronics.","Advanced heterogeneous integration not only constitutes a pivotal technique for fabricating these electronics but also offers potential solutions for thermal management.","This study presents the integration of high thermal conductivity semiconductors, specifically, 3C-SiC thin films and diamond substrates, through a room-temperature surface-activated bonding technique.","Notably, the thermal conductivity of the 3C-SiC films is among the highest for all semiconductor films which can be integrated near room temperature with similar thicknesses.","Furthermore, following annealing, the interfaces between 3C-SiC and diamond demonstrate a remarkable enhancement in thermal boundary conductance (TBC), reaching up to approximately 300%, surpassing all other grown and bonded heterointerfaces.","This enhancement is attributed to interfacial reactions, specifically the transformation of amorphous silicon into SiC upon interaction with diamond, which is further corroborated by picosecond ultrasonics measurements.","Subsequent to annealing at 1100 C, the achieved TBC (150 MW/m2-K) is record-high among all bonded diamond interfaces.","Additionally, the visualization of large-area TBC, facilitated by femtosecond laser-based time-domain thermoreflectance measurements, shows the uniformity of the interfaces which are capable of withstanding temperatures as high as 1100 C. Our research marks a significant advancement in the realm of thermally conductive heterogeneous integration, which is promising for enhanced cooling of next-generation electronics."],"url":"http://arxiv.org/abs/2404.09120v1","category":"cond-mat.mes-hall"}
{"created":"2024-04-14 01:54:04","title":"Spin entanglement of multinucleons: experimental prospects","abstract":"Multiprotons and multineutrons are among the most exotic and mysterious things ever produced on earth. They provide an exceptional opportunity to understand nuclear forces and nuclear dynamics at extreme conditions, as well as neutron stars in the heaven. Quantum entanglement, referred to as ``spooky action at a distance'' by Einstein, is a ubiquitous yet deep property of quantum systems. It not only occupies a central position in quantum information science but also is investigated intensively in high energy physics, condensed matter physics, and quantum gravity. In comparison, the study of nuclear entanglement is still in infancy, and the entanglement properties of multiprotons and multineutrons in free space are generally unknown. Here, we study the crucial problem of how to measure spin entanglement of these multinucleons in nuclear experiments, with special emphases on two- and three-nucleon states. These findings open a freshly new direction for the multinucleon research. They are also useful for understanding entanglement properties of other exotic nuclear objects.","sentences":["Multiprotons and multineutrons are among the most exotic and mysterious things ever produced on earth.","They provide an exceptional opportunity to understand nuclear forces and nuclear dynamics at extreme conditions, as well as neutron stars in the heaven.","Quantum entanglement, referred to as ``spooky action at a distance'' by Einstein, is a ubiquitous yet deep property of quantum systems.","It not only occupies a central position in quantum information science but also is investigated intensively in high energy physics, condensed matter physics, and quantum gravity.","In comparison, the study of nuclear entanglement is still in infancy, and the entanglement properties of multiprotons and multineutrons in free space are generally unknown.","Here, we study the crucial problem of how to measure spin entanglement of these multinucleons in nuclear experiments, with special emphases on two- and three-nucleon states.","These findings open a freshly new direction for the multinucleon research.","They are also useful for understanding entanglement properties of other exotic nuclear objects."],"url":"http://arxiv.org/abs/2404.09116v1","category":"nucl-th"}
{"created":"2024-04-14 01:26:41","title":"The Timescales of Star Cluster Emergence: The Case of NGC 4449","abstract":"We survey the young star cluster population in the dwarf galaxy NGC4449 with the goal of investigating how stellar feedback may depend on the clusters' properties. Using Ultraviolet(UV)-optical-NearIR(NIR) photometry obtained from the Hubble Space Telescope, we have recovered 99 compact sources exhibiting emission in the Pa$\\beta$ hydrogen recombination line. Our analysis reveals these sources possess masses $10^{2}<M_{\\odot}<10^{5}$, ages 1-20 Myr, and color excess E(B - V) in the range 0-1.4. After selecting clusters with mass above 3,000M$_{\\odot}$ to mitigate stochastic sampling of the stellar initial mass function, we find that our IR-selected clusters have a median mass of $\\sim$7$\\times{10^{3}\\text{ M}_{\\odot}}$ and remain embedded in their surrounding gas and dust for 5-6 Myr. In contrast, line-emitting sources selected from existing UV/optically catalogs have a median mass of $\\sim$3.5$\\times{10^{4}\\text{ M}_{\\odot}}$ and have cleared their surroundings by 4 Myr. We further find that the environment in NGC4449 is too low pressure to drive these differences. We interpret these findings as evidence that the clearing timescale from pre-supernova and supernova feedback is cluster mass-dependent. Even in clusters with mass$\\sim$7,000~M$_{\\odot}$, stochastic sampling of the upper end of the stellar initial mass function is present, randomly decreasing the number of massive stars available to inject energy and momentum into the surrounding medium. This effect may increase the clearing timescales in these clusters by decreasing the effectiveness of both pre-supernova and supernova feedback; neither models nor observations have so far explored such dependence explicitly. Future studies and observations with, e.g., the JWST, will fill this gap.","sentences":["We survey the young star cluster population in the dwarf galaxy NGC4449 with the goal of investigating how stellar feedback may depend on the clusters' properties.","Using Ultraviolet(UV)-optical-NearIR(NIR) photometry obtained from the Hubble Space Telescope, we have recovered 99 compact sources exhibiting emission in the Pa$\\beta$ hydrogen recombination line.","Our analysis reveals these sources possess masses $10^{2}<M_{\\odot}<10^{5}$, ages 1-20 Myr, and color excess E(B - V) in the range 0-1.4.","After selecting clusters with mass above 3,000M$_{\\odot}$ to mitigate stochastic sampling of the stellar initial mass function, we find that our IR-selected clusters have a median mass of $\\sim$7$\\times{10^{3}\\text{ M}_{\\odot}}$ and remain embedded in their surrounding gas and dust for 5-6 Myr.","In contrast, line-emitting sources selected from existing UV/optically catalogs have a median mass of $\\sim$3.5$\\times{10^{4}\\text{ M}_{\\odot}}$ and have cleared their surroundings by 4 Myr.","We further find that the environment in NGC4449 is too low pressure to drive these differences.","We interpret these findings as evidence that the clearing timescale from pre-supernova and supernova feedback is cluster mass-dependent.","Even in clusters with mass$\\sim$7,000~M$_{\\odot}$, stochastic sampling of the upper end of the stellar initial mass function is present, randomly decreasing the number of massive stars available to inject energy and momentum into the surrounding medium.","This effect may increase the clearing timescales in these clusters by decreasing the effectiveness of both pre-supernova and supernova feedback; neither models nor observations have so far explored such dependence explicitly.","Future studies and observations with, e.g., the JWST, will fill this gap."],"url":"http://arxiv.org/abs/2404.09112v1","category":"astro-ph.GA"}
{"created":"2024-04-14 00:27:06","title":"Higher-derivative deformations of the ModMax theory","abstract":"We present higher-derivative deformations of the ModMax theory which preserve both $\\mathsf{U}(1)$ duality symmetry and Weyl invariance. In particular, we single out a class of deformations expected to describe a low-energy effective action for the ModMax theory. We also elaborate on higher-derivative deformations of the $\\mathcal{N}=1$ super ModMax theory.","sentences":["We present higher-derivative deformations of the ModMax theory which preserve both $\\mathsf{U}(1)$ duality symmetry and Weyl invariance.","In particular, we single out a class of deformations expected to describe a low-energy effective action for the ModMax theory.","We also elaborate on higher-derivative deformations of the $\\mathcal{N}=1$ super ModMax theory."],"url":"http://arxiv.org/abs/2404.09108v1","category":"hep-th"}
{"created":"2024-04-13 22:56:17","title":"The Snake's Beating Heart? A Millisecond Pulsar Binary in the Galactic Center Radio Filament G359.1$-$0.2","abstract":"The Galactic Center radio filament G359.0$-$0.2, often referred to as the ''Snake'', displays two notable kinks that cause its linear structure to deviate from running perpendicular to the Galactic plane. Using Murriyang, the 64 m Parkes radio telescope, we conducted a search for pulsars centered on the position of a previously identified compact radio and X-ray source in the major kink. We discovered a millisecond pulsar (MSP), PSR J1744$-$2946, with a period $P = 8.4$ ms, a dispersion measure of $673.7 \\pm 0.1$ pc cm$^{-3}$ and Faraday rotation measure of $3011 \\pm 3$ rad m$^{-2}$. Its radio pulses are only moderately scattered due to multi-path propagation through the interstellar medium, with a scattering timescale of $0.87 \\pm 0.08$ ms at 2.6 GHz. The pulsar is bound in a 4.8 hr circular orbit around a $M_{\\rm c} > 0.05$ M$_{\\odot}$ companion. Our discovery of the first MSP within 1$^{\\circ}$ of the Galactic Center hints at a large population of these objects detectable via high frequency surveys. The potential association with the Snake points toward pulsars as the energy source responsible for illuminating Galactic Center radio filaments.","sentences":["The Galactic Center radio filament G359.0$-$0.2, often referred to as the ''Snake'', displays two notable kinks that cause its linear structure to deviate from running perpendicular to the Galactic plane.","Using Murriyang, the 64 m Parkes radio telescope, we conducted a search for pulsars centered on the position of a previously identified compact radio and X-ray source in the major kink.","We discovered a millisecond pulsar (MSP), PSR J1744$-$2946, with a period $P = 8.4$ ms, a dispersion measure of $673.7 \\pm 0.1$ pc cm$^{-3}$ and Faraday rotation measure of $3011 \\pm 3$ rad m$^{-2}$.","Its radio pulses are only moderately scattered due to multi-path propagation through the interstellar medium, with a scattering timescale of $0.87 \\pm 0.08$ ms at 2.6 GHz.","The pulsar is bound in a 4.8 hr circular orbit around a $M_{\\rm c} > 0.05$ M$_{\\odot}$ companion.","Our discovery of the first MSP within 1$^{\\circ}$ of the Galactic Center hints at a large population of these objects detectable via high frequency surveys.","The potential association with the Snake points toward pulsars as the energy source responsible for illuminating Galactic Center radio filaments."],"url":"http://arxiv.org/abs/2404.09098v1","category":"astro-ph.HE"}
