{"created":"2024-04-18 17:22:10","title":"Quantum thermophoresis","abstract":"Thermophoresis is the migration of a particle due to a thermal gradient. Here, we theoretically uncover the quantum version of thermophoresis. As a proof of principle, we analytically find a thermophoretic force on a trapped quantum particle having three energy levels in $\\Lambda$ configuration. We then consider a model of N sites, each coupled to its first neighbors and subjected to a local bath at a certain temperature, so as to show numerically how quantum thermophoresis behaves with increasing delocalization of the quantum particle. We discuss how negative thermophoresis and the Dufour effect appear in the quantum regime.","sentences":["Thermophoresis is the migration of a particle due to a thermal gradient.","Here, we theoretically uncover the quantum version of thermophoresis.","As a proof of principle, we analytically find a thermophoretic force on a trapped quantum particle having three energy levels in $\\Lambda$ configuration.","We then consider a model of N sites, each coupled to its first neighbors and subjected to a local bath at a certain temperature, so as to show numerically how quantum thermophoresis behaves with increasing delocalization of the quantum particle.","We discuss how negative thermophoresis and the Dufour effect appear in the quantum regime."],"url":"http://arxiv.org/abs/2404.12346v1","category":"quant-ph"}
{"created":"2024-04-18 16:58:05","title":"A Perspective on Deep Vision Performance with Standard Image and Video Codecs","abstract":"Resource-constrained hardware, such as edge devices or cell phones, often rely on cloud servers to provide the required computational resources for inference in deep vision models. However, transferring image and video data from an edge or mobile device to a cloud server requires coding to deal with network constraints. The use of standardized codecs, such as JPEG or H.264, is prevalent and required to ensure interoperability. This paper aims to examine the implications of employing standardized codecs within deep vision pipelines. We find that using JPEG and H.264 coding significantly deteriorates the accuracy across a broad range of vision tasks and models. For instance, strong compression rates reduce semantic segmentation accuracy by more than 80% in mIoU. In contrast to previous findings, our analysis extends beyond image and action classification to localization and dense prediction tasks, thus providing a more comprehensive perspective.","sentences":["Resource-constrained hardware, such as edge devices or cell phones, often rely on cloud servers to provide the required computational resources for inference in deep vision models.","However, transferring image and video data from an edge or mobile device to a cloud server requires coding to deal with network constraints.","The use of standardized codecs, such as JPEG or H.264, is prevalent and required to ensure interoperability.","This paper aims to examine the implications of employing standardized codecs within deep vision pipelines.","We find that using JPEG and H.264 coding significantly deteriorates the accuracy across a broad range of vision tasks and models.","For instance, strong compression rates reduce semantic segmentation accuracy by more than 80% in mIoU. In contrast to previous findings, our analysis extends beyond image and action classification to localization and dense prediction tasks, thus providing a more comprehensive perspective."],"url":"http://arxiv.org/abs/2404.12330v1","category":"cs.CV"}
{"created":"2024-04-18 16:45:39","title":"Laser excitation of the $^{229}$Th nuclear isomeric transition in a solid-state host","abstract":"LiSrAlF$_6$ crystals doped with $^{229}$Th are used in a laser-based search for the nuclear isomeric transition. Two spectroscopic features near the nuclear transition energy are observed. The first is a broad excitation feature that produces red-shifted fluorescence that decays with a timescale of a few seconds. The second is a narrow, laser-linewidth-limited spectral feature at $148.38219(4)_{\\textrm{stat}}(20)_{\\textrm{sys}}$ nm ($2020407.3(5)_{\\textrm{stat}}(30)_{\\textrm{sys}}$ GHz) that decays with a lifetime of $568(13)_{\\textrm{stat}}(20)_{\\textrm{sys}}$ s. This feature is assigned to the excitation of the $^{229}$Th nuclear isomeric state, whose energy is found to be $8.355733(2)_{\\textrm{stat}}(10)_{\\textrm{sys}}$ eV in $^{229}$Th:\\thor:LiSrAlF$_6$.","sentences":["LiSrAlF$_6$ crystals doped with $^{229}$Th are used in a laser-based search for the nuclear isomeric transition.","Two spectroscopic features near the nuclear transition energy are observed.","The first is a broad excitation feature that produces red-shifted fluorescence that decays with a timescale of a few seconds.","The second is a narrow, laser-linewidth-limited spectral feature at $148.38219(4)_{\\textrm{stat}}(20)_{\\textrm{sys}}$ nm ($2020407.3(5)_{\\textrm{stat}}(30)_{\\textrm{sys}}$ GHz) that decays with a lifetime of $568(13)_{\\textrm{stat}}(20)_{\\textrm{sys}}$ s.","This feature is assigned to the excitation of the $^{229}$Th nuclear isomeric state, whose energy is found to be $8.355733(2)_{\\textrm{stat}}(10)_{\\textrm{sys}}$ eV in $^{229}$Th:\\thor:LiSrAlF$_6$."],"url":"http://arxiv.org/abs/2404.12311v1","category":"physics.atom-ph"}
{"created":"2024-04-18 16:33:01","title":"Switchable Single/Dual Edge Registers for Pipeline Architecture","abstract":"The demand for low power processing is increasing due to mobile and portable devices. In a processor unit, an adder is an important building block since it is used in Floating Point Units (FPU) and Arithmetic Logic Units (ALU). Also, pipeline techniques are used extensively to improve the throughput of the processing unit. To implement a pipeline requires adding a register at each sub-stage that result in increasing the latency. Moreover, designing a low power pipeline adder with low latency has drawn a lot of attention. In a pipelined architecture that uses Dual Edge Triggered (DET) based registers can help in reducing the latency since they can capture input data at both clock edges. However, for high input activity, a DET flip-flop consumes more power than a Single-Edge Triggered (SET) flip-flop. Moreover, it is required to replace each Flip-Flop (FF) in the processor with Dual Edge Triggered (DET) Flip-Flop which will be a considerable area and power overhead. Therefore, it is desirable to have a switchable DET to SET depending on input activity or load condition to reduce the dynamic power consumption. In this paper, we are proposing a new shift register which imitates DET FF based shift register without the need of special DET FF. The proposed shift register improved the latency in a 4-bit pipelined adder by two-fold. Additionally, the power delay product was reduced by 44.16 %.","sentences":["The demand for low power processing is increasing due to mobile and portable devices.","In a processor unit, an adder is an important building block since it is used in Floating Point Units (FPU) and Arithmetic Logic Units (ALU).","Also, pipeline techniques are used extensively to improve the throughput of the processing unit.","To implement a pipeline requires adding a register at each sub-stage that result in increasing the latency.","Moreover, designing a low power pipeline adder with low latency has drawn a lot of attention.","In a pipelined architecture that uses Dual Edge Triggered (DET) based registers can help in reducing the latency since they can capture input data at both clock edges.","However, for high input activity, a DET flip-flop consumes more power than a Single-Edge Triggered (SET) flip-flop.","Moreover, it is required to replace each Flip-Flop (FF) in the processor with Dual Edge Triggered (DET) Flip-Flop which will be a considerable area and power overhead.","Therefore, it is desirable to have a switchable DET to SET depending on input activity or load condition to reduce the dynamic power consumption.","In this paper, we are proposing a new shift register which imitates DET FF based shift register without the need of special DET FF.","The proposed shift register improved the latency in a 4-bit pipelined adder by two-fold.","Additionally, the power delay product was reduced by 44.16 %."],"url":"http://arxiv.org/abs/2404.12306v1","category":"cs.AR"}
