{"created":"2024-04-07 07:34:49","title":"SLPL SHROOM at SemEval2024 Task 06: A comprehensive study on models ability to detect hallucination","abstract":"Language models, particularly generative models, are susceptible to hallucinations, generating outputs that contradict factual knowledge or the source text. This study explores methods for detecting hallucinations in three SemEval-2024 Task 6 tasks: Machine Translation, Definition Modeling, and Paraphrase Generation. We evaluate two methods: semantic similarity between the generated text and factual references, and an ensemble of language models that judge each other's outputs. Our results show that semantic similarity achieves moderate accuracy and correlation scores in trial data, while the ensemble method offers insights into the complexities of hallucination detection but falls short of expectations. This work highlights the challenges of hallucination detection and underscores the need for further research in this critical area.","sentences":["Language models, particularly generative models, are susceptible to hallucinations, generating outputs that contradict factual knowledge or the source text.","This study explores methods for detecting hallucinations in three SemEval-2024 Task 6 tasks: Machine Translation, Definition Modeling, and Paraphrase Generation.","We evaluate two methods: semantic similarity between the generated text and factual references, and an ensemble of language models that judge each other's outputs.","Our results show that semantic similarity achieves moderate accuracy and correlation scores in trial data, while the ensemble method offers insights into the complexities of hallucination detection but falls short of expectations.","This work highlights the challenges of hallucination detection and underscores the need for further research in this critical area."],"url":"http://arxiv.org/abs/2404.04845v2","category":"cs.CL"}
{"created":"2024-04-08 07:11:33","title":"Lightweight Inference for Forward-Forward Algorithm","abstract":"The human brain performs tasks with an outstanding energy-efficiency, i.e., with approximately 20 Watts. The state-of-the-art Artificial/Deep Neural Networks (ANN/DNN), on the other hand, have recently been shown to consume massive amounts of energy. The training of these ANNs/DNNs is done almost exclusively based on the back-propagation algorithm, which is known to be biologically implausible. This has led to a new generation of forward-only techniques, including the Forward-Forward algorithm. In this paper, we propose a lightweight inference scheme specifically designed for DNNs trained using the Forward-Forward algorithm. We have evaluated our proposed lightweight inference scheme in the case of the MNIST and CIFAR datasets, as well as two real-world applications, namely, epileptic seizure detection and cardiac arrhythmia classification using wearable technologies, where complexity overheads/energy consumption is a major constraint, and demonstrate its relevance.","sentences":["The human brain performs tasks with an outstanding energy-efficiency, i.e., with approximately 20 Watts.","The state-of-the-art Artificial/Deep Neural Networks (ANN/DNN), on the other hand, have recently been shown to consume massive amounts of energy.","The training of these ANNs/DNNs is done almost exclusively based on the back-propagation algorithm, which is known to be biologically implausible.","This has led to a new generation of forward-only techniques, including the Forward-Forward algorithm.","In this paper, we propose a lightweight inference scheme specifically designed for DNNs trained using the Forward-Forward algorithm.","We have evaluated our proposed lightweight inference scheme in the case of the MNIST and CIFAR datasets, as well as two real-world applications, namely, epileptic seizure detection and cardiac arrhythmia classification using wearable technologies, where complexity overheads/energy consumption is a major constraint, and demonstrate its relevance."],"url":"http://arxiv.org/abs/2404.05241v2","category":"cs.LG"}
