{"created":"2024-05-21 15:42:32","title":"A Catalog of Broad Hα and Hβ Active Galactic Nuclei in MaNGA","abstract":"Broad H$\\alpha$ and H$\\beta$ emission lines (FWHM > 1,000 km s$^{-1}$) are incredibly efficient tracers of the high-velocity clouds encircling Active Galactic Nuclei (AGN). As a result, we search for these broad line AGN in the Sloan Digital Sky Survey's Mapping Nearby Galaxies at Apache Point Observatory (MaNGA) catalog. We identify 301 broad-line H$\\alpha$ galaxies and 801 broad-line H$\\beta$ galaxies in the catalog. In total, we detect 1,042 unique broad-line galaxies with luminosities between 10$^{37}$ - 10$^{43}$ erg s$^{-1}$ and inferred supermassive black hole masses between 10$^{5}$ - 10$^{10}$ $M_{\\odot}$; 60 feature both broad H$\\alpha$ and broad H$\\beta$ emission. We also determine that the broad line region radius ranges between 0.01 - 46 light days, with a median radius of 0.1 light days (0.02 pc) for our broad H$\\beta$ sample. In addition, we find that both samples feature a higher fraction of galaxy mergers (44% for the broad H$\\alpha$ sample and 43% for the broad H$\\beta$ sample), compared to the full MaNGA galaxy sample (26%), which suggests that merger-driven fueling is strongly active in our sample.","sentences":["Broad H$\\alpha$ and H$\\beta$ emission lines (FWHM > 1,000 km s$^{-1}$) are incredibly efficient tracers of the high-velocity clouds encircling Active Galactic Nuclei (AGN).","As a result, we search for these broad line AGN in the Sloan Digital Sky Survey's Mapping Nearby Galaxies at Apache Point Observatory (MaNGA) catalog.","We identify 301 broad-line H$\\alpha$ galaxies and 801 broad-line H$\\beta$ galaxies in the catalog.","In total, we detect 1,042 unique broad-line galaxies with luminosities between 10$^{37}$ - 10$^{43}$ erg s$^{-1}$ and inferred supermassive black hole masses between 10$^{5}$ - 10$^{10}$ $M_{\\odot}$; 60 feature both broad H$\\alpha$ and broad H$\\beta$ emission.","We also determine that the broad line region radius ranges between 0.01 - 46 light days, with a median radius of 0.1 light days (0.02 pc) for our broad H$\\beta$ sample.","In addition, we find that both samples feature a higher fraction of galaxy mergers (44% for the broad H$\\alpha$ sample and 43% for the broad H$\\beta$ sample), compared to the full MaNGA galaxy sample (26%), which suggests that merger-driven fueling is strongly active in our sample."],"url":"http://arxiv.org/abs/2405.12873v2","category":"astro-ph.GA"}
